#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Manny_JetSki

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Manny_JetSki.ABP_Manny_JetSki_C
// 0x0860 (0x0C50 - 0x03F0)
class UABP_Manny_JetSki_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0408(0x00B8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x04C0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0588(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05A8(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x05C8(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A80(0x0048)()
	uint8                                         Pad_AC8[0x8];                                      // 0x0AC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_RightHand_F563891D464AEB9DA6FA20B099375803; // 0x0AD0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_LeftHand_F563891D464AEB9DA6FA20B099375803; // 0x0B30(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Left_Hand;                                         // 0x0B90(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Right_Hand;                                        // 0x0BF0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_Manny_JetSki(int32 EntryPoint);
	struct FTransform GetComponentTransformByTag(class AActor* Actor, class FName Tag);
	void PossessedVehicle(const struct FPoseLink& InPose, struct FPoseLink* PossessedVehicle_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Manny_JetSki_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Manny_JetSki_C")
	}
	static class UABP_Manny_JetSki_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Manny_JetSki_C>();
	}
};
DUMPER7_ASSERTS_UABP_Manny_JetSki_C;

}

