#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Equipment_Base

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_Equipment_Base_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Equipment_Base.ABP_Equipment_Base_C
// 0x2CA0 (0x3090 - 0x03F0)
class UABP_Equipment_Base_C : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Equipment_Base::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x03F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0418(0x0008)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0420(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x04E8(0x00E8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x05D0(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x06B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x0700(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x0780(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x07A8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x07D0(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x08B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x0900(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x0980(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x09A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x09D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x09F8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0A20(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x0B08(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B88(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0BD8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0C58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0C80(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0CA8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0CC8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0D48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0DC8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0DF0(0x04B8)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x12A8(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x13A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x13C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x13F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1490(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_17;                // 0x14B8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x14F8(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_16;                // 0x1518(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_15;                // 0x1558(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1598(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x15E0(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_14;                // 0x1630(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_13;                // 0x1670(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x16B0(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1700(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_12;                // 0x1750(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1790(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x17D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x17F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1920(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1A48(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1B70(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1C98(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1DC0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1EE8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1F08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1F28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1F70(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x1F90(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x1FD0(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x2098(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x20D8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x2118(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x2158(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x2198(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x21D8(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x2218(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x22E0(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x23A8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x23E8(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x2428(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x2478(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x24B8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x24F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2518(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x25F0(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x2670(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2738(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2760(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x27A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x27C0(0x00D8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2898(0x0080)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2918(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x29D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x29F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2A20(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2A48(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2A68(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2B50(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2B98(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2C18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2C40(0x0028)()
	double                                        __CustomProperty_Influence_A3E9911A49E3884EFA399497190AEDA8; // 0x2C68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_EquipmentOffset_A3E9911A49E3884EFA399497190AEDA8; // 0x2C70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C88[0x8];                                     // 0x2C88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_IKOffset_A3E9911A49E3884EFA399497190AEDA8; // 0x2C90(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LHandIKMultiplier_A3E9911A49E3884EFA399497190AEDA8; // 0x2CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_UseControlRotation_A3E9911A49E3884EFA399497190AEDA8; // 0x2CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CF9[0x7];                                     // 0x2CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Control_A3E9911A49E3884EFA399497190AEDA8; // 0x2D00(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_Spring_A3E9911A49E3884EFA399497190AEDA8; // 0x2D60(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Duck_A3E9911A49E3884EFA399497190AEDA8; // 0x2DC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC8[0x8];                                     // 0x2DC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Recoil_A3E9911A49E3884EFA399497190AEDA8; // 0x2DD0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Pitch;                                             // 0x2E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Yaw;                                               // 0x2E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RecoilTransform;                                   // 0x2E40(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DuckAmount;                                        // 0x2EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA8[0x8];                                     // 0x2EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpringTransform;                                   // 0x2EB0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ADSAmount;                                         // 0x2F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVoyageCharacter*                       CharacterRef;                                      // 0x2F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVoyageEquipmentActor*                  EquipmentActorRef;                                 // 0x2F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F28[0x8];                                     // 0x2F28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ControlTransform;                                  // 0x2F30(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InspectAmount;                                     // 0x2F90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanInspectGear;                                   // 0x2F94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F95[0x3];                                     // 0x2F95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ControlRigAlpha;                                   // 0x2F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InputRotationDelta;                                // 0x2FA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InputMovementDelta;                                // 0x2FB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CharacterVelocity;                                 // 0x2FC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyageWeaponHolsterComponent*          WeaponHolsterComponentRef;                         // 0x2FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsMovingOnGround;                                  // 0x2FE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFalling;                                         // 0x2FE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FEA[0x6];                                     // 0x2FEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ControlRigInfluence;                               // 0x2FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LHandIKMultiplier;                                 // 0x2FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoyageEquipmentPoseType                      PoseType;                                          // 0x3000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3001[0x7];                                     // 0x3001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ChargeAmount;                                      // 0x3008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             IKOffset;                                          // 0x3010(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoyageEquipmentInterpState                   InspectState;                                      // 0x3070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3071[0x7];                                     // 0x3071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EquipmentOffset;                                   // 0x3078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CanInspectGear(bool* bCanInspect);
	void Equipment(const struct FPoseLink& InPose, struct FPoseLink* Equipment_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_BlendListByBool_16527B624BC35947A1B999A9084F1FC2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_84B94B7D4569E28E73D4B8A1A36E0CE8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_ADFF7C7D4A62529172462C9711B29F28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_BF17749C4E6E4DC5424EDC8D28287404();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_DE2ADC374FD79EE17A5E8CB173AD89EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_E83C6D7A487B67DACC7887B64786A93B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_ModifyBone_FDE262154BD9DE3C1AD3249ABC2601C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_26D3770542356DB5DEE9DA8BA52D1A73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_285D262A48B885A7BC125BB6EF7DDC54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_339993204F21214046818DBDD3ACE41C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_9BA0C39C4669C2F8069568B08ABC12D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_B1245D694EB1FD410CD75681279F1DA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_C05B99CE465B1E5A828F8291E674FC9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_CCEB21D34F36A9116CC0D9A68F498DCB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_D25B3E4B48FFC99E34AAA38B451D9EC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_D71C2607468B763BDE2D3EA90A29D97F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Equipment_Base_AnimGraphNode_TransitionResult_E724080047B783C005463A9850A05329();
	void ExecuteUbergraph_ABP_Equipment_Base(int32 EntryPoint);
	void GetActiveHolsterActor(class AVoyageBaseCharacter* Character, class AVoyageEquipmentActor** EquipmentActor);
	void GetControlRigAlpha(double* Alpha);
	void GetPoseType(class AVoyageEquipmentActor* EquipmentActor, EVoyageEquipmentPoseType* Type);
	void IsRightHandedPose(bool* RightHanded);
	void ShouldPoseUseIK(EVoyageEquipmentPoseType PoseType_0, bool* bUseIK);
	void UseDisableIKCurve(double* Value, bool* bValid);
	void UseStiffnessCurve(double* Value, bool* bValid);

	void IsLookingGear(bool* bValid) const;
	void IsTacticalRunning(bool* bValid) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Equipment_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Equipment_Base_C")
	}
	static class UABP_Equipment_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Equipment_Base_C>();
	}
};
DUMPER7_ASSERTS_UABP_Equipment_Base_C;

}

