#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BallRobot_ControlRig_ProcWalk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass BallRobot_ControlRig_ProcWalk.BallRobot_ControlRig_ProcWalk_C
// 0x0040 (0x0C00 - 0x0BC0)
class UBallRobot_ControlRig_ProcWalk_C final : public UControlRig
{
public:
	TArray<struct FVector>                        CTRL_Position;                                     // 0x0BC0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRigElementKey>                 LegControls;                                       // 0x0BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        RootOffsetZ;                                       // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                LegOffsetZ;                                        // 0x0BE8(0x0010)(Edit, BlueprintVisible)
	bool                                          UseCCDIK;                                          // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BallRobot_ControlRig_ProcWalk_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BallRobot_ControlRig_ProcWalk_C")
	}
	static class UBallRobot_ControlRig_ProcWalk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBallRobot_ControlRig_ProcWalk_C>();
	}
};
DUMPER7_ASSERTS_UBallRobot_ControlRig_ProcWalk_C;

}

