#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmmoSelectorValidator

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_AmmoSelectorValidator.BP_AmmoSelectorValidator_C.OnValidate
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AmmoSelectorValidator_C_OnValidate final
{
public:
	class AVoyagePlayerController*                InInstigator;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageOverlayValidatorResult          ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetNoAmmoInBackpackText_ReturnValue;      // 0x0020(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageWeaponHolsterComponent*          CallFunc_GetWeaponHolsterComponent_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageEquipmentActor*                  CallFunc_GetActiveSlotActor_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 K2Node_DynamicCast_AsVoyage_Weapon_Ballistic;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageOverlayValidatorResult          K2Node_MakeStruct_VoyageOverlayValidatorResult;    // 0x0060(0x0018)()
	TArray<class UVoyageItemAmmo*>                CallFunc_FindAmmoFromInventory_OutAmmoItems;       // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageOverlayValidatorResult          K2Node_MakeStruct_VoyageOverlayValidatorResult_1;  // 0x0090(0x0018)()
};
DUMPER7_ASSERTS_BP_AmmoSelectorValidator_C_OnValidate;

}

