#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AdminWidget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_AdminWidget.BP_AdminWidget_C
// 0x0068 (0x0730 - 0x06C8)
class UBP_AdminWidget_C final : public UVoyageAdminWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TerminalScreen_Widget_C*           WBP_TerminalScreen_Widget;                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             txtLocation;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_TabControlWidget_C*                 TabControlWidget;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CopyToClipboard_bt;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageCheatWiget_C*                 BP_VoyageCheatWiget;                               // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SaveGameWidget_C*                   BP_SaveGameWidget;                                 // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MinimapWidget_C*                    BP_MinimapWidget;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_InspectDynamicMesh_C*               BP_InspectDynamicMesh;                             // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                PlayerLocation;                                    // 0x0710(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyageTerminalAppObject*               In_App_Object;                                     // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_AdminWidget_CopyToClipboard_bt_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void CloseWidget();
	void Construct();
	void ExecuteUbergraph_BP_AdminWidget(int32 EntryPoint);
	bool GetGrabText(class AActor* InInteractor, const class FText& InText, class FText* OutText);
	class UVoyageCrosshairWidgetData* GetInteractCrosshair(class AActor* InInteractor, int32 PartId);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractiveProvidedGrabActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	bool GetScanText(struct FVoyageScanText* OutText, class APlayerController* InInstigator);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	void OnActiveTabChanged_Event(class UVoyageTabControlWidget* Widget, class UWidgetSwitcher* Switcher, int32 ActiveTab);
	void PlayerInteraction(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void PlayerInteractionRelease(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AdminWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AdminWidget_C")
	}
	static class UBP_AdminWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AdminWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_AdminWidget_C;

}

