#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boat_Base

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Boat_Base.BP_Boat_Base_C.ExecuteUbergraph_BP_Boat_Base
// 0x0038 (0x0038 - 0x0000)
struct BP_Boat_Base_C_ExecuteUbergraph_BP_Boat_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_MyCharacter_2;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PartId;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_MyCharacter_1;                        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            K2Node_Event_InteractiveObjectComponent_1;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_MyCharacter;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            K2Node_Event_InteractiveObjectComponent;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_ExecuteUbergraph_BP_Boat_Base;

// Function BP_Boat_Base.BP_Boat_Base_C.GetInteractIndices
// 0x0020 (0x0020 - 0x0000)
struct BP_Boat_Base_C_GetInteractIndices final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OutIndices;                                        // 0x0008(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_GetInteractIndices;

// Function BP_Boat_Base.BP_Boat_Base_C.GetInteractiveProvidedActions
// 0x0028 (0x0028 - 0x0000)
struct BP_Boat_Base_C_GetInteractiveProvidedActions final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerInputInterfaceAction>    OutActions;                                        // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_GetInteractiveProvidedActions;

// Function BP_Boat_Base.BP_Boat_Base_C.GetInteractiveProvidedGrabActions
// 0x0028 (0x0028 - 0x0000)
struct BP_Boat_Base_C_GetInteractiveProvidedGrabActions final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerInputInterfaceAction>    OutActions;                                        // 0x0010(0x0010)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_GetInteractiveProvidedGrabActions;

// Function BP_Boat_Base.BP_Boat_Base_C.InteractAction
// 0x0010 (0x0010 - 0x0000)
struct BP_Boat_Base_C_InteractAction final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_InteractAction;

// Function BP_Boat_Base.BP_Boat_Base_C.InteractActionPartial
// 0x0018 (0x0018 - 0x0000)
struct BP_Boat_Base_C_InteractActionPartial final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_InteractActionPartial;

// Function BP_Boat_Base.BP_Boat_Base_C.InteractGetInventory
// 0x0018 (0x0018 - 0x0000)
struct BP_Boat_Base_C_InteractGetInventory final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageBaseInventoryComponent*          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_InteractGetInventory;

// Function BP_Boat_Base.BP_Boat_Base_C.InteractWithGrab
// 0x0010 (0x0010 - 0x0000)
struct BP_Boat_Base_C_InteractWithGrab final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractWithGrabReturnValue                  OutValue;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_InteractWithGrab;

// Function BP_Boat_Base.BP_Boat_Base_C.PlayerInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_Boat_Base_C_PlayerInteraction final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveObjectComponent;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_PlayerInteraction;

// Function BP_Boat_Base.BP_Boat_Base_C.PlayerInteractionRelease
// 0x0010 (0x0010 - 0x0000)
struct BP_Boat_Base_C_PlayerInteractionRelease final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveObjectComponent;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_PlayerInteractionRelease;

// Function BP_Boat_Base.BP_Boat_Base_C.ShouldIgnoreVisiblityTrace
// 0x0010 (0x0010 - 0x0000)
struct BP_Boat_Base_C_ShouldIgnoreVisiblityTrace final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Boat_Base_C_ShouldIgnoreVisiblityTrace;

}

