#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boat_Barge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Boat_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boat_Barge.BP_Boat_Barge_C
// 0x0080 (0x06A8 - 0x0628)
class ABP_Boat_Barge_C final : public ABP_Boat_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Boat_Barge_C;                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyagePaintInventoryComponent*         VoyagePaintInventory;                              // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                UDS_Occlusion_Portal2;                             // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                UDS_Occlusion_Portal1;                             // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                UDS_Occlusion_Portal;                              // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PaintIndex;                                        // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UVoyagePaintItem*>          Paints;                                            // 0x0658(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_Boat_Barge(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Boat_Barge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Boat_Barge_C")
	}
	static class ABP_Boat_Barge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boat_Barge_C>();
	}
};
DUMPER7_ASSERTS_ABP_Boat_Barge_C;

}

