#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Boat_Base

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Boat_Base.BP_Boat_Base_C
// 0x0040 (0x0628 - 0x05E8)
class ABP_Boat_Base_C : public AVoyageBoatPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyageInterfaceInputControlsComponent* VoyageInterfaceInputControls;                      // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DurabilityIndicatorComponent_C*     BP_DurabilityIndicatorComponent;                   // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDynamicCollisionComponent*       VoyageDynamicCollision;                            // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 VoyageModule;                                      // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageControllerInputControlsComponent* VoyageControllerInputControls;                    // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Boat_Base(int32 EntryPoint);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractiveProvidedGrabActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	void PlayerInteraction(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void PlayerInteractionRelease(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void ReceiveBeginPlay();
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Boat_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Boat_Base_C")
	}
	static class ABP_Boat_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Boat_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Boat_Base_C;

}

