#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Base_Character

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Base_Character.BP_Base_Character_C
// 0x0540 (0x1280 - 0x0D40)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_Base_Character_C : public AVoyageCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USocketVisualizerComponent_C*           SocketVisualizerComponent;                         // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Physical_Inventory_Output_C*        BP_Physical_Inventory_Output;                      // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HandRNiagara;                                      // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HandLNiagara;                                      // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageBaseInventoryComponent*          FabricatorInventory;                               // 0x0D70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Crowbar;                                           // 0x0D78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0D80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PlayerPostProcess;                                 // 0x0D88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       ElectricSocket;                                    // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavigationInvokerComponent*            NavigationInvoker;                                 // 0x0D98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SpringAttachment_C*                 BP_SpringAttachment;                               // 0x0DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageFabricatorComponent*             VoyageFabricator;                                  // 0x0DA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CharacterAudioComponent;                           // 0x0DB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Foot;                                           // 0x0DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_RightArm;                                       // 0x0DC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_LeftArm;                                        // 0x0DC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Head;                                           // 0x0DD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FocusTarget;                                       // 0x0DD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterMantleComponent_C*         BP_CharacterMantleComponent;                       // 0x0DE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicalAnimationComponent*            PhysicalAnimation;                                 // 0x0DE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RightHandTransform;                                // 0x0DF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeftHandTransform;                                 // 0x0DF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPawnNoiseEmitterComponent*             PawnNoiseEmitter;                                  // 0x0E00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageSwarmAttractorComponent*         VoyageSwarmAttractor;                              // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageSpawnerVolume*                   VoyageAttractorVolume;                             // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x0E18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageAIComponent*                     VoyageAI;                                          // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageLocatorComponent*                VoyageLocator;                                     // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FootStep_Componet_C*                FootStepComponent;                                 // 0x0E30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Audio_Death_Filter_20k_to_150_255624DE43622465F75EEFA5E24C7F77; // 0x0E38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Audio_Death_Filter__Direction_255624DE43622465F75EEFA5E24C7F77; // 0x0E3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3D[0x3];                                      // 0x0E3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Audio_Death_Filter;                                // 0x0E40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HeldItem;                                          // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        OldAcceleration;                                   // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorSpringState                     EquipmentHandleSpring;                             // 0x0E58(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        InterpolationSpeed;                                // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVectorSpringState                     CameraSpring;                                      // 0x0E98(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTransform                             OriginalRelativeTransform;                         // 0x0ED0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RagdollEnabled;                                    // 0x0F30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F31[0x7];                                      // 0x0F31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        PhysicsHits;                                       // 0x0F38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  PhysicsHitsMoving;                                 // 0x0F48(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVoyageFloatingTextData*                Floating_Text_Data;                                // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UVoyageUnitStateComponent*              UnitStateComponent;                                // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UnitStateExpTimer;                                 // 0x0F68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoyageLocatorProperties               Locator_Properties;                                // 0x0F70(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             DamageSound;                                       // 0x1060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FallDmgVelocityThreshold;                          // 0x1068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubmixEffectFilterPreset*              Audio_DeathFilter_Type;                            // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Audio_DeathFilter_Freq;                            // 0x1080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageAmount;                                      // 0x1088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108C[0x4];                                     // 0x108C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           PlayerParameters;                                  // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVoyageItem*>                    TrashItems;                                        // 0x1098(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        CrushDamageThreshold;                              // 0x10A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EVoyageCraftingFilter, TSoftObjectPtr<class UVoyageQuest>> CraftingTutorialQuests;          // 0x10B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<TSoftObjectPtr<class UVoyageSkill>, TSoftObjectPtr<class UVoyageQuest>> SkillTutorialQuests; // 0x1100(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVoyageQuestData                       TutorialQuestInitialState;                         // 0x1150(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CrowbarCounter;                                    // 0x1258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125C[0x4];                                     // 0x125C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PhysicalCapsuleSizeOffset;                         // 0x1260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HoverReferenceComponent;                           // 0x1268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_SocketHoverVisualizer_C*            SocketVisActor;                                    // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyCrushDamage();
	void Audio_Death_Filter__FinishedFunc();
	void Audio_Death_Filter__UpdateFunc();
	void BindSkillUnlockQuest();
	void BndEvt__BP_Base_Character_CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_FirstPersonCharacter_SwimmingBuoyancyComponent_K2Node_ComponentBoundEvent_2_OnPontoonEnteredWater__DelegateSignature(const struct FSphericalPontoon& Pontoon);
	void BndEvt__BP_FirstPersonCharacter_SwimmingBuoyancyComponent_K2Node_ComponentBoundEvent_3_OnPontoonExitedWater__DelegateSignature(const struct FSphericalPontoon& Pontoon);
	void CalculateFallDamage(double Velocity, double* Damage);
	void ExecuteUbergraph_BP_Base_Character(int32 EntryPoint);
	void FilterDismantleOutput(class AActor* TargetActor, const TMap<class UVoyageItem*, int32>& TargetMap, bool HasPattern, TMap<class UVoyageItem*, int32>* Output);
	void GetActiveHolsterActorADSOffset(struct FVector* Offset);
	void GetControllerTransform(struct FTransform* Transform);
	class UVoyagePersistentActorComponent* GetPersistentActorComponent();
	void OnActiveHolsterStateChanged_Event(EVoyageEquipmentInterpStateType InType, EVoyageEquipmentInterpState PrevState, EVoyageEquipmentInterpState NewState);
	void OnActiveHolsterStateValueChanged_Event(EVoyageEquipmentInterpStateType InType, float NewValue);
	void OnAliveChangedDelegate_Event(class AVoyageBaseCharacter* Character, bool Alive);
	void OnCharacterLogFragmentUnlocked_Event(class AVoyagePlayerController* InPlayerController, class UVoyageLogFragmentUnlockSource* Source, class UVoyageLogData* log, int32 FragmentIndex, int32 Fragments);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnJumped();
	void OnLanded(const struct FHitResult& Hit);
	void OnMontageEnded_Event(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageStarted_Event(class UAnimMontage* Montage);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPlayerSkillUnlocked(class AVoyagePlayerState* InPlayerState, class UVoyageSkill* InSkill);
	void OnUnitStateCompExpired();
	void OnVisualizeDamage(const struct FVector& Location, float Amount, const class UDamageType* InDamageType);
	void OnVisualizeDeath();
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	bool RecycleItem(class UVoyageItem* Item, float Count, TMap<class UVoyageItem*, int32>* ItemsOut, float Multiplier, bool EmptyMap, int32 Level, int32 MaxLevel, float ForceChance, class UObject* SeedObject, class AActor* Instigator_0);
	void SetRagdoll(bool bSimulate);
	void SetupMeleeMontage();
	void ShouldShowGlitchPostProcess(bool* NewParam);
	void ShowCrowbar(class UObject* Montage, bool bNewVisibility);
	void SpawnFabricatorInventoryItems();
	void StartTutorialQuest(class UVoyageQuest* Quest);
	void TickSwarmAttractor(float DeltaTime, class UVoyageSwarmAttractorComponent* Attractor, class AVoyageSwarmHandler* SwarmHandler, const TArray<int32>& Particles);
	void UpdateADSCamera(double Amount);

	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Base_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Base_Character_C")
	}
	static class ABP_Base_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Base_Character_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_Base_Character_C;

}

