#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterBatteryWidget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.ExecuteUbergraph_BP_CharacterBatteryWidget
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterBatteryWidget_C_ExecuteUbergraph_BP_CharacterBatteryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0010)(HasGetValueTypeHash)
	EVoyageCharacterWarning                       K2Node_Event_Type_1;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Value;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewWarning;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoyageCharacterWarning                       K2Node_Event_Type;                                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0010)(HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0010)(HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_3;              // 0x0048(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_ExecuteUbergraph_BP_CharacterBatteryWidget;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.HighPressureNotification
// 0x0003 (0x0003 - 0x0000)
struct BP_CharacterBatteryWidget_C_HighPressureNotification final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_HighPressureNotification;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.LowBatteryNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterBatteryWidget_C_LowBatteryNotification final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_LowBatteryNotification;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.LowHealthNotification
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterBatteryWidget_C_LowHealthNotification final
{
public:
	bool                                          bIsLowHealth;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_LowHealthNotification;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.OnWarningAddOrUpdate
// 0x000C (0x000C - 0x0000)
struct BP_CharacterBatteryWidget_C_OnWarningAddOrUpdate final
{
public:
	EVoyageCharacterWarning                       Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewWarning;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_OnWarningAddOrUpdate;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.OnWarningRemove
// 0x0001 (0x0001 - 0x0000)
struct BP_CharacterBatteryWidget_C_OnWarningRemove final
{
public:
	EVoyageCharacterWarning                       Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_OnWarningRemove;

// Function BP_CharacterBatteryWidget.BP_CharacterBatteryWidget_C.TooHeavyNotification
// 0x0003 (0x0003 - 0x0000)
struct BP_CharacterBatteryWidget_C_TooHeavyNotification final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CharacterBatteryWidget_C_TooHeavyNotification;

}

