#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CableBuilder

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CableBuilder.BP_CableBuilder_C.ExecuteUbergraph_BP_CableBuilder
// 0x0028 (0x0028 - 0x0000)
struct BP_CableBuilder_C_ExecuteUbergraph_BP_CableBuilder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetRuntimeSpawnedActor_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AModulesConnectCable*                   K2Node_DynamicCast_AsModules_Connect_Cable;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CableBuilder_C_ExecuteUbergraph_BP_CableBuilder;

// Function BP_CableBuilder.BP_CableBuilder_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_CableBuilder_C_UserConstructionScript final
{
public:
	class AModulesConnectCable*                   K2Node_DynamicCast_AsModules_Connect_Cable;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CableBuilder_C_UserConstructionScript;

}

