#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CMA_Fabricate_Queue

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CMA_Fabricate_Queue.BP_CMA_Fabricate_Queue_C
// 0x0020 (0x0048 - 0x0028)
class UBP_CMA_Fabricate_Queue_C final : public UVoyageContextMenuAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Count;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                In_Data_Object;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVoyageFabricatorComponent*             Fabricator;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CMA_Fabricate_Queue(int32 EntryPoint);
	void GetInteractiveSource(class UWidget* Widget, class AActor** Actor);
	struct FVoyageContextMenuBindState GetState(class APlayerController* Interactor, class UVoyageContextMenuWidget* InContextMenu, class UObject* InDataObject);
	void OnExecute(class APlayerController* Interactor, class UVoyageContextMenuWidget* InContextMenu, class UObject* InDataObject);
	void TryBuild(class AVoyagePlayerController* PlayerController, class UVoyageItem* Item);
	void TryQueue(class AVoyagePlayerController* PlayerController, class UVoyageItem* Item);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CMA_Fabricate_Queue_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CMA_Fabricate_Queue_C")
	}
	static class UBP_CMA_Fabricate_Queue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CMA_Fabricate_Queue_C>();
	}
};
DUMPER7_ASSERTS_UBP_CMA_Fabricate_Queue_C;

}

