#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Computer_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Computer_Screen.BP_Computer_Screen_C
// 0x0030 (0x0358 - 0x0328)
class UBP_Computer_Screen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           MessageListBox;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CleatBtn;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PowerOn;                                           // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PowerOff;                                          // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MessageWidget;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AddMessage(const class FText& In_text);
	void BndEvt__BP_Computer_Screen_Button_8_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ClearScreen();
	void ExecuteUbergraph_BP_Computer_Screen(int32 EntryPoint);
	void SetScreenState(bool Powered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Computer_Screen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Computer_Screen_C")
	}
	static class UBP_Computer_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Computer_Screen_C>();
	}
};
DUMPER7_ASSERTS_UBP_Computer_Screen_C;

}

