#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraPath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CameraPath_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CameraPath.BP_CameraPath_C
// 0x0098 (0x0348 - 0x02B0)
class ABP_CameraPath_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       TargetSpline;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CameraSpline;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FCameraPath                            Path;                                              // 0x02D8(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Step;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UArrowComponent*>                Arrows;                                            // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           Cameras;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UArrowComponent*>                ToDestroy;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UStaticMeshComponent*                   HighlightedCamera;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Index)>   OnCameraSelected;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddArrows();
	void AddCameras();
	void CalculateTangents();
	void ClearArrows();
	void DeselectCamera();
	void DestroyArrowComponents();
	void DestroyCameraComponents();
	void ExecuteUbergraph_BP_CameraPath(int32 EntryPoint);
	void GeneratePoints();
	struct FRotator GetLocationRotationAtDistance(float Distance, struct FVector* Location);
	struct FRotator GetLocationRotationAtTime(double Time, bool ConstantVelocity, struct FVector* Location);
	void GetRotationAtTime(float Time, bool bUseConstantVelocity, struct FRotator* Rotation);
	struct FTransform GetTransformAtTime(float Time, bool bUseConstantVelocity);
	void Rebuild();
	void SelectCamera(int32 Index_0, bool CallDispatcher);
	void UpdateCaptureUsingTransform(const struct FTransform& Transform);
	void UpdatePath(const struct FCameraPath& Path_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CameraPath_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CameraPath_C")
	}
	static class ABP_CameraPath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CameraPath_C>();
	}
};
DUMPER7_ASSERTS_ABP_CameraPath_C;

}

