#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CMA_Fabricate_Queue_Parts

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CMA_Fabricate_Queue_Parts.BP_CMA_Fabricate_Queue_Parts_C
// 0x0068 (0x0090 - 0x0028)
class UBP_CMA_Fabricate_Queue_Parts_C final : public UVoyageContextMenuAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UVoyageItem*, int32>               Items_Required;                                    // 0x0030(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OnlyMissingParts;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceAllParts;                                     // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageFabricatorComponent*             Fabricator;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CMA_Fabricate_Queue_Parts(int32 EntryPoint);
	void GetInteractiveSource(class UWidget* Widget, class AActor** Actor);
	struct FVoyageContextMenuBindState GetState(class APlayerController* Interactor, class UVoyageContextMenuWidget* InContextMenu, class UObject* InDataObject);
	void OnExecute(class APlayerController* Interactor, class UVoyageContextMenuWidget* InContextMenu, class UObject* InDataObject);
	void TryQueue(class AVoyagePlayerController* PlayerController, class UVoyageItem* Item);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CMA_Fabricate_Queue_Parts_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CMA_Fabricate_Queue_Parts_C")
	}
	static class UBP_CMA_Fabricate_Queue_Parts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CMA_Fabricate_Queue_Parts_C>();
	}
};
DUMPER7_ASSERTS_UBP_CMA_Fabricate_Queue_Parts_C;

}

