#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterMantleComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterMantleComponent.BP_CharacterMantleComponent_C
// 0x0108 (0x01C8 - 0x00C0)
class UBP_CharacterMantleComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MaxMantleHeight;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MantleRadius;                                      // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovementForward;                                   // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowMantle;                                       // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MantleProgress;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MantleStart;                                       // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MantleEnd;                                         // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AVoyageCharacter>        Character;                                         // 0x0120(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          MantleInProgress;                                  // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPrimitiveComponent>     MantleTargetComponent;                             // 0x0150(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FRotator                               MantleRotation;                                    // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             OriginalCollision;                                 // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinimumMantleTargetMass;                           // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPrimitiveComponent>     MantleTargetComponentInitial;                      // 0x01A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool AnyHasPhysicsCollision(TArray<class UPrimitiveComponent*>& Array);
	bool CheckMantleLocation(const TArray<class AActor*>& ActorsToIgnore, const struct FVector& Start, const struct FVector& End, float Radius, struct FHitResult* OutHit);
	void ExecuteUbergraph_BP_CharacterMantleComponent(int32 EntryPoint);
	void FinishMantle();
	void OnBlendOut_A90BDEC54909C8F1C17577824E36A41F(class FName NotifyName);
	void OnCompleted_A90BDEC54909C8F1C17577824E36A41F(class FName NotifyName);
	void OnInterrupted_A90BDEC54909C8F1C17577824E36A41F(class FName NotifyName);
	void OnNotifyBegin_A90BDEC54909C8F1C17577824E36A41F(class FName NotifyName);
	void OnNotifyEnd_A90BDEC54909C8F1C17577824E36A41F(class FName NotifyName);
	void ReceiveTick(float DeltaSeconds);
	void UnCrouch();
	void UpdateMantle(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharacterMantleComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharacterMantleComponent_C")
	}
	static class UBP_CharacterMantleComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterMantleComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_CharacterMantleComponent_C;

}

