#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Crosshair_Widget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Crosshair_Widget.BP_Crosshair_Widget_C
// 0x0028 (0x06B8 - 0x0690)
class UBP_Crosshair_Widget_C final : public UVoyageCrosshairWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ToolProgressTB;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ToolProgressBar;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PhysicsGrab;                                       // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tool;                                              // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Crosshair_Widget(int32 EntryPoint);
	void OnActionProgressUpdated(EVoyageActionType InType, float Progress);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Crosshair_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Crosshair_Widget_C")
	}
	static class UBP_Crosshair_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Crosshair_Widget_C>();
	}
};
DUMPER7_ASSERTS_UBP_Crosshair_Widget_C;

}

