#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamagedPart_Module

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamagedPart_Module.BP_DamagedPart_Module_C
// 0x0068 (0x0378 - 0x0310)
class ABP_DamagedPart_Module_C : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SmokeDamageFX;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SparksDamagaFX;                                    // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Root;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            RepairedStaticMesh;                                // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DestroyedStaticMesh;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageModuleActor*                     RequiredRequirementOf;                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                EffectComponents;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   RequirementPrefix;                                 // 0x0368(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__BP_DamagedPart_Module_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDurabilityChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, float Durability);
	void CreateCustomRequirement();
	void ExecuteUbergraph_BP_DamagedPart_Module(int32 EntryPoint);
	void OnPersistentSubsystemPostLoad(int32 Version);
	void ReceiveBeginPlay();
	void SetCustomRequirementMet(bool Met);
	void Update_State();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DamagedPart_Module_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DamagedPart_Module_C")
	}
	static class ABP_DamagedPart_Module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamagedPart_Module_C>();
	}
};
DUMPER7_ASSERTS_ABP_DamagedPart_Module_C;

}

