#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamagedPart_Module_Navigation_Array

#include "Basic.hpp"

#include "BP_DamagedPart_Module_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamagedPart_Module_Navigation_Array.BP_DamagedPart_Module_Navigation_Array_C
// 0x0040 (0x03B8 - 0x0378)
class ABP_DamagedPart_Module_Navigation_Array_C final : public ABP_DamagedPart_Module_C
{
public:
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Deco_Int_Wall_Elec_53_StaticMeshComponent0;     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DamagedPart_Module_Navigation_Array_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DamagedPart_Module_Navigation_Array_C")
	}
	static class ABP_DamagedPart_Module_Navigation_Array_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamagedPart_Module_Navigation_Array_C>();
	}
};
DUMPER7_ASSERTS_ABP_DamagedPart_Module_Navigation_Array_C;

}

