#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrawBridge_NotModule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Voyage_structs.hpp"
#include "DrawBridgeState_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrawBridge_NotModule.BP_DrawBridge_NotModule_C
// 0x00D8 (0x0388 - 0x02B0)
class ABP_DrawBridge_NotModule_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Root;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EDrawBridgeState                              DrawBridgeState;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentSpeed;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExtendRelativeTarget;                              // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DrawBridge_NotModule_C*             SynchronizedBridge;                                // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        InterpSpeed;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStopping;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EModuleResourceType, double>             Consumption;                                       // 0x0318(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasPower;                                          // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageModuleGenericSwitchActor*        Switch;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Module_RoomOutlet_C*                OutletModuleA;                                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Module_RoomOutlet_C*                OutletModuleB;                                     // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void DesiredStateChanged(EVoyageModuleState Value);
	void ExecuteUbergraph_BP_DrawBridge_NotModule(int32 EntryPoint);
	TMap<EModuleResourceType, double> GetConsumptions();
	bool IsConsumptionDynamic();
	void ModuleValueChanged(class AActor* ModuleActor);
	void OnModuleAPowerStateChanged(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void OnModuleAStateChanged(class UVoyageModuleComponent* Module, EVoyageModuleState OldState, EVoyageModuleState NewState);
	void OnModuleBPowerStateChanged(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void OnModuleBStateChanged(class UVoyageModuleComponent* Module, EVoyageModuleState OldState, EVoyageModuleState NewState);
	void OnSwitchToggleState(class AVoyageModuleGenericSwitchActor* SwitchActor, bool bUpperThreshold);
	void PowerStateChanged(bool bValue);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ResourceAvailabilityChanged(bool bValue);
	void SetStopping();
	void SetupSwitchesSync();
	void SocketConnectionChanged(class AActor* ModuleActor);
	void StartMoving();
	void UpdateSwitch();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DrawBridge_NotModule_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DrawBridge_NotModule_C")
	}
	static class ABP_DrawBridge_NotModule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DrawBridge_NotModule_C>();
	}
};
DUMPER7_ASSERTS_ABP_DrawBridge_NotModule_C;

}

