#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dropped_Magazine

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Dropped_Magazine.BP_Dropped_Magazine_C.ExecuteUbergraph_BP_Dropped_Magazine
// 0x0018 (0x0018 - 0x0000)
struct BP_Dropped_Magazine_C_ExecuteUbergraph_BP_Dropped_Magazine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_CustomEvent_InStaticMesh;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Dropped_Magazine_C_ExecuteUbergraph_BP_Dropped_Magazine;

// Function BP_Dropped_Magazine.BP_Dropped_Magazine_C.SetMagazineMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_Dropped_Magazine_C_SetMagazineMesh final
{
public:
	class UStaticMesh*                            InStaticMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Dropped_Magazine_C_SetMagazineMesh;

}

