#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dialog_Select_Save_Slot

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Dialog_Select_Save_Slot.BP_Dialog_Select_Save_Slot_C
// 0x0030 (0x0800 - 0x07D0)
class UBP_Dialog_Select_Save_Slot_C final : public UVoyageSaveDialogWidget
{
public:
	class UBP_VoyageSaveGameSlotsWidget_C*        UnknownSaveGameSlotWidget;                         // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageSaveGameSlotsWidget_C*        SaveGameSlotWidget;                                // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SaveGameDetailsWidget_C*            BP_SaveGameDetailsWidget;                          // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloudSaveGameNotificationWidget_C*  BP_CloudSaveGameNotificationWidget;                // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ButtonInfo_Horizontal_Container_C*  BP_ButtonInfo_Horizontal_Container;                // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x07F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	bool OnHandleNavigationInput(EUINavigationInputType Type);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Dialog_Select_Save_Slot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Dialog_Select_Save_Slot_C")
	}
	static class UBP_Dialog_Select_Save_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Dialog_Select_Save_Slot_C>();
	}
};
DUMPER7_ASSERTS_UBP_Dialog_Select_Save_Slot_C;

}

