#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_IndicatorPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_LightBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door_IndicatorPanel.BP_Door_IndicatorPanel_C
// 0x0118 (0x0528 - 0x0410)
class ABP_Door_IndicatorPanel_C final : public ABP_LightBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Door_IndicatorPanel_C;           // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AVoyageDoorActor*                       DoorOwner;                                         // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 MasterModule;                                      // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasSecurityLevel;                                  // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   PreviousPanel;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UStaticMeshComponent*> CreatedPanelsMap;                               // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Met;                                               // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasReq;                                            // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Return_Value_Target_Object;                        // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class FString>                           StandardRequirements;                              // 0x0498(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AActor*                                 DisplayActor;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorUnlocked;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorRequirementNotMet;                            // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorLocked;                                       // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasScreen;                                         // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UStaticMeshComponent* CreateNewPanel(const class FString& Key);
	void ExecuteUbergraph_BP_Door_IndicatorPanel(int32 EntryPoint);
	void GetRequirementsMet(TArray<class FString>& Reqs, bool* HasReq1, bool* Met1);
	void HasExtraRequirements(bool* NewParam);
	void OnCustomRequirementsChanged_Event(class UVoyageModuleComponent* Module);
	void OnModuleDisableChanged_Event(class UVoyageModuleComponent* SourceModule, bool bDisabled);
	void OnPersistentActorPostLoad(int32 Version);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void UpdatePanels();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Door_IndicatorPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Door_IndicatorPanel_C")
	}
	static class ABP_Door_IndicatorPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_IndicatorPanel_C>();
	}
};
DUMPER7_ASSERTS_ABP_Door_IndicatorPanel_C;

}

