#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorBase

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DoorBase.BP_DoorBase_C
// 0x0098 (0x04D8 - 0x0440)
class ABP_DoorBase_C : public AVoyageDoorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Frame;                                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AVoyageModuleGenericSwitchActor*> ToggleSwitches;                                   // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          EnableHandlesLeft;                                 // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableHandlesRight;                                // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableInteraction;                                 // 0x0462(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoOpenWhenCustomRequirementMet;                  // 0x0463(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocked;                                           // 0x0464(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            DoorBlockingArea;                                  // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UPrimitiveComponent*>            DoorInteractArea;                                  // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   LastAudioTrigger;                                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Grabbing;                                          // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastDoorPosition;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAudio;                                       // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DragSpeed;                                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DragDirection;                                     // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyageCrosshairWidgetData*             Crosshair_Widget;                                  // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          PrintDebug;                                        // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AudioStopEvent();
	void BndEvt__BP_DoorBase_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompPowerStateChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void BP_DoorBase_AutoGenFunc(const struct FVoyageInputActionInstance& InputAction, class FText* Text);
	void CheckAutoOpen();
	void CheckSwitchState();
	void DeactivateAudio();
	void ExecuteUbergraph_BP_DoorBase(int32 EntryPoint);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	void GrabObject(class UPhysicsGrabComponent* GrabComponent);
	void HideComponent(class USceneComponent* Comp, bool bNewVisibility);
	void HideComponentAndChildren(class USceneComponent* Comp, bool bNewVisibility);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	bool IsInteractEnabled();
	void OnComponentBeginOverlap_Event(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnComponentEndOverlap_Event(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnCustomRequirementsChanged_Event(class UVoyageModuleComponent* Module);
	void OnForceApplied_Event(class UVoyageAdjustGrabBoxComponent* GrabBox, const struct FVector& Force);
	void OnModuleDisableChanged_Event(class UVoyageModuleComponent* SourceModule, bool bDisabled);
	void OnModuleRequirementsMetChanged_Event(class UVoyageModuleComponent* Module);
	void PlayAudioTrigger(class FName InName, bool UpdateLastTrigger);
	void ReceiveBeginPlay();
	void ReleaseObject(class UPhysicsGrabComponent* GrabComponent);
	void ResetSwitchesIfStateEquals(EVoyageDoorState State, float Reset_Target);
	void SetDoorPosition(float position, bool Forced);
	void SetDoorState(EVoyageDoorState NewState);
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);
	void ToggleSwitchState_Event(class AVoyageModuleGenericSwitchActor* SwitchActor, bool bUpperThreshold);
	void UpdateAudioState();
	void UpdateBlockedState();
	void UpdateGrabbing(double WantedDoorPosition);
	void UpdateHandles();
	void UpdateInteractAreas();
	void UpdateMaterialsForDoorState(EVoyageDoorState State, const class FString& VariableName);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DoorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DoorBase_C")
	}
	static class ABP_DoorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DoorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_DoorBase_C;

}

