#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_Extension_ObjectDetector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PersistentOverlapTrigger_Actor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door_Extension_ObjectDetector.BP_Door_Extension_ObjectDetector_C
// 0x0040 (0x0378 - 0x0338)
class ABP_Door_Extension_ObjectDetector_C final : public ABP_PersistentOverlapTrigger_Actor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Door_Extension_ObjectDetector_C; // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RequirementMetWhenDetected;                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RequirementText;                                   // 0x0350(0x0010)(Edit, BlueprintVisible)
	class FString                                 RequirementKey;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ShowDebug;                                         // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenDoorOnTriggered;                               // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CloseDoorOnCleared;                                // 0x0372(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Door_Extension_ObjectDetector(int32 EntryPoint);
	void OnPersistentActorPostLoad(int32 Version);
	void OnTriggerActivated_Event(class ABP_PersistentOverlapTrigger_Actor_C* TriggerActor);
	void OnTriggerCleared_Event(class ABP_PersistentOverlapTrigger_Actor_C* TriggerActor);
	void ReceiveBeginPlay();
	void Update_requirement();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Door_Extension_ObjectDetector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Door_Extension_ObjectDetector_C")
	}
	static class ABP_Door_Extension_ObjectDetector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_Extension_ObjectDetector_C>();
	}
};
DUMPER7_ASSERTS_ABP_Door_Extension_ObjectDetector_C;

}

