#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Equipment_ScanTool

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Equipment_BaseTool_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Equipment_ScanTool.BP_Equipment_ScanTool_C
// 0x0100 (0x09C0 - 0x08C0)
class ABP_Equipment_ScanTool_C final : public ABP_Equipment_BaseTool_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Equipment_ScanTool_C;            // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        ScanAudio;                                         // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Scan_Beam;                                      // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Scanner_001_SM_Scanner_Display_01;              // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Scanner_001_SM_Scanner_Button_01;               // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageItem*                            ScanItem;                                          // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 ScanMeshComponents;                                // 0x08F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterial*                              ScanMaterial;                                      // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ScanMode;                                          // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_90C[0x4];                                      // 0x090C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UVoyageItem* Item)> OnScanItemCompleted;                     // 0x0910(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanGainExp;                                       // 0x0920(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageInGameDynamicLayerAlignment     AlignmentAsset;                                    // 0x0928(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UMaterialInstanceDynamic*               ScanMaterialDynamicInstance;                       // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   DynamicLayerName;                                  // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseDynamicLayer;                                  // 0x09B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearScanMeshes();
	void CreateDynamicLayer();
	void CreateScanMeshes(class AActor* Actor);
	void ExecuteUbergraph_BP_Equipment_ScanTool(int32 EntryPoint);
	void OnEquipmentUnequipped_Event(class AController* Controller);
	void OnEquipStateChanged(bool bIsEquipped);
	void OnScanCanceled();
	void OnScanCompleted();
	void OnScanProgressChanged(double Progress);
	void OnScanStarted(class UObject* Object, class UVoyageItem* Item);
	void OnTargetChanged();
	void OnTargetLost();
	void ReceiveBeginPlay();
	void RemoveDynamicLayer();
	void StartScanning(class UObject* Object);
	void StopScanning();
	void UpdateMaterialInstance();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Equipment_ScanTool_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Equipment_ScanTool_C")
	}
	static class ABP_Equipment_ScanTool_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Equipment_ScanTool_C>();
	}
};
DUMPER7_ASSERTS_ABP_Equipment_ScanTool_C;

}

