#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EggSack01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_SackTypes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EggSack01.BP_EggSack01_C
// 0x0160 (0x0B30 - 0x09D0)
class ABP_EggSack01_C final : public AVoyageEggSackActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SackPS;                                            // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SwarmSpawnRoot;                                    // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDestructibleObjectComponent*     VoyageDestructibleObject;                          // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDecalComponent*                  VoyageDecal;                                       // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PlayerDetectionSphere;                             // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BurstMesh;                                         // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageExperienceComponent*             VoyageExperience;                                  // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_E24008774ECAC1C8C7F6759A53528396; // 0x0A20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_E24008774ECAC1C8C7F6759A53528396; // 0x0A24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A25[0x3];                                      // 0x0A25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DisplacementTimeline_Ramp_3AE3F5DA41B17C25C5CE79851EC5B9CB; // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplacementTimeline_DisplacementFactor_3AE3F5DA41B17C25C5CE79851EC5B9CB; // 0x0A34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplacementTimeline_NoiseDisplacement_3AE3F5DA41B17C25C5CE79851EC5B9CB; // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DisplacementTimeline__Direction_3AE3F5DA41B17C25C5CE79851EC5B9CB; // 0x0A3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3D[0x3];                                      // 0x0A3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DisplacementTimeline;                              // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Health;                                            // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayerDetected;                                  // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPlayerTarget;                                   // 0x0A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A52[0x6];                                      // 0x0A52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageCharacter*                       PlayerTarget;                                      // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEggSackDataAsset_C*                    EggSackData;                                       // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomizeSeed;                                     // 0x0A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          TentaclesSegments;                                 // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlaceholderSegment;                                // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SegmentScene;                                      // 0x0A80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SackMI;                                            // 0x0A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SackBaseMI;                                        // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TentacleMI;                                        // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMI;                                           // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomSeed;                                        // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	class UVoyageNPCData*                         NPCData;                                           // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DestroyedTentacleSystem;                           // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ForceStrength;                                     // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC4[0x4];                                      // 0x0AC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            LastDamager;                                       // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoyageItemSpawnSettings               LootSpawnSettings;                                 // 0x0AD0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        DecalDepth;                                        // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindOnHealthChanged(const TDelegate<void(class UObject* Target, float Change)>& Delegate);
	void BndEvt__BP_EggSack01_PlayerDetectionSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_EggSack01_PlayerDetectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Burst();
	void DestroyEgg(bool FullyDestroyed);
	void DisplacementTimeline__FinishedFunc();
	void DisplacementTimeline__UpdateFunc();
	bool DoDestruction(float Damage, float LootMultiplier);
	bool DoDismantle();
	void ExecuteUbergraph_BP_EggSack01(int32 EntryPoint);
	class UVoyagePersistentActorComponent* GetPersistentActorComponent();
	void GetRandomVectorInScaledRadius(struct FVector* OutVector);
	void InitializeNPC(class UVoyageNPCData* NPCData_0);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnDismantle();
	void OnEvent(class UObject* Sender, const class FString& Event, const class FString& Params_0);
	void OnPersistentActorPostLoad(int32 Version);
	void OnSegmentDestroyed(int32 TentacleIndex, int32 SegmentIndex);
	void PlayEggExplosionSound();
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	float ReceiveImpactDamage(class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FCollisionChaosEvent& Hit, const struct FVoyageDestructibleObjectProperties& DestructibleProperties);
	void ReceiveTick(float DeltaSeconds);
	void RegenerateEgg();
	void RepairEntity(class AController* InFixer, float Percentage);
	void SetActorOverlayMaterial(class AActor* Actor, class UMaterialInterface* NewOverlayMaterial);
	void SetupSackMaterials();
	void SpawnChunks();
	void SpawnSwarm();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UpdateEmitter(class UNiagaraComponent* InputPin);
	void UpdateMesh();
	void UpdateMeshState();
	void UserConstructionScript();
	bool UseReceiveImpactDamage();

	bool CanDismantle() const;
	bool CanRecycle() const;
	bool CanRepair() const;
	float GetBaseThreat(EVoyageAggroState AggroState) const;
	float GetDamageLevel() const;
	float GetDismantleDuration() const;
	float GetDismantleElectricityCost() const;
	void GetDismantleItems(TMap<class UVoyageItem*, int32>* OutItems) const;
	int32 GetDismantleLevel() const;
	float GetDismantleMultiplier() const;
	class UVoyageItem* GetDismantleParentItem() const;
	void GetIsDestroyed(bool* bDestroyed) const;
	class FName GetOverrideZoneId() const;
	void GetRepairRequirements(TMap<class UVoyageItem*, int32>* OutItems) const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool IsDamaged() const;
	bool IsDestructible() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EggSack01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EggSack01_C")
	}
	static class ABP_EggSack01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EggSack01_C>();
	}
};
DUMPER7_ASSERTS_ABP_EggSack01_C;

}

