#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Equipment_Back_Electricity_Small_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.ExecuteUbergraph_BP_Equipment_Back_Electricity_Small_Base
// 0x0030 (0x0030 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_ExecuteUbergraph_BP_Equipment_Back_Electricity_Small_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVoyageModuleComponent* Module)> K2Node_CreateDelegate_OutputDelegate;      // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_CustomEvent_Module;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_ExecuteUbergraph_BP_Equipment_Back_Electricity_Small_Base;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.GetPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_GetPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_GetPersistentActorComponent;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_OnCustomDataSave;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.OnModuleValueChanged_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_OnModuleValueChanged_Event final
{
public:
	class UVoyageModuleComponent*                 Module;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_OnModuleValueChanged_Event;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.GetStateValue
// 0x0018 (0x0018 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_GetStateValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPrimaryResourcePercentage_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_GetStateValue;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_HasAnyChanges;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_HasCustomData;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.HasStateValue
// 0x0002 (0x0002 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_HasStateValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_HasStateValue;

// Function BP_Equipment_Back_Electricity_Small_Base.BP_Equipment_Back_Electricity_Small_Base_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Equipment_Back_Electricity_Small_Base_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Equipment_Back_Electricity_Small_Base_C_PersistTranform;

}

