#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Early_Access_Dialog_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_Early_Access_Dialog_Widget.BP_Early_Access_Dialog_Widget_C.ExecuteUbergraph_BP_Early_Access_Dialog_Widget
// 0x0098 (0x0098 - 0x0000)
struct BP_Early_Access_Dialog_Widget_C_ExecuteUbergraph_BP_Early_Access_Dialog_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess_1;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InError_1;                            // 0x0020(0x0010)(ConstParm)
	bool                                          K2Node_Event_bSuccess;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InError;                              // 0x0038(0x0010)(ConstParm)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0048(0x0010)()
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0010)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0014)(NoDestructor)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0084(0x0014)(NoDestructor)
};
DUMPER7_ASSERTS_BP_Early_Access_Dialog_Widget_C_ExecuteUbergraph_BP_Early_Access_Dialog_Widget;

// Function BP_Early_Access_Dialog_Widget.BP_Early_Access_Dialog_Widget_C.OnBoatRelocate
// 0x0018 (0x0018 - 0x0000)
struct BP_Early_Access_Dialog_Widget_C_OnBoatRelocate final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InError;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_Early_Access_Dialog_Widget_C_OnBoatRelocate;

// Function BP_Early_Access_Dialog_Widget.BP_Early_Access_Dialog_Widget_C.OnPawnRelocate
// 0x0018 (0x0018 - 0x0000)
struct BP_Early_Access_Dialog_Widget_C_OnPawnRelocate final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InError;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_Early_Access_Dialog_Widget_C_OnPawnRelocate;

// Function BP_Early_Access_Dialog_Widget.BP_Early_Access_Dialog_Widget_C.SetMessageText
// 0x0018 (0x0018 - 0x0000)
struct BP_Early_Access_Dialog_Widget_C_SetMessageText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Early_Access_Dialog_Widget_C_SetMessageText;

}

