#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EngineModuleManagementWidget

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_EngineModuleManagementWidget.BP_EngineModuleManagementWidget_C
// 0x0028 (0x0380 - 0x0358)
class UBP_EngineModuleManagementWidget_C final : public UVoyageBaseModuleManagementWidget
{
public:
	class UVerticalBox*                           OnlineBox;                                         // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OfflineBox;                                        // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModuleNameTB_1;                                    // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModuleNameTB;                                      // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Consumption;                                       // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FText Get_Consumption_Text_0();
	class FText Get_ModuleNameTB_Text();
	ESlateVisibility Get_OfflineBox_Visibility();
	ESlateVisibility Get_OnlineBox_Visibility();
	double GetSpeedInKMH(class UObject* Object);
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EngineModuleManagementWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EngineModuleManagementWidget_C")
	}
	static class UBP_EngineModuleManagementWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EngineModuleManagementWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_EngineModuleManagementWidget_C;

}

