#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FabricatorWorldWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_FabricatorWorldWidget.BP_FabricatorWorldWidget_C.ExecuteUbergraph_BP_FabricatorWorldWidget
// 0x0018 (0x0018 - 0x0000)
struct BP_FabricatorWorldWidget_C_ExecuteUbergraph_BP_FabricatorWorldWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_Event_InModuleComponent;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasPower;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FabricatorWorldWidget_C_ExecuteUbergraph_BP_FabricatorWorldWidget;

// Function BP_FabricatorWorldWidget.BP_FabricatorWorldWidget_C.PowerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_FabricatorWorldWidget_C_PowerStateChanged final
{
public:
	class UVoyageModuleComponent*                 InModuleComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPower;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FabricatorWorldWidget_C_PowerStateChanged;

// Function BP_FabricatorWorldWidget.BP_FabricatorWorldWidget_C.AllowPointerKey
// 0x0020 (0x0020 - 0x0000)
struct BP_FabricatorWorldWidget_C_AllowPointerKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FabricatorWorldWidget_C_AllowPointerKey;

}

