#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FishingModuleWidget

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FishingModuleWidget.BP_FishingModuleWidget_C
// 0x0068 (0x0678 - 0x0610)
class UBP_FishingModuleWidget_C final : public UVoyageModuleWidget
{
public:
	class UTextBlock*                             SpeedTb_2;                                         // 0x0610(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpeedTb;                                           // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ResourceLastFrame;                                 // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ResourceAdded;                                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ResourcePerSecond;                                 // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FirstUpdate;                                       // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                ResourceHistory;                                   // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                ResourceHistoryLength;                             // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        HistoryLength;                                     // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RPS;                                               // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxResourceHistory;                                // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Get_Image_NET_bIsEnabled();
	ESlateVisibility Get_Image_NET_Visibility();
	class FText GetStateText();
	class FText GetWeightText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FishingModuleWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FishingModuleWidget_C")
	}
	static class UBP_FishingModuleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FishingModuleWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_FishingModuleWidget_C;

}

