#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FabricationPlacementComponent

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FabricationPlacementComponent.BP_FabricationPlacementComponent_C
// 0x02D0 (0x0540 - 0x0270)
class UBP_FabricationPlacementComponent_C final : public UVoyageLocationFabricatorPlacementComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class USceneComponent*>                Comps;                                             // 0x0278(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        Heading;                                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Material;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPlace;                                          // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlacementLocation;                                 // 0x02A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerInputInterfaceAction>    Actions;                                           // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UPrimitiveComponent*                    AttachToComponent;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Corners;                                           // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        LocalMinimumZ;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LocalMaximumZ;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UVoyageFabricatorFactory>   Fabricator_Factory;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<int32, struct FVector>                   BottomVertices;                                    // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                        Audio;                                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MinimumZAllowed;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CheckOffset;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DynamicMeshActorClass;                             // 0x0368(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	double                                        AngularGranularity;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LinearGranularity;                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingForConfirmation;                            // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Out_Hit;                                           // 0x03A8(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        RotateAmount;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotating;                                        // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasRotating;                                       // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotationAmount;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngularGranularity_Last;                           // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LinearGranularity_Last;                            // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoyageScanText                        ScanText;                                          // 0x04D0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUserWidget*                            DynamicLayerWidget;                                // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageInGameDynamicLayerAlignmentAsset* DynamicLayerAsset;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   FailureReason;                                     // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVoyageInGameDynamicLayerAlignmentAsset* DynamicLayerAlignmentAsset;                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateLocalMinimumZ();
	struct FVector CalculateOffset(const struct FVector& Point, const struct FVector& Normal, double Offset);
	void CancelFabrication(const struct FVoyageInputActionInstance& InputAction, class FText* NewParam);
	void DestroyComps();
	void ExecuteUbergraph_BP_FabricationPlacementComponent(int32 EntryPoint);
	void Fabricate(const struct FVoyageInputActionInstance& InputAction, class FText* NewParam);
	void GenerateAndSetLocation(class UVoyageCraftingLocationGenerator* Generator);
	bool GetDynamicLayer(struct FVoyageInGameDynamicLayerArgs* Args, struct FVoyageInGameDynamicLayerAlignment* Alignment);
	TArray<struct FPlayerInputInterfaceAction> GetProvidedActionsBP();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Rotate(double Amount);
	void RotateLeft(const struct FVoyageInputActionInstance& InputAction, class FText* NewParam);
	void RotateRight(const struct FVoyageInputActionInstance& InputAction, class FText* NewParam);
	void SetCurrentItem(class UVoyageItem* Item);
	void SetDynamicLayerWidget(class UWidget* Widget);
	void ToggleSnapping(const struct FVoyageInputActionInstance& InputAction, class FText* Text);
	void UpdateBottomVertex(class UPrimitiveComponent* Primitive, const struct FVector& Location, const int32 Key);
	void UpdateMaterial();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FabricationPlacementComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FabricationPlacementComponent_C")
	}
	static class UBP_FabricationPlacementComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FabricationPlacementComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_FabricationPlacementComponent_C;

}

