#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FootStep_Componet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "E_FootStepState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FootStep_Componet.BP_FootStep_Componet_C
// 0x00D8 (0x0198 - 0x00C0)
class UBP_FootStep_Componet_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACharacter*                             OwningActor;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            CharacterMovement;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDelay;                                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDelay;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SoundOffsetFromWaist;                              // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunDelay;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WalkDelay;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrintDebugInfo;                                    // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxVelocity;                                       // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterSplashLimiter;                                // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyagePhysicalMaterial*                DefaultFootstepMaterial;                           // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WooshVelocityThreshold;                            // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        WooshAudioComponent;                               // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             WooshSound;                                        // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCheckingVelocity;                                 // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WooshPropertyName;                                 // 0x014C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlayerVelocityName;                                // 0x0154(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             FootStepBaseSound;                                 // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundArrayName;                                    // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunAudioVelocityThreshold;                         // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FallDamageSound;                                   // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WooshAirTime;                                      // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WooshMinAirTime;                                   // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayingWoosh;                                   // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FootStep_Componet(int32 EntryPoint);
	void Get_Physics_Material_at_Location(const struct FVector& Location, class UVoyagePhysicalMaterial** Material, class FName* PhysicalName);
	void GetMovementState(double Velocity, E_FootStepState* State);
	void GetOwnerLocation(const struct FVector& Offset, struct FVector* Location);
	void GetSurfaceSounds(E_FootStepState State, class UVoyagePhysicalMaterial* Material, double Velocity, TArray<class USoundBase*>* Sounds);
	void IsOnWaterSurface(bool* Return);
	void IsUsingLadder(bool* Return);
	void OnEnterWater(double Velocity);
	void OnExitWater(double Velocity);
	void OnJump();
	void OnLanded(double Velocity);
	void OnPlayMovementSound(const TArray<class USoundBase*>& Sound, double Velocity, bool Feet);
	void PlayfallbackSound(E_FootStepState State, double Velocity, class FName Key);
	void PlayJumpSound(const TArray<class USoundBase*>& Sound, double Velocity, E_FootStepState State);
	void PlaySoundAttachedWithOffset(const TArray<class USoundBase*>& Sound, const struct FVector& Offset, double Velocity, E_FootStepState State);
	void PlayWaterSplashSound(const TArray<class USoundBase*>& Sound, double Velocity);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ResetJumpSoundTimer();
	void ResetWaterSoundTimer();
	void TriggerFootStepLeft();
	void TriggerFootStepRight();
	void UpdateAirTime(double DeltaSeconds);
	void ValidFootStepOwner(bool* Is_valid);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FootStep_Componet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FootStep_Componet_C")
	}
	static class UBP_FootStep_Componet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FootStep_Componet_C>();
	}
};
DUMPER7_ASSERTS_UBP_FootStep_Componet_C;

}

