#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FocusableListBox

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FocusableListBox.BP_FocusableListBox_C
// 0x0038 (0x08F8 - 0x08C0)
class UBP_FocusableListBox_C final : public UVoyageFocusableListBoxWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             PrevTB;                                            // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OptionHighlight;                                   // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NextTB;                                            // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       InactiveAnim;                                      // 0x08E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowHeader;                                       // 0x08E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               OptionsMaterial;                                   // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_FocusableListBox(int32 EntryPoint);
	void OnSelectedIndexChanged_Event(class UVoyageFocusableWidget* Widget, int32 Index_0);
	void PostOptionsChanged();
	void PostSelectedIndexChanged();
	void PreConstruct(bool IsDesignTime);
	void UpdateArrows();
	void UpdateHighlightSelection();
	void UpdateOptions();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FocusableListBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FocusableListBox_C")
	}
	static class UBP_FocusableListBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FocusableListBox_C>();
	}
};
DUMPER7_ASSERTS_UBP_FocusableListBox_C;

}

