#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GlobalActor_PecoLockStates

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GlobalActor_PecoLockStates.BP_GlobalActor_PecoLockStates_C
// 0x0078 (0x0328 - 0x02B0)
class ABP_GlobalActor_PecoLockStates_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName Key)> OnLockStateChanged;                              // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, bool>                       LockStates;                                        // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)

public:
	void ExecuteUbergraph_BP_GlobalActor_PecoLockStates(int32 EntryPoint);
	void GetLockState(class FName Key, bool* Unlocked);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void SetLockState(class FName Key, bool State);

	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GlobalActor_PecoLockStates_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GlobalActor_PecoLockStates_C")
	}
	static class ABP_GlobalActor_PecoLockStates_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GlobalActor_PecoLockStates_C>();
	}
};
DUMPER7_ASSERTS_ABP_GlobalActor_PecoLockStates_C;

}

