#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Grenade_Projectile_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Voyage_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Grenade_Projectile_Base.BP_Grenade_Projectile_Base_C
// 0x0290 (0x0540 - 0x02B0)
class ABP_Grenade_Projectile_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_DynamicWavesComponent_C*            BP_DynamicWavesComponent;                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Grenade;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDynamicCollisionComponent*       VoyageDynamicCollision;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BuoyancyComponent_C*                BP_BuoyancyComponent;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Volume_Multiplier;                                 // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DamageThreshold;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExploded;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageAttack                          Attack;                                            // 0x0300(0x01C0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UVoyageWeaponData*                      DetonationAbility;                                 // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            Instigator_Controller;                             // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ActivationParticleSystem;                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Age;                                               // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SwarmHandler_C*                     SwarmsHandler;                                     // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ArcsPositionsArray;                                // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ArcPositionsArrayAll;                              // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxAttacks;                                        // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        NiagaraArchesPositionsArray;                       // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Timer;                                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ClickSound;                                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        TimerAudioComponent;                               // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Grenade_Projectile_Base(int32 EntryPoint);
	void Explode();
	void GetDurationAttack(const struct FVoyageAttack& Attack_0, double* duration);
	void HasDurationAttack(const struct FVoyageAttack& Attack_0, bool* HasDuration);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void OnPlayEffectSystem(const struct FVoyageWeaponDataStruct& WeaponData);
	void OnPlaySFX(const struct FVoyageWeaponDataStruct& WeaponDataStruct);
	void OnPlayTimerSFX(const struct FVoyageAbilitySfxData& WeaponSfxData);
	void OnRegisterAttack(const struct FVoyageWeaponDataStruct& Weapon_Data);
	void OnSpawn(class UProjectileAbilityComponent* ProjectileAbility, const struct FVoyageWeaponDataStruct& WeaponData, const struct FVoyageEquipmentAbilityActivationArgs& InArgs);
	void OnSpawnTimerSFX(const struct FVoyageAbilitySfxData& WeaponSfxData);
	void OnTakeAnyDamage_Event(class AActor* DamagedActor, float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void SetupAttackProperties(class UVoyageWeaponData* WeaponData);
	void SetupIfDurationAttack();
	void SetWeaponData(class UVoyageWeaponData* WeaponData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Grenade_Projectile_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Grenade_Projectile_Base_C")
	}
	static class ABP_Grenade_Projectile_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Grenade_Projectile_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Grenade_Projectile_Base_C;

}

