#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HolsterSlot

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_HolsterSlot.BP_HolsterSlot_C
// 0x0030 (0x0A78 - 0x0A48)
class UBP_HolsterSlot_C final : public UVoyageHolsterItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ValueTB;                                           // 0x0A50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ValueProgressBar;                                  // 0x0A58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemBackgroundImage;                               // 0x0A60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquipmentOverlay;                                  // 0x0A68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       InactiveAnim;                                      // 0x0A70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HolsterSlot(int32 EntryPoint);
	void GetHolsterActor(class AVoyageEquipmentActor** EquipmentActor);
	void GetSlotModuleValue(class AVoyageEquipmentActor* InActor, double* Value);
	bool HandleDrop(class UVoyageInventoryItem* Other);
	void OnHolsterEquipmentStateValueChanged(int32 SlotIndex, class AVoyageEquipmentActor* InActor);
	void SetEquipmentOverlayVisibility(ESlateVisibility Visibility_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HolsterSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HolsterSlot_C")
	}
	static class UBP_HolsterSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HolsterSlot_C>();
	}
};
DUMPER7_ASSERTS_UBP_HolsterSlot_C;

}

