#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inventory_Container_Base_WeightLimited

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.ExecuteUbergraph_BP_Inventory_Container_Base_WeightLimited
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_ExecuteUbergraph_BP_Inventory_Container_Base_WeightLimited final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_MyCharacter_1;                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            K2Node_Event_InteractiveObjectComponent_1;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_MyCharacter;                          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            K2Node_Event_InteractiveObjectComponent;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              K2Node_CustomEvent_Sound;                          // 0x0078(0x0028)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_ExecuteUbergraph_BP_Inventory_Container_Base_WeightLimited;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.GetPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_GetPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_GetPersistentActorComponent;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_OnCustomDataSave;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.OnLoaded_A6A34CAF4CB46BDD2F96C8B2EA5FC596
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_OnLoaded_A6A34CAF4CB46BDD2F96C8B2EA5FC596 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_OnLoaded_A6A34CAF4CB46BDD2F96C8B2EA5FC596;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.PlayerInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_PlayerInteraction final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveObjectComponent;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_PlayerInteraction;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.PlayerInteractionRelease
// 0x0010 (0x0010 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_PlayerInteractionRelease final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveObjectComponent;                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_PlayerInteractionRelease;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.PlaySound
// 0x0028 (0x0028 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_PlaySound final
{
public:
	TSoftObjectPtr<class USoundBase>              Sound;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_PlaySound;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.SpawnInitialLoot
// 0x0018 (0x0018 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_SpawnInitialLoot final
{
public:
	int32                                         CallFunc_AddItems_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageLootSubsystem*                   CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLootItemTablesToInventory_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_SpawnInitialLoot;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.UpdateWeight
// 0x0058 (0x0058 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_UpdateWeight final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsPrimitiveWelded_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateInventoryTotalWeight_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMassOverrideInKg_MassInKg_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_UpdateWeight;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.GetDismantleMultiplier
// 0x0004 (0x0004 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_GetDismantleMultiplier final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_GetDismantleMultiplier;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.GetOverrideZoneId
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_GetOverrideZoneId final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_GetOverrideZoneId;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_HasAnyChanges;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_HasCustomData;

// Function BP_Inventory_Container_Base_WeightLimited.BP_Inventory_Container_Base_WeightLimited_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Base_WeightLimited_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Base_WeightLimited_C_PersistTranform;

}

