#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inventory_PlayerBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Inventory_Container_Base_WeightLimited_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Inventory_PlayerBox.BP_Inventory_PlayerBox_C
// 0x00C8 (0x04F8 - 0x0430)
class ABP_Inventory_PlayerBox_C : public ABP_Inventory_Container_Base_WeightLimited_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Inventory_PlayerBox_C;           // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   NameTextRender1;                                   // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ResourceMeter;                                     // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RightIconPlane;                                    // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LeftIconPlane;                                     // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 VoyageModule;                                      // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlayerBox_Lid;                                     // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LidOpen_Lid_XRot_CE533FFA4CC8A4680767FD828E584436; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LidOpen__Direction_CE533FFA4CC8A4680767FD828E584436; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LidOpen;                                           // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       DynamicMaterials;                                  // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                     IconImages;                                        // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               LeftIconDynamicMaterial;                           // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RightIconDynamicMaterial;                          // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftIconRelativeLocation;                          // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightIconRelativeLocation;                         // 0x04C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNameLength;                                     // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxNameTextSize;                                   // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinNameTextSize;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Inventory_PlayerBox_VoyageInventoryWeightLimited_K2Node_ComponentBoundEvent_0_InventoryWeightDelegate__DelegateSignature();
	void BndEvt__BP_Inventory_PlayerBox_VoyageInventoryWeightLimited_K2Node_ComponentBoundEvent_1_InventoryDelegate__DelegateSignature();
	void Close();
	void ExecuteUbergraph_BP_Inventory_PlayerBox(int32 EntryPoint);
	void LidOpen__FinishedFunc();
	void LidOpen__UpdateFunc();
	void OnInventoryIconChanged_Event();
	void OnInventoryNameUpdated_Event_0();
	void OnLoaded_5E998ADC42BCD31F6A0815A54CD26DA0(class UObject* Loaded);
	void OnLoaded_EFB79EC3412EF2776CFAF59FDA446AD2(class UObject* Loaded);
	void OnPersistentActorPostLoad(int32 Version);
	void Open();
	void PlayCloseAnim();
	void PlayOpenAnim();
	void PostLoadUpdateName();
	void ReceiveBeginPlay();
	void UpdateColor();
	void UpdateIconMaterial();
	void UpdatNameText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Inventory_PlayerBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Inventory_PlayerBox_C")
	}
	static class ABP_Inventory_PlayerBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Inventory_PlayerBox_C>();
	}
};
DUMPER7_ASSERTS_ABP_Inventory_PlayerBox_C;

}

