#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inventory_Container_Large

#include "Basic.hpp"

#include "ContainerColorStruct_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.ExecuteUbergraph_BP_Inventory_Container_Large
// 0x0060 (0x0060 - 0x0000)
struct BP_Inventory_Container_Large_C_ExecuteUbergraph_BP_Inventory_Container_Large final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_Event_InData;                               // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_Version_2;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Version_1;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NewLocation;                          // 0x0020(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_NewRotation;                          // 0x0038(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_Version;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyagePersistentSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_ExecuteUbergraph_BP_Inventory_Container_Large;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.GetOwnedPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Large_C_GetOwnedPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_GetOwnedPersistentActorComponent;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.OnCustomDataLoad
// 0x0018 (0x0018 - 0x0000)
struct BP_Inventory_Container_Large_C_OnCustomDataLoad final
{
public:
	TArray<uint8>                                 InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Version;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_OnCustomDataLoad;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct BP_Inventory_Container_Large_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_OnCustomDataSave;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.OnPersistentActorPostLoad
// 0x0004 (0x0004 - 0x0000)
struct BP_Inventory_Container_Large_C_OnPersistentActorPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_OnPersistentActorPostLoad;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.OnPersistentSubsystemPostLoad
// 0x0004 (0x0004 - 0x0000)
struct BP_Inventory_Container_Large_C_OnPersistentSubsystemPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_OnPersistentSubsystemPostLoad;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.OnPersistentTranformReset
// 0x0030 (0x0030 - 0x0000)
struct BP_Inventory_Container_Large_C_OnPersistentTranformReset final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_OnPersistentTranformReset;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct BP_Inventory_Container_Large_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FContainerColorStruct                  CallFunc_Array_Get_Item;                           // 0x0008(0x0024)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue_1;   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_UserConstructionScript;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.GetOverrideZoneId
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Large_C_GetOverrideZoneId final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_GetOverrideZoneId;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Large_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_HasAnyChanges;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Large_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_HasCustomData;

// Function BP_Inventory_Container_Large.BP_Inventory_Container_Large_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Inventory_Container_Large_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Large_C_PersistTranform;

}

