#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Item_HumanSeed

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Item_HumanSeed.BP_Item_HumanSeed_C
// 0x0098 (0x03D0 - 0x0338)
class ABP_Item_HumanSeed_C final : public AVoyageLazarusSeed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_CGR_Glass;                                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CGR_SM_CGR_Metal;                               // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDynamicCollisionComponent*       VoyageDynamicCollision;                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBuoyancyComponent*                     Buoyancy;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DynamicWavesComponent_C*            BP_DynamicWavesComponent;                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleWidgetComponent*           TimerWidget;                                       // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BeaconFX;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Interior;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Glass_Opacity_NewTrack_0_8E2F495E476D0EF8CA75E896DD40A0BF; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Glass_Opacity__Direction_8E2F495E476D0EF8CA75E896DD40A0BF; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Glass_Opacity;                                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlassDynamicMaterial;                              // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BaseSpeed;                                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Grabbed;                                           // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              SeedGrabReleased;                                  // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PODOwned;                                          // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AvailableForPOD;                                   // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageItem*                            SeedItem;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisableCollisions();
	void ExecuteUbergraph_BP_Item_HumanSeed(int32 EntryPoint);
	bool GetGrabText(class AActor* InInteractor, const class FText& InText, class FText* OutText);
	class UVoyageCrosshairWidgetData* GetInteractCrosshair(class AActor* InInteractor, int32 PartId);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	bool GetScanText(struct FVoyageScanText* OutText, class APlayerController* InInstigator);
	void Glass_Opacity__FinishedFunc();
	void Glass_Opacity__UpdateFunc();
	void GrabObject(class UPhysicsGrabComponent* GrabComponent);
	void InsertionCompleted();
	void IsBeingGrabbed(bool* IsGrabbed);
	void IsPodOwned(bool* Owned);
	void Pod_Insertion_Cancelled();
	void ReadyForPOD();
	void ReceiveBeginPlay();
	void ReleaseObject(class UPhysicsGrabComponent* GrabComponent);
	void SeedDeath();
	void Seeding();
	void UpdateRemainingTime(float RemainingTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Item_HumanSeed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Item_HumanSeed_C")
	}
	static class ABP_Item_HumanSeed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Item_HumanSeed_C>();
	}
};
DUMPER7_ASSERTS_ABP_Item_HumanSeed_C;

}

