#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractHintWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Voyage_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.ExecuteUbergraph_BP_InteractHintWidget
// 0x0070 (0x0070 - 0x0000)
struct BP_InteractHintWidget_C_ExecuteUbergraph_BP_InteractHintWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_Event_InModuleComponent_1;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasPower;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_Event_InModuleComponent;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVoyageModuleWidgetConfig              K2Node_Event_InData;                               // 0x0020(0x0028)(ConstParm, NoDestructor)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0010)(HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0010)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_ExecuteUbergraph_BP_InteractHintWidget;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.PowerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractHintWidget_C_PowerStateChanged final
{
public:
	class UVoyageModuleComponent*                 InModuleComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPower;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_PowerStateChanged;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.SetModuleSource
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractHintWidget_C_SetModuleSource final
{
public:
	class UVoyageModuleComponent*                 InModuleComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_SetModuleSource;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.SetModuleWidgetConfig
// 0x0028 (0x0028 - 0x0000)
struct BP_InteractHintWidget_C_SetModuleWidgetConfig final
{
public:
	struct FVoyageModuleWidgetConfig              InData;                                            // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_SetModuleWidgetConfig;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractHintWidget_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_SetText;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.SetWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractHintWidget_C_SetWidgetVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_SetWidgetVisibility;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.AllowInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractHintWidget_C_AllowInteract final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_AllowInteract;

// Function BP_InteractHintWidget.BP_InteractHintWidget_C.AllowPointerKey
// 0x0020 (0x0020 - 0x0000)
struct BP_InteractHintWidget_C_AllowPointerKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractHintWidget_C_AllowPointerKey;

}

