#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inventory_Container_Buoy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Inventory_Container_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Inventory_Container_Buoy.BP_Inventory_Container_Buoy_C
// 0x0048 (0x0480 - 0x0438)
class ABP_Inventory_Container_Buoy_C : public ABP_Inventory_Container_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Inventory_Container_Buoy_C;      // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        AudioAbove;                                        // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DarknessPlane;                                     // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Buoy_Lid;                                          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CloseAnimTimeline_Lid01_XRot_902798D84180094D8E4AD39270859016; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CloseAnimTimeline__Direction_902798D84180094D8E4AD39270859016; // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CloseAnimTimeline;                                 // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         OpenAnimTimeline_Lid01_XRot_61BF0A1A40C7B0892AD798B86BCB817A; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenAnimTimeline__Direction_61BF0A1A40C7B0892AD798B86BCB817A; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenAnimTimeline;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void CloseAnimTimeline__FinishedFunc();
	void CloseAnimTimeline__UpdateFunc();
	void ExecuteUbergraph_BP_Inventory_Container_Buoy(int32 EntryPoint);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	void Open();
	void OpenAnimTimeline__FinishedFunc();
	void OpenAnimTimeline__UpdateFunc();
	void PlayCloseAnim();
	void PlayOpenAnim();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Inventory_Container_Buoy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Inventory_Container_Buoy_C")
	}
	static class ABP_Inventory_Container_Buoy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Inventory_Container_Buoy_C>();
	}
};
DUMPER7_ASSERTS_ABP_Inventory_Container_Buoy_C;

}

