#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Inventory_Container_Buoy_Small

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.BndEvt__BP_Inventory_Container_Buoy_Small_VoyageBaseInventory_K2Node_ComponentBoundEvent_1_InventorySlotDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_BndEvt__BP_Inventory_Container_Buoy_Small_VoyageBaseInventory_K2Node_ComponentBoundEvent_1_InventorySlotDelegate__DelegateSignature final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_BndEvt__BP_Inventory_Container_Buoy_Small_VoyageBaseInventory_K2Node_ComponentBoundEvent_1_InventorySlotDelegate__DelegateSignature;

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.CheckAndSinkIfEmpty
// 0x0008 (0x0008 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_CheckAndSinkIfEmpty final
{
public:
	int32                                         CallFunc_GetTotalNumItems_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_CheckAndSinkIfEmpty;

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.ExecuteUbergraph_BP_Inventory_Container_Buoy_Small
// 0x0278 (0x0278 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_ExecuteUbergraph_BP_Inventory_Container_Buoy_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVoyagePersistentSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0140(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Version;                              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SlotIndex;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_ExecuteUbergraph_BP_Inventory_Container_Buoy_Small;

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.GetInteractText
// 0x0028 (0x0028 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_GetInteractText final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutText;                                           // 0x0010(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_GetInteractText;

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.OnPersistentActorPostLoad
// 0x0004 (0x0004 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_OnPersistentActorPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_OnPersistentActorPostLoad;

// Function BP_Inventory_Container_Buoy_Small.BP_Inventory_Container_Buoy_Small_C.UpdateLightState
// 0x0018 (0x0018 - 0x0000)
struct BP_Inventory_Container_Buoy_Small_C_UpdateLightState final
{
public:
	int32                                         CallFunc_GetTotalNumItems_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Inventory_Container_Buoy_Small_C_UpdateLightState;

}

