#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Location_Fabricator

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Location_Fabricator.BP_Location_Fabricator_C
// 0x0130 (0x0440 - 0x0310)
class ABP_Location_Fabricator_C final : public AVoyageFabricator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageBaseInventoryComponent*          VoyageBaseInventory;                               // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageFabricatorComponent*             VoyageFabricator;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_1DDF64EC42EC1F0E9C73849EE6A79C89; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1DDF64EC42EC1F0E9C73849EE6A79C89; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  OwnerActor;                                        // 0x0350(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	class UVoyageItem*                            FabricationItemOrPattern;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                Comps;                                             // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          CanCancel;                                         // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterialInstOverlay;                        // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TotalProcessTime;                                  // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ProcessedTime;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultColor;                                      // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PausedColor;                                       // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVoyageScanTextField>           ScanTextFields;                                    // 0x03D0(0x0010)(Edit, BlueprintVisible)
	bool                                          IsBlocked;                                         // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckOffset;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoyageItemSpawnSettings               SpawnSettings;                                     // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ActorHasAutoweld(class AActor* Actor, bool* Weld);
	void AddScanTextField(EVoyageScanTextType Type, const class FText& Text);
	void AddTask(int32 Count, class UVoyageItem* NewParam);
	void AttachSpawnedActor(class AActor* Child, class USceneComponent* AttachParent);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_0_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_1_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_2_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_3_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_4_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_5_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_6_VoyageFabricatorComponentUpdateFabricationDelegate__DelegateSignature(const struct FVoyageFabricatorQueueItem& QueueItem, float Progress, float Time);
	void BndEvt__BP_Location_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_7_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	bool CanAreaCollect(class APawn* Character);
	bool CanCollect(class APawn* Character);
	bool Collect(class APawn* Character);
	void DestroyComponents(TArray<class USceneComponent*>& Array);
	void EndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_Location_Fabricator(int32 EntryPoint);
	void Fabricate(class UVoyageItem* ItemOrPattern);
	bool GetGrabText(class AActor* InInteractor, const class FText& InText, class FText* OutText);
	class UVoyageCrosshairWidgetData* GetInteractCrosshair(class AActor* InInteractor, int32 PartId);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractiveProvidedGrabActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	bool GetScanText(struct FVoyageScanText* OutText, class APlayerController* InInstigator);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	void OnCancel(const struct FVoyageInputActionInstance& InputAction, class FText* Text);
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnItemQueued(const struct FVoyageFabricatorQueueItem& VoyageFabricatorQueueItem);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void OnSpawn(class UVoyageItem* Item, const struct FVoyageItemData& InData, const struct FVoyageItemSpawnSettings& Settings);
	void PlayerInteraction(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void PlayerInteractionRelease(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);
	void StartOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UpdateActorTags(class UVoyageItem* Item);
	void UpdateColor(const struct FLinearColor& Value);
	void UpdateFade(float Value);
	void UpdatePause();
	void UpdateScanText(struct FVoyageScanText* VoyageScanText);
	void UpdateVisualizationItem(class UVoyageItem* Target);
	void UpdateVisualizationProgress(double CurrentItemProgress);

	class UVoyageItem* GetItem() const;
	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Location_Fabricator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Location_Fabricator_C")
	}
	static class ABP_Location_Fabricator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Location_Fabricator_C>();
	}
};
DUMPER7_ASSERTS_ABP_Location_Fabricator_C;

}

