#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_OpenDoorConsole

#include "Basic.hpp"

#include "DoorState_structs.hpp"
#include "Voyage_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.BindDoorState
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_OpenDoorConsole_C_BindDoorState final
{
public:
	class ABP_SKDoor_Master_C*                    DoorOwner_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_BindDoorState;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.BndEvt__BP_Module_OpenDoorConsole_InteractiveObject_K2Node_ComponentBoundEvent_0_InteractDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_OpenDoorConsole_C_BndEvt__BP_Module_OpenDoorConsole_InteractiveObject_K2Node_ComponentBoundEvent_0_InteractDelegate__DelegateSignature final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_BndEvt__BP_Module_OpenDoorConsole_InteractiveObject_K2Node_ComponentBoundEvent_0_InteractDelegate__DelegateSignature;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.ExecuteUbergraph_BP_Module_OpenDoorConsole
// 0x00B8 (0x00B8 - 0x0000)
struct BP_Module_OpenDoorConsole_C_ExecuteUbergraph_BP_Module_OpenDoorConsole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVoyageModuleComponent* SourceModule, bool bHasPower)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDoorState State)>             K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_OpenDoorButton_C*                   K2Node_DynamicCast_AsBP_Open_Door_Button;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 CallFunc_GetModuleFromActor_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_SKDoor_Master_C*                    K2Node_CustomEvent_DoorOwner;                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDoorState                                    K2Node_CustomEvent_State;                          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_CustomEvent_SourceModule;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHasPower;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue_2;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ComponentBoundEvent_MyCharacter;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_PartId;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 CallFunc_GetModuleFromActor_ReturnValue_1;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_ExecuteUbergraph_BP_Module_OpenDoorConsole;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetInteractCrosshair
// 0x0018 (0x0018 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetInteractCrosshair final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageCrosshairWidgetData*             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetInteractCrosshair;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetInteractText
// 0x0038 (0x0038 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetInteractText final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutText;                                           // 0x0010(0x0010)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNewInteractText_OutText;               // 0x0028(0x0010)()
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetInteractText;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetNewInteractText
// 0x0050 (0x0050 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetNewInteractText final
{
public:
	bool                                          HasPower;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutText;                                           // 0x0008(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDoorState                                    Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0020(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0030(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0040(0x0010)()
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetNewInteractText;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetPersistentActorComponent;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetScanText
// 0x0058 (0x0058 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetScanText final
{
public:
	struct FVoyageScanText                        OutText;                                           // 0x0000(0x0048)(Parm, OutParm)
	class APlayerController*                      InInstigator;                                      // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetScanText;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_OpenDoorConsole_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_OnCustomDataSave;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.OnDoorPowerStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_OpenDoorConsole_C_OnDoorPowerStateChanged final
{
public:
	class UVoyageModuleComponent*                 SourceModule;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPower;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_OnDoorPowerStateChanged;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.OnDoorStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_OpenDoorConsole_C_OnDoorStateChanged final
{
public:
	EDoorState                                    State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_OnDoorStateChanged;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.UpdateConsoleText
// 0x0018 (0x0018 - 0x0000)
struct BP_Module_OpenDoorConsole_C_UpdateConsoleText final
{
public:
	bool                                          HasPower;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNewInteractText_OutText;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_UpdateConsoleText;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.UpdateModuleStateAndWidget
// 0x0028 (0x0028 - 0x0000)
struct BP_Module_OpenDoorConsole_C_UpdateModuleStateAndWidget final
{
public:
	bool                                          HasPower;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFVoyageInteractType                          Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFVoyageInteractType                          Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFVoyageInteractType                          K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVoyageModuleWidgetInterface> K2Node_DynamicCast_AsVoyage_Module_Widget_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_UpdateModuleStateAndWidget;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.AllowInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_OpenDoorConsole_C_AllowInteract final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_AllowInteract;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.AllowPointerKey
// 0x0020 (0x0020 - 0x0000)
struct BP_Module_OpenDoorConsole_C_AllowPointerKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_AllowPointerKey;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.GetOverrideZoneId
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_OpenDoorConsole_C_GetOverrideZoneId final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_GetOverrideZoneId;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_OpenDoorConsole_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_HasAnyChanges;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_OpenDoorConsole_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_HasCustomData;

// Function BP_Module_OpenDoorConsole.BP_Module_OpenDoorConsole_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_OpenDoorConsole_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_OpenDoorConsole_C_PersistTranform;

}

