#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Crafter

#include "Basic.hpp"

#include "CraftableObjectList_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CraftableObjectStruct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Crafter.BP_Module_Crafter_C
// 0x0120 (0x03D0 - 0x02B0)
class ABP_Module_Crafter_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayFadeOut_NewTrack_0_6408EE8F46F3239E75F26E84778AB0D5; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OverlayFadeOut__Direction_6408EE8F46F3239E75F26E84778AB0D5; // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OverlayFadeOut;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         OverlayFadeIn_NewTrack_0_052640734C8A7645C590BB9ED8C9749F; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OverlayFadeIn__Direction_052640734C8A7645C590BB9ED8C9749F; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OverlayFadeIn;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCraftingRecipesBaseData_C*             Craftables;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterialInst;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FCraftableObjectStruct                 CraftableObject;                                   // 0x02F8(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* Actor)> OnActorSpawned;                              // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Module_Crafter(int32 EntryPoint);
	void OverlayFadeIn__FinishedFunc();
	void OverlayFadeIn__UpdateFunc();
	void OverlayFadeOut__FinishedFunc();
	void OverlayFadeOut__UpdateFunc();
	void ReceiveBeginPlay();
	void SendMessage();
	void SetMaterials();
	void SetMesh(class UStaticMesh* NewMesh);
	void SpawnActor();
	void StartCrafting(ECraftableObjectList Object);
	void StartCraftingItem(TSoftObjectPtr<class UVoyageItem> VoyageItem);
	void StartFadeIn();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Crafter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Crafter_C")
	}
	static class ABP_Module_Crafter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Crafter_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Crafter_C;

}

