#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_BaseInfoPECO

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.ExecuteUbergraph_BP_Module_BaseInfoPECO
// 0x0208 (0x0208 - 0x0000)
struct BP_Module_BaseInfoPECO_C_ExecuteUbergraph_BP_Module_BaseInfoPECO final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVoyageModuleComponent* SourceModule, bool bHasPower)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_2;                          // 0x0018(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_2;                               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_1;                          // 0x00B8(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_1;                               // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo;                            // 0x0158(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path;                                 // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 K2Node_CustomEvent_SourceModule;                   // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHasPower;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_ExecuteUbergraph_BP_Module_BaseInfoPECO;

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.OnModulePowerStateChanged_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_BaseInfoPECO_C_OnModulePowerStateChanged_Event final
{
public:
	class UVoyageModuleComponent*                 SourceModule;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPower;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_OnModulePowerStateChanged_Event;

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.OnPostApplyProperties
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_BaseInfoPECO_C_OnPostApplyProperties final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_OnPostApplyProperties;

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.OnPostSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_BaseInfoPECO_C_OnPostSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_OnPostSpawnConnectedActor;

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.OnPreSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_BaseInfoPECO_C_OnPreSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_OnPreSpawnConnectedActor;

// Function BP_Module_BaseInfoPECO.BP_Module_BaseInfoPECO_C.UpdateVisibilityBasedOnPower
// 0x0020 (0x0020 - 0x0000)
struct BP_Module_BaseInfoPECO_C_UpdateVisibilityBasedOnPower final
{
public:
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IVoyageModuleWidgetInterface> K2Node_DynamicCast_AsVoyage_Module_Widget_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_BaseInfoPECO_C_UpdateVisibilityBasedOnPower;

}

