#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Rotator_Solar_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Module_Solar_Panel_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C
// 0x0058 (0x03F8 - 0x03A0)
class ABP_Module_Rotator_Solar_Panel_C : public ABP_Module_Solar_Panel_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Module_Rotator_Solar_Panel_C;    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Panel;                                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SolarPanel_Base_Pole;                           // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SolarPanel_Head_Part_2;                         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Top1;                                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Rotator_Component_C*                BP_Rotator_Component;                              // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageSpawnerVolume*                   VoyageSpawnerVolume;                               // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SolarSensor;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        StartPitch;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartYaw;                                          // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Module_Rotator_Solar_Panel_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDurabilityChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, float Durability);
	bool CanOtherWeld(class USceneComponent* OtherComp);
	bool CanThisUnWeld();
	bool CanThisWeld(class USceneComponent* OtherComp);
	void DisableCollisionsBetweenSelf();
	void ExecuteUbergraph_BP_Module_Rotator_Solar_Panel(int32 EntryPoint);
	TSoftObjectPtr<class UNiagaraSystem> GetUnweldEffect(bool* OverrideDefault);
	TSoftObjectPtr<class UNiagaraSystem> GetWeldEffect(bool* OverrideDefault);
	void OnAttach(class USceneComponent* OtherComp);
	void OnComponentAttached(class USceneComponent* OtherComp);
	void OnComponentDetached(class USceneComponent* OtherComp);
	void OnDetach(class USceneComponent* OtherComp);
	void OnPersistentActorPostLoad(int32 Version);
	void OnUpdateRotation_Event(const struct FRotator& Rotation);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Rotator_Solar_Panel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Rotator_Solar_Panel_C")
	}
	static class ABP_Module_Rotator_Solar_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Rotator_Solar_Panel_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Rotator_Solar_Panel_C;

}

