#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_WindTurbine_Large

#include "Basic.hpp"

#include "BP_Module_WindTurbine_Small_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_WindTurbine_Large.BP_Module_WindTurbine_Large_C
// 0x0030 (0x03F0 - 0x03C0)
class ABP_Module_WindTurbine_Large_C final : public ABP_Module_WindTurbine_Small_C
{
public:
	class UStaticMeshComponent*                   SupportAddition2;                                  // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SupportAddition1;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole2;                                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole1;                                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole;                                              // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView1;                           // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_WindTurbine_Large_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_WindTurbine_Large_C")
	}
	static class ABP_Module_WindTurbine_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_WindTurbine_Large_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_WindTurbine_Large_C;

}

