#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Rotator_Solar_Panel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.BndEvt__BP_Module_Rotator_Solar_Panel_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDurabilityChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_BndEvt__BP_Module_Rotator_Solar_Panel_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDurabilityChanged__DelegateSignature final
{
public:
	class UVoyageModuleComponent*                 SourceModule;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Durability;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_BndEvt__BP_Module_Rotator_Solar_Panel_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDurabilityChanged__DelegateSignature;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.CanOtherWeld
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_CanOtherWeld final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_CanOtherWeld;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.CanThisUnWeld
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_CanThisUnWeld final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_CanThisUnWeld;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.CanThisWeld
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_CanThisWeld final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_CanThisWeld;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.ExecuteUbergraph_BP_Module_Rotator_Solar_Panel
// 0x0198 (0x0198 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_ExecuteUbergraph_BP_Module_Rotator_Solar_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRotator& Rotation)> K2Node_CreateDelegate_OutputDelegate;           // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Event_OtherComp_3;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Event_OtherComp_2;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Event_OtherComp_1;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 K2Node_ComponentBoundEvent_SourceModule;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Durability;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Version;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDurability_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        K2Node_Event_OtherComp;                            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0090(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_ExecuteUbergraph_BP_Module_Rotator_Solar_Panel;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.GetUnweldEffect
// 0x0030 (0x0030 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_GetUnweldEffect final
{
public:
	bool                                          OverrideDefault;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_GetUnweldEffect;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.GetWeldEffect
// 0x0030 (0x0030 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_GetWeldEffect final
{
public:
	bool                                          OverrideDefault;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_GetWeldEffect;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnAttach
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnAttach final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnAttach;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnComponentAttached
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnComponentAttached final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnComponentAttached;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnComponentDetached
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnComponentDetached final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnComponentDetached;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnDetach
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnDetach final
{
public:
	class USceneComponent*                        OtherComp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnDetach;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnPersistentActorPostLoad
// 0x0004 (0x0004 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnPersistentActorPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnPersistentActorPostLoad;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.OnUpdateRotation_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_OnUpdateRotation_Event final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_OnUpdateRotation_Event;

// Function BP_Module_Rotator_Solar_Panel.BP_Module_Rotator_Solar_Panel_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BP_Module_Rotator_Solar_Panel_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Rotator_Solar_Panel_C_UserConstructionScript;

}

