#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Compost_Mark1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"
#include "BP_Module_MasterRecycler_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Compost_Mark1.BP_Module_Compost_Mark1_C
// 0x0130 (0x0558 - 0x0428)
class ABP_Module_Compost_Mark1_C final : public ABP_Module_MasterRecycler_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Module_Compost_Mark1_C;          // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box1;                                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      PS_FireFloor;                                      // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView_Water;                      // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        HeatingInterpSpeed;                                // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTemperature;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetTemperature;                                 // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temperature;                                       // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double Percent)> OnTemperatureChanged;                             // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        TemperatureElectricityMultiplier;                  // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyageCustomModuleComponent*           CustomModuleComponent;                             // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        WorkloadWaterConsumptionMultiplier;                // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultElectricityConsumptionON;                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultWaterConsumptionON;                         // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EModuleResourceType, float>              DefaultConversionConsumption;                      // 0x04A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EModuleResourceType, float>              DefaultConversionProduction;                       // 0x04F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ConsumptionDebug;                                  // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultProductionSpeed;                            // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPower;                                          // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Module_Compost_Mark1_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompStateChanged__DelegateSignature(class UVoyageModuleComponent* Module, EVoyageModuleState OldState, EVoyageModuleState NewState);
	void BndEvt__BP_Module_Compost_Mark1_VoyageModuleSocketView_Water_K2Node_ComponentBoundEvent_2_VoyageSocketConnectionDelegate__DelegateSignature(bool bSocketConnection);
	void CanRecycleItem(class UObject* Object, bool* CanRecycle_0);
	void CheckUpdateTemperature();
	void ExecuteUbergraph_BP_Module_Compost_Mark1(int32 EntryPoint);
	void HasItemsToRecycle(bool* HasItems);
	void OnModuleValueChanged(class UVoyageModuleComponent* Module);
	void OnPersistentActorPostLoad(int32 Version);
	void ReceiveBeginPlay();
	void ResetTemperatureTimer();
	void SaveDefaultValues();
	void UpdateConsumptionProduction();
	void UpdateParticles();
	void UpdateTemperature();
	void UserConstructionScript();
	void ValidateItem(class UVoyageBaseInventoryComponent* Inventory, class UVoyageItem* Item, bool* bIsValid);

	bool CanRecycle() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Compost_Mark1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Compost_Mark1_C")
	}
	static class ABP_Module_Compost_Mark1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Compost_Mark1_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Compost_Mark1_C;

}

