#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Standing_Light_Base

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Standing_Light_Base.BP_Module_Standing_Light_Base_C
// 0x0088 (0x0398 - 0x0310)
class ABP_Module_Standing_Light_Base_C : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_DurabilityIndicatorComponent_C*     BP_DurabilityIndicatorComponent;                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BuoyancyComponent_C*                BP_BuoyancyComponent;                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDynamicCollisionComponent*       VoyageDynamicCollision;                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightMesh;                                         // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* BP_Show_Interact_Indicators_For_Custom_Requirements; // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView;                            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Button;                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialIntensity;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOn;                                              // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPreviewOn;                                       // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LightIntensity;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>                Lights;                                            // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         LightAttenuationRadius;                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Module_Sitting_Light_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDelegate__DelegateSignature(class UVoyageModuleComponent* Module);
	void Button_Toggle_State(class AVoyageModuleGenericSwitchActor* SwitchActor, bool bUpperThreshold);
	void ClearResources();
	void ExecuteUbergraph_BP_Module_Standing_Light_Base(int32 EntryPoint);
	void OnRemoteSocketConnectionChanged(bool bSocketConnection);
	void PowerStateChanged(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void ReceiveBeginPlay();
	void SetAttenuationRadius(TArray<class ULightComponent*>& Array);
	void SetLightState(bool On);
	void UpdateDynamicMaterialInst();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Standing_Light_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Standing_Light_Base_C")
	}
	static class ABP_Module_Standing_Light_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Standing_Light_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Standing_Light_Base_C;

}

