#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_fresh_Water_Tank

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_fresh_Water_Tank.BP_Module_fresh_Water_Tank_C
// 0x0038 (0x0348 - 0x0310)
class ABP_Module_fresh_Water_Tank_C final : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_DurabilityIndicatorComponent_C*     BP_DurabilityIndicatorComponent;                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* BP_Show_Interact_Indicators_For_Custom_Requirements; // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView2;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView1;                           // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	EInteractionConditionType CanBeInteractedBy(class AActor* InInteractor, int32 PartId, int32 InteractIndex);
	void ExecuteUbergraph_BP_Module_fresh_Water_Tank(int32 EntryPoint);
	class UVoyagePersistentActorComponent* GetPersistentActorComponent();
	void ReceiveBeginPlay();

	bool HasAnyChanges() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_fresh_Water_Tank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_fresh_Water_Tank_C")
	}
	static class ABP_Module_fresh_Water_Tank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_fresh_Water_Tank_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_fresh_Water_Tank_C;

}

