#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Electric_Engine_Cylinder

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Electric_Engine_Cylinder.BP_Module_Electric_Engine_Cylinder_C
// 0x0048 (0x0358 - 0x0310)
class ABP_Module_Electric_Engine_Cylinder_C : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* BP_Show_Interact_Indicators_For_Custom_Requirements; // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDynamicCollisionComponent*       VoyageDynamicCollision;                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DurabilityIndicatorComponent_C*     BP_DurabilityIndicatorComponent;                   // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BuoyancyComponent_C*                BP_BuoyancyComponent;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ConnectionIndicator_C*              BP_ConnectionIndicator;                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DynamicWavesComponent_C*            BP_DynamicWavesComponent;                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket1;                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	EInteractionConditionType CanBeInteractedBy(class AActor* InInteractor, int32 PartId, int32 InteractIndex);
	void ExecuteUbergraph_BP_Module_Electric_Engine_Cylinder(int32 EntryPoint);
	void OnPostApplyProperties(const struct FVoyageConnectedEventInfo& EventInfo, const class FString& Path);
	void OnPostSpawnConnectedActor(const struct FVoyageConnectedEventInfo& EventInfo, const class FString& Path);
	void OnPreSpawnConnectedActor(const struct FVoyageConnectedEventInfo& EventInfo, const class FString& Path);

	bool HasAnyChanges() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Electric_Engine_Cylinder_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Electric_Engine_Cylinder_C")
	}
	static class ABP_Module_Electric_Engine_Cylinder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Electric_Engine_Cylinder_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Electric_Engine_Cylinder_C;

}

