#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Diesel_Container

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_Diesel_Container.BP_Module_Diesel_Container_C.CanBeInteractedBy
// 0x0020 (0x0020 - 0x0000)
struct BP_Module_Diesel_Container_C_CanBeInteractedBy final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionConditionType                     ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionConditionType                     Temp_byte_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionConditionType                     Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevelopmentBuild_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionConditionType                     K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Container_C_CanBeInteractedBy;

// Function BP_Module_Diesel_Container.BP_Module_Diesel_Container_C.ExecuteUbergraph_BP_Module_Diesel_Container
// 0x0004 (0x0004 - 0x0000)
struct BP_Module_Diesel_Container_C_ExecuteUbergraph_BP_Module_Diesel_Container final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Container_C_ExecuteUbergraph_BP_Module_Diesel_Container;

// Function BP_Module_Diesel_Container.BP_Module_Diesel_Container_C.GetPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Module_Diesel_Container_C_GetPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Container_C_GetPersistentActorComponent;

// Function BP_Module_Diesel_Container.BP_Module_Diesel_Container_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_Diesel_Container_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Container_C_HasAnyChanges;

// Function BP_Module_Diesel_Container.BP_Module_Diesel_Container_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_Diesel_Container_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Container_C_PersistTranform;

}

