#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Status_Screen_Vertical

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Module_Status_Screen_Vertical.BP_Module_Status_Screen_Vertical_C.ExecuteUbergraph_BP_Module_Status_Screen_Vertical
// 0x0020 (0x0020 - 0x0000)
struct BP_Module_Status_Screen_Vertical_C_ExecuteUbergraph_BP_Module_Status_Screen_Vertical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Module_Status_Screen_C*            K2Node_DynamicCast_AsWBP_Module_Status_Screen;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Status_Screen_Vertical_C_ExecuteUbergraph_BP_Module_Status_Screen_Vertical;

// Function BP_Module_Status_Screen_Vertical.BP_Module_Status_Screen_Vertical_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Module_Status_Screen_Vertical_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Status_Screen_Vertical_C_ReceiveTick;

}

