#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Diesel_Engine_Cylinder

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.CanBeInteractedBy
// 0x0018 (0x0018 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_CanBeInteractedBy final
{
public:
	class AActor*                                 InInteractor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PartId;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionConditionType                     ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_CanBeInteractedBy;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.ExecuteUbergraph_BP_Module_Diesel_Engine_Cylinder
// 0x01E8 (0x01E8 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_ExecuteUbergraph_BP_Module_Diesel_Engine_Cylinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo;                            // 0x0008(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path;                                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_2;                          // 0x00A8(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_2;                               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_1;                          // 0x0148(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_1;                               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_ExecuteUbergraph_BP_Module_Diesel_Engine_Cylinder;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.OnPostApplyProperties
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_OnPostApplyProperties final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_OnPostApplyProperties;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.OnPostSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_OnPostSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_OnPostSpawnConnectedActor;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.OnPreSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_OnPreSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_OnPreSpawnConnectedActor;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_HasAnyChanges;

// Function BP_Module_Diesel_Engine_Cylinder.BP_Module_Diesel_Engine_Cylinder_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_Module_Diesel_Engine_Cylinder_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_Diesel_Engine_Cylinder_C_PersistTranform;

}

