#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ModuleCable_Oxygen

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ModuleCable_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ModuleCable_Oxygen.BP_ModuleCable_Oxygen_C
// 0x0038 (0x05B8 - 0x0580)
class ABP_ModuleCable_Oxygen_C final : public ABP_ModuleCable_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Movement_8FA56010467790CBC0F68DAB5E8A9A5E; // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Rotation_8FA56010467790CBC0F68DAB5E8A9A5E; // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8FA56010467790CBC0F68DAB5E8A9A5E; // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Movement_7F7F7D5F42CA2938FD3D0CB6853864EA; // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Rotation_7F7F7D5F42CA2938FD3D0CB6853864EA; // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_7F7F7D5F42CA2938FD3D0CB6853864EA; // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ModuleCable_Oxygen(int32 EntryPoint);
	void PerformConnectAnimation(bool bConnected, ECableSidePlugType PlugType);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ModuleCable_Oxygen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ModuleCable_Oxygen_C")
	}
	static class ABP_ModuleCable_Oxygen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ModuleCable_Oxygen_C>();
	}
};
DUMPER7_ASSERTS_ABP_ModuleCable_Oxygen_C;

}

