#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_Fabricator

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Module_Fabricator.BP_Module_Fabricator_C
// 0x01D0 (0x04E0 - 0x0310)
class ABP_Module_Fabricator_C final : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_RecyclerOutput_Guide;                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket1;                         // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket;                          // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketDiesel;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketWater;                                       // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketOxygen;                                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketPetrol;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketMethane;                                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SocketPanel_6;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Glass;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fabricator_Cover_Bottom;                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fabricator_Cover_Top;                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioEjector;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_LightStripComponent_C*              BP_LightStripComponent;                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SwitchFabricator;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DurabilityIndicatorComponent_C*     BP_DurabilityIndicatorComponent;                   // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* BP_Show_Interact_Indicators_For_Custom_Requirements; // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Physical_Inventory_Output_C*        BP_Physical_Inventory_Output;                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        arrow;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageBaseInventoryComponent*          OutputInventoryNew;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fabricator_Exterior;                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ScreenSwivelScene;                                 // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fabricator_Interior_A_01;                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageInventoryWeightLimitedComponent* VaultInventory;                                    // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageFabricatorComponent*             VoyageFabricator;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioEmitter;                                      // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       SocketElectric;                                    // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Monitor;                                           // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LaserPlane;                                        // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LaserLeft;                                         // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LaserRight;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LaserBase;                                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        HologramArrow;                                     // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      P_Laser_Right;                                     // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      P_Laser_Left;                                      // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fabricator_Screen_A_01;                         // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleWidgetComponent*           VoyageModuleWidget;                                // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveScreen;                                 // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScreenInteractiveBox;                              // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CraftSound;                                        // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TakeSound;                                         // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ErrorSound;                                        // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SwitchSound;                                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               StatusMI;                                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPrinting;                                        // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFabricator_Hologram_C*                 Hologram;                                          // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HologramMI;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BoundsExtent;                                      // 0x04A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Object;                                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            PrintMeshRef;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UVoyageItem*>                    Craftables;                                        // 0x04C8(0x0010)(Edit, BlueprintVisible)
	bool                                          IsFinishingFabrication;                            // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddCraftables(TArray<class UVoyageItem*>& Craftables_0);
	void BndEvt__BP_Module_Fabricator_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompPowerStateChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_1_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_2_VoyageFabricatorComponentUpdateFabricationDelegate__DelegateSignature(const struct FVoyageFabricatorQueueItem& QueueItem, float Progress, float Time);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_3_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_4_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_5_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_6_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageFabricator_K2Node_ComponentBoundEvent_8_VoyageFabricatorComponentFabricationDelegate__DelegateSignature(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	void BndEvt__BP_Module_Fabricator_VoyageModuleSocketView_K2Node_ComponentBoundEvent_7_VoyageSocketConnectionDelegate__DelegateSignature(bool bSocketConnection);
	void CancelFabrication();
	void ExecuteUbergraph_BP_Module_Fabricator(int32 EntryPoint);
	bool Fabricate(class UVoyageItem* Item, class AController* Controller);
	void FinishFabrication_();
	class UVoyageCrosshairWidgetData* GetInteractCrosshair(class AActor* InInteractor, int32 PartId);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	struct FVoyageModuleWorkVisualization GetModuleWorkload();
	bool GetScanText(struct FVoyageScanText* OutText, class APlayerController* InInstigator);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	void OnCraftSFX(bool Success);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void OnLoaded_A168094C42421AF9FF6595B277FE70D6(class UObject* Loaded);
	void OnLoaded_C7F404814F9B0578141DF9A07A8B7B3F(TSubclassOf<class UObject> Loaded);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPrintingChanged(bool bIsPrinting);
	void OpenLid(bool Open);
	void PostPowerChanged();
	void PowerLight(bool On);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetPrinting(bool bActive);
	void SetupMaterials();
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);
	void StartFabricating(class UClass* ActorClass, class UStaticMesh* InPrintMesh);
	void StartFabVisualization(class UVoyageItem* Item);
	void StopFabVisualization();
	void Switch_Effects(bool bVisible);
	void UpdateProgress(double status);
	void UserConstructionScript();

	bool CanFabricate(class UVoyageItem* Item, class AController* Controller) const;
	void FilterCraftables(TArray<class UVoyageItem*>& AllItems, TArray<class UVoyageItem*>* OutItems) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Module_Fabricator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Module_Fabricator_C")
	}
	static class ABP_Module_Fabricator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Module_Fabricator_C>();
	}
};
DUMPER7_ASSERTS_ABP_Module_Fabricator_C;

}

