#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Module_LightSwitch

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Module_LightSwitch.BP_Module_LightSwitch_C.Toggle
// 0x0010 (0x0010 - 0x0000)
struct BP_Module_LightSwitch_C_Toggle final
{
public:
	class AVoyageModuleGenericSwitchActor*        K2Node_DynamicCast_AsVoyage_Module_Generic_Switch_Actor; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_LightSwitch_C_Toggle;

// Function BP_Module_LightSwitch.BP_Module_LightSwitch_C.UpdatePower
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Module_LightSwitch_C_UpdatePower final
{
public:
	class UVoyageModuleSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPower_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetModuleGroupTotalResourceAmount_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageMeshScalarCache                 CallFunc_UpdateMeshesPowerStateCustom_Cache;       // 0x0048(0x00A8)()
	bool                                          CallFunc_UpdateMeshesPowerStateCustom_ReturnValue; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Module_LightSwitch_C_UpdatePower;

}

