#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_LaserBob_ProcWalk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPC_Ball_Base_ProcWalk_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_LaserBob_ProcWalk.BP_NPC_LaserBob_ProcWalk_C
// 0x00A0 (0x0D10 - 0x0C70)
class ABP_NPC_LaserBob_ProcWalk_C final : public ABP_NPC_Ball_Base_ProcWalk_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_LaserBob_ProcWalk_C;         // 0x0C70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        SwarmSpawnLocation;                                // 0x0C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WeakPointComponent_C*               BP_WeakPointComponent;                             // 0x0C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Track_F7BB8C8B4FDF98E3E9956E9FE02A38CD;   // 0x0C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_F7BB8C8B4FDF98E3E9956E9FE02A38CD; // 0x0C8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8D[0x3];                                      // 0x0C8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ShieldMaterial;                                    // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Shooting;                                          // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA1[0x7];                                      // 0x0CA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<int32>                                   SpawnedParticles;                                  // 0x0CA8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame)
	int32                                         SpawnedParticlesMax;                               // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRate;                                         // 0x0CFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AllowShootingTimer;                                // 0x0D00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AllowShooting();
	void BndEvt__BP_NPC_LaserBob_ProcWalk_BP_WeakPointComponent_K2Node_ComponentBoundEvent_0_VoyageWeakPointDamaged__DelegateSignature(class UVoyageWeakPointComponent* WeakPoint, float Damage);
	void ExecuteUbergraph_BP_NPC_LaserBob_ProcWalk(int32 EntryPoint);
	void GetRangedAttackOrigin(struct FTransform* Origin);
	void OnEvent(class UObject* Sender, const class FString& Event, const class FString& Params_0);
	void OnParticleDeath_Event(class AVoyageSwarmHandler* Handler, int32 ParticleKey);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SpawnSwarmEvent();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_LaserBob_ProcWalk_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_LaserBob_ProcWalk_C")
	}
	static class ABP_NPC_LaserBob_ProcWalk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_LaserBob_ProcWalk_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_LaserBob_ProcWalk_C;

}

