#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Angel

#include "Basic.hpp"

#include "BP_NPC_Simple_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Angel.BP_NPC_Angel_C
// 0x0070 (0x0BA0 - 0x0B30)
class ABP_NPC_Angel_C final : public ABP_NPC_Simple_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_Angel_C;                     // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, class AActor*>            TrackingSeeds;                                     // 0x0B48(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          NewVar;                                            // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_Angel(int32 EntryPoint);
	void OnAliveChangedDelegate_Event(class AVoyageBaseCharacter* Character, bool Alive_0);
	void OnPostLoadDead();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateHumanSeedAggro();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_NPC_Angel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NPC_Angel_C")
	}
	static class ABP_NPC_Angel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Angel_C>();
	}
};
DUMPER7_ASSERTS_ABP_NPC_Angel_C;

}

