#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Night_Water_Eggsack

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Night_Water_Eggsack.BP_Night_Water_Eggsack_C
// 0x0110 (0x03C0 - 0x02B0)
class ABP_Night_Water_Eggsack_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageDestructibleObjectComponent*     VoyageDestructibleObject;                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SpawnLocation;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DynamicWavesComponent_C*            BP_DynamicWavesComponent;                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BuoyancyComponent_C*                BP_BuoyancyComponent;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         HatchTime;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnCountMin;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnCountMax;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRadius;                                       // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyageSwarmTemplate*                   SwarmTemplate;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraSystem*                         HatchSystemTemplate;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ForceStrength;                                     // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageLootItemTables                  LootTable;                                         // 0x0310(0x0060)(Edit, BlueprintVisible)
	struct FVoyageItemSpawnSettings               LootSpawnSettings;                                 // 0x0370(0x0050)(Edit, BlueprintVisible, NoDestructor)

public:
	void BndEvt__BP_Night_Water_Eggsack_VoyageDestructibleObject_K2Node_ComponentBoundEvent_1_VoyageDestructibleDelegate__DelegateSignature(class UObject* Target, float Damage, float LootMultiplier);
	void DestroyEvent();
	void ExecuteUbergraph_BP_Night_Water_Eggsack(int32 EntryPoint);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void HatchEvent();
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void ReceiveBeginPlay();
	void SpawnChunks();
	void SpawnLoot();

	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Night_Water_Eggsack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Night_Water_Eggsack_C")
	}
	static class ABP_Night_Water_Eggsack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Night_Water_Eggsack_C>();
	}
};
DUMPER7_ASSERTS_ABP_Night_Water_Eggsack_C;

}

