#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OpenDoorButton

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_OpenDoorButton.BP_OpenDoorButton_C
// 0x0B08 (0x10F0 - 0x05E8)
class UBP_OpenDoorButton_C final : public UVoyageBaseUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text;                                              // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                IgnitionButton;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ConsoleText;                                       // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnConsoleInteract;                                 // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ScreenPowerOffStyle;                               // 0x0630(0x0390)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           ScreenPowerOnStyle;                                // 0x09C0(0x0390)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           ScreenPowerOnLockedStyle;                          // 0x0D50(0x0390)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_SKDoor_Master_C*                    DoorParent;                                        // 0x10E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 In_Module_Component;                               // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_CraneWidget_IgnitionButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_OpenDoorButton(int32 EntryPoint);
	class FText GetText();
	void SetText(const class FText& Text_0);
	void UpdateButtonStyle(bool Powered, bool Locked);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OpenDoorButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OpenDoorButton_C")
	}
	static class UBP_OpenDoorButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_OpenDoorButton_C>();
	}
};
DUMPER7_ASSERTS_UBP_OpenDoorButton_C;

}

