#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OceanTrashSpawner

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OceanTrashSpawner.BP_OceanTrashSpawner_C
// 0x0050 (0x03C8 - 0x0378)
class ABP_OceanTrashSpawner_C final : public AVoyageSpawnerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        EmptyRadiusNeededToSpawn;                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastSpawnTime;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpawnRateInSeconds;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterBodyOcean*                        WaterBodyOcean;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxToSpawn;                                        // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnOffset;                                       // 0x03A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterDepthNeededToSpawn;                           // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class AActor* SpawnActor(const struct FTransform& Transform);
	void RemoveActor(class UVoyagePersistentSubsystem* Target, class AActor* Actor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnActorUnloaded(class AActor* Actor);
	void OnActorDestroyed(class AActor* Actor);
	bool GenerateLocation(struct FTransform* TransformOut);
	void ExecuteUbergraph_BP_OceanTrashSpawner(int32 EntryPoint);

	bool AllowAsyncLocationGeneration() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OceanTrashSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OceanTrashSpawner_C")
	}
	static class ABP_OceanTrashSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OceanTrashSpawner_C>();
	}
};
DUMPER7_ASSERTS_ABP_OceanTrashSpawner_C;

}

