#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P_PipeStruct

#include "Basic.hpp"

#include "F_Generated_Instance_Data_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Pipe_Aligment_structs.hpp"
#include "E_Pipe_Directions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P_PipeStruct.BP_P_PipeStruct_C
// 0x05E0 (0x0890 - 0x02B0)
class ABP_P_PipeStruct_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Content;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        LeftArrow;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        UpArrow;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        RightArrow;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        DownArrow;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Down;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Up;                                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Right;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Left;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        DirectionalGuide;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SocketMeshScaleMin;                                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SocketMeshScaleMax;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       SocketMeshRotationOffset;                          // 0x0320(0x0010)(Edit, BlueprintVisible)
	struct FRotator                               StraightRotationOverride;                          // 0x0330(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Straight2XLocationOverride;                        // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Straight1XLocationOverride;                        // 0x0360(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TwoXLocationOverride;                              // 0x0378(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Straight2XHISMs;                        // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    Straight2XMeshes;                                  // 0x03A0(0x0010)(Edit, BlueprintVisible)
	struct FVector                                LeftMeshLocationOverride;                          // 0x03B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeftMeshRotationOverride;                          // 0x03C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> LeftHISMs;                              // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    LeftMeshes;                                        // 0x03F0(0x0010)(Edit, BlueprintVisible)
	struct FRotator                               RightMeshRotationOverride;                         // 0x0400(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RightMeshLocationOverride;                         // 0x0418(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> RightHISMs;                             // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    RightMeshes;                                       // 0x0440(0x0010)(Edit, BlueprintVisible)
	struct FRotator                               UpMeshRotationOverride;                            // 0x0450(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                UpMeshLocationOverride;                            // 0x0468(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> UpHISMs;                                // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FRotator                               DownMeshRotationOverride;                          // 0x0490(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                DownMeshLocationOverride;                          // 0x04A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> DownHISMs;                              // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    DownMeshes;                                        // 0x04D0(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    UpMeshes;                                          // 0x04E0(0x0010)(Edit, BlueprintVisible)
	bool                                          SaveCurrentRules;                                  // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TraceDistance;                                     // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Iterations__Length_;                               // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeed;                                        // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TracingMode;                                       // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutomaticMode;                                     // 0x0509(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Pipe_Aligment                               AligmentMode;                                      // 0x050A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StaticMeshVersion;                                 // 0x050B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomStream;                                      // 0x050C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StraightStartOffset;                               // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> ScatterHISMs;                           // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    ScatterMeshes;                                     // 0x0530(0x0010)(Edit, BlueprintVisible)
	TArray<E_Pipe_Directions>                     GivenDirections;                                   // 0x0540(0x0010)(Edit, BlueprintVisible)
	bool                                          UseSocketScattering;                               // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                GivenDistances;                                    // 0x0558(0x0010)(Edit, BlueprintVisible)
	double                                        WallThreshold;                                     // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UArrowComponent*>                GivenGuides;                                       // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ConstructPillars;                                  // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseEndPillar;                                      // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582[0x6];                                      // 0x0582(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PillarDensity;                                     // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PillarTraceStartOffset;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PillarMeshStartOffset;                             // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PillarMeshFillOffset;                              // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    PillarEndMesh;                                     // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    PillarMiddleMesh;                                  // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    PillarStartMesh;                                   // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseStartPillar;                                    // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinAllowedDistance;                                // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActorOffset;                                       // 0x05E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ActorRotationOffset;                               // 0x0600(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UClass*>                         actors;                                            // 0x0618(0x0010)(Edit, BlueprintVisible)
	bool                                          ScatterActors;                                     // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomActors;                                      // 0x0629(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ActorDensity;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddMeshesToLevel;                                  // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomSocketMeshDeletion;                          // 0x0639(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63A[0x6];                                      // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SocketMeshOffset;                                  // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> PillarEndHISMs;                         // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> PillarMiddleHISMs;                      // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> PillarStartHISMs;                       // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        PillarTracingDistance;                             // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PillarDotAdjustment;                               // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOrientationOverrides;                           // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentRuleIndex;                                  // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Left45Meshes;                                      // 0x0690(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Left45HISMs;                            // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    Right45Meshes;                                     // 0x06B0(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Right45HISMs;                           // 0x06C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    Up45Meshes;                                        // 0x06D0(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Up45HISMs;                              // 0x06E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    Down45Meshes;                                      // 0x06F0(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Down45HISMs;                            // 0x0700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> Straight1XHISMs;                        // 0x0710(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    Straight1XMeshes;                                  // 0x0720(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> TwoXHISMs;                              // 0x0730(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    TwoXMeshes;                                        // 0x0740(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> StraightXHISMs;                         // 0x0750(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    StraightXMeshes;                                   // 0x0760(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> StraightTHISMs;                         // 0x0770(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    StraightTMeshes;                                   // 0x0780(0x0010)(Edit, BlueprintVisible)
	double                                        StraightLength2X;                                  // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TwoX;                                              // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StraightLength1X;                                  // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Four5CornersLength;                                // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceClear;                                        // 0x07B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceUndo;                                         // 0x07B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B2[0x2];                                      // 0x07B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x07B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideColors_;                                   // 0x07C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C5[0x3];                                      // 0x07C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RingMeshLocationOverride;                          // 0x07C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RingMeshRotationOverride;                          // 0x07E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> RingHISMs;                              // 0x07F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    RingMeshes;                                        // 0x0808(0x0010)(Edit, BlueprintVisible)
	double                                        RingHeight;                                        // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddEndRing_;                                       // 0x0820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddStartRing_;                                     // 0x0821(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_822[0x6];                                      // 0x0822(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_Generated_Instance_Data>     SavedInstanceData;                                 // 0x0828(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	ECollisionEnabled                             Pipe_Collision;                                    // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHierarchicalInstancedStaticMeshComponent*> EndLeftHISMs;                           // 0x0840(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> EndRightHISMs;                          // 0x0850(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    EndLeftMeshes;                                     // 0x0860(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    EndRightMeshes;                                    // 0x0870(0x0010)(Edit, BlueprintVisible)
	class UMaterialInstance*                      MaterialInstance;                                  // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInHLOD;                                        // 0x0888(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSavedInstanceData;                              // 0x0889(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Zero_Add_Meshes_To_Level();
	void Zero_Clear();
	void Zero_Undo();
	void Four5_DOWN();
	void Four5_LEFT();
	void Four5_RIGHT();
	void Four5_UP();
	void Nine0_DOWN();
	void Nine0_LEFT();
	void Nine0_RIGHT();
	void Nine0_UP();
	void ActorScattering(const struct FVector& ActorLocation, const struct FRotator& ActorRotation, E_Pipe_Directions Directions);
	void AddRing(bool IsStart);
	void ClearHISMComponents();
	void ClearInstanceData();
	void ClearInstances();
	void CreateHISMs(const struct FTransform& Transform, TArray<class UStaticMesh*>& StaticMeshes, TArray<class UHierarchicalInstancedStaticMeshComponent*>& HISMComponents, int32 CullingDistance, ECollisionEnabled CollisionType, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool SocketScatter, bool InstanceWorldSpace, class UMaterialInstance* MaterialInstance_0, class UStaticMesh** StaticMesh, int32* InstanceId, class UHierarchicalInstancedStaticMeshComponent** HISMComponent);
	void CreateMesh(const struct FTransform& InstanceTransform, class UStaticMesh* InstanceMesh, class UMaterialInstance* MaterialInstance_0, class UHierarchicalInstancedStaticMeshComponent* HISMComponent, bool InstanceWorldSpace, bool SocketScatter, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, class UStaticMesh** UsedMesh, int32* InstanceId);
	void CreatePipeStruct();
	void EMPTY_1M();
	void END_LEFT();
	void END_RIGHT();
	void ExecuteUbergraph_BP_P_PipeStruct(int32 EntryPoint);
	void HISMSaving();
	void LoadInstanceData();
	void Lock();
	void OverrideAppearance(class UPrimitiveComponent* Input);
	void OverridePipePivots(const struct FRotator& InputRotation, const struct FVector& InputLocation, const struct FRotator& RotationOverride, const struct FVector& LocationOverride, struct FRotator* OutputRotation, struct FVector* OutputLocation);
	void PillarGeneration(const struct FVector& TracingPoint, double TracingDistance, const struct FRotator& PillarRotation, const struct FVector& StartPoint);
	void PipeGeneration();
	void PipeMeshGeneration(int32 Index_0, const struct FVector& CurrentLocation);
	void PipeMeshSelection(TArray<class UStaticMesh*>* StaticMeshes);
	void RandomDirectionGeneration(E_Pipe_Directions* RandomDirections);
	void Refresh();
	void SaveInstanceData(class UInstancedStaticMeshComponent* HISMComponent, class UMaterialInstance* MaterialInstance_0);
	void SpawnFromSockets(int32 InstanceIndex, class UHierarchicalInstancedStaticMeshComponent* HISMComponent, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool InstanceIsWorldSpace);
	void TwoX_0();
	void STRAIGHT_1X();
	void STRAIGHT_2X();
	void STRAIGHT_T_INTERSECTION();
	void STRAIGHT_X_INTERSECTION();
	void Unlock();
	void UpdateHLODState();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_P_PipeStruct_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_P_PipeStruct_C")
	}
	static class ABP_P_PipeStruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_P_PipeStruct_C>();
	}
};
DUMPER7_ASSERTS_ABP_P_PipeStruct_C;

}

