#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Physical_Inventory_Output

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Physical_Inventory_Output.BP_Physical_Inventory_Output_C
// 0x0170 (0x03C0 - 0x0250)
class UBP_Physical_Inventory_Output_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        CurrentScene;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageBaseInventoryComponent*          TargetInventory;                                   // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocked;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DropEvenIfBlocked;                                 // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Sphere_Radius;                                     // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDelay;                                        // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageItemSpawnSettings               SpawnSettings;                                     // 0x0278(0x0050)(Edit, BlueprintVisible, NoDestructor)
	struct FFloatRange                            ForwardLinearVelocityRange;                        // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRate;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRateOriginal;                                 // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OutputQueueTimer;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoyageItemData                        Voyage_Item_Data;                                  // 0x02F0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                RandomLocation;                                    // 0x0368(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutputLocation;                                    // 0x0380(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnOutputBlocked;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOutputUnblocked;                                 // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckBlocking(TArray<class UPrimitiveComponent*>& Array);
	void CheckImmediateDrop(bool* DoDrop);
	void DropItem();
	void ExecuteUbergraph_BP_Physical_Inventory_Output(int32 EntryPoint);
	void FakeOutputItem(class AActor* Actor);
	void FindSlotWithMostItems(int32* Index_0);
	void ForceCheckBlocking();
	struct FVector GetOutputLocation();
	void OnInventoryChanged_Event();
	void ReceiveBeginPlay();
	void SetDropTimer();
	void SetModuleBlockedRequirement(bool Requirement_Requirement_Met);
	void UpdateOutputVelocity();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Physical_Inventory_Output_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Physical_Inventory_Output_C")
	}
	static class UBP_Physical_Inventory_Output_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Physical_Inventory_Output_C>();
	}
};
DUMPER7_ASSERTS_UBP_Physical_Inventory_Output_C;

}

