#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P_LinearStruct

#include "Basic.hpp"

#include "F_Generated_Instance_Data_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P_LinearStruct.BP_P_LinearStruct_C
// 0x0208 (0x04B8 - 0x02B0)
class ABP_P_LinearStruct_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ScatterBox;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Content;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnPillarDebris;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ScatterDimensions;                                 // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScatterDensity;                                    // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    ScatteringMeshes;                                  // 0x02F8(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> ScatteringHISMs;                        // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         DebrisCullDistance;                                // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomSeedStruct;                                  // 0x031C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	int32                                         SeedNumber;                                        // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             DebrisCollision;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StaticMeshVersion;                                 // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    SocketMeshes;                                      // 0x0330(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> SocketHISMs;                            // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          AllowSocketMeshes;                                 // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SocketMeshScaleMin;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SocketMeshScaleMax;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       SocketMeshRotationOffset;                          // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SocketMeshCullDistance;                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Structs;                                           // 0x0380(0x0010)(Edit, BlueprintVisible)
	double                                        StructDimension;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddMeshesToLevel;                                  // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInHLOD;                                        // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomStructRotations;                             // 0x039A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39B[0x5];                                      // 0x039B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    MiddleMeshes;                                      // 0x03A0(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    MiddleD_Meshes;                                    // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> MiddleHISMs;                            // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    EndMeshes;                                         // 0x03D0(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    EndD_Meshes;                                       // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> EndHISMs;                               // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    StartMeshes;                                       // 0x0400(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    StartD_Meshes;                                     // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> StartHISMs;                             // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FRotator                               StructRotation;                                    // 0x0430(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TSubclassOf<class AActor>                     StartActor;                                        // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 MiddleActor;                                       // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EndActor;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Vertical_;                                         // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseEndStruct;                                      // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseStartStruct;                                    // 0x0462(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomEndStruct;                                // 0x0463(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomStartStruct;                              // 0x0464(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomSocketMeshDeletion;                          // 0x0465(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideColors_;                                   // 0x0466(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_467[0x1];                                      // 0x0467(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_Generated_Instance_Data>     SavedInstanceData;                                 // 0x0478(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	ECollisionEnabled                             CollisionMain;                                     // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      DecoMaterialInstance;                              // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CurrentStructRotation;                             // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseSavedInstanceData;                              // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorFromMeshSocket(class UHierarchicalInstancedStaticMeshComponent* HISMComponent, int32 InstanceIndex, const class FString& SocketName, TArray<struct FRotator>& RandomRotations, TSubclassOf<class AActor> ActorClass);
	void Add_Meshes_To_Level();
	void AddDMesh(const struct FTransform& Transform, TArray<class UStaticMesh*>& DetailMeshes, int32 MeshIndex);
	void ClearHISMComponents();
	void ClearInstanceData();
	void CreateHISMs(const struct FTransform& Transform, TArray<class UStaticMesh*>& StaticMeshes, TArray<class UHierarchicalInstancedStaticMeshComponent*>& HISMComponents, int32 CullingDistance, ECollisionEnabled CollisionType, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool SocketScatter, class UMaterialInstance* MaterialInstance, class UStaticMesh** UsedMesh, int32* InstanceId, class UHierarchicalInstancedStaticMeshComponent** HISMComponent);
	void CreateLinearStruct();
	void CreateMesh(const struct FTransform& InstanceTransform, class UStaticMesh* InstanceMesh, class UMaterialInstance* MaterialInstance, class UHierarchicalInstancedStaticMeshComponent* HISMComponent, bool InstanceWorldSpace, bool SocketScatter, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, class UStaticMesh** UsedMesh, int32* InstanceId);
	void CreateStructs();
	void ExecuteUbergraph_BP_P_LinearStruct(int32 EntryPoint);
	void HandleStructMeshes(const struct FVector& RoofPoint, const struct FRotator& StructRotation_0, const struct FVector& FloorPoint);
	void HISMSaving();
	void LoadInstanceData();
	void Lock();
	void OverrideAppearance(class UPrimitiveComponent* Input);
	void Refresh();
	void SaveInstanceData(class UHierarchicalInstancedStaticMeshComponent* HISMComponent, class UMaterialInstance* MaterialInstance);
	void Scattering(const struct FVector& ScatterLocation);
	void SpawnFromSockets(int32 InstanceIndex, class UHierarchicalInstancedStaticMeshComponent* HISMComponent, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool InstanceIsWorldSpace);
	void Unlock();
	void UpdateHLODState();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_P_LinearStruct_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_P_LinearStruct_C")
	}
	static class ABP_P_LinearStruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_P_LinearStruct_C>();
	}
};
DUMPER7_ASSERTS_ABP_P_LinearStruct_C;

}

