#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PersistentOverlapTrigger_Actor

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PersistentOverlapTrigger_Actor.BP_PersistentOverlapTrigger_Actor_C
// 0x0078 (0x0338 - 0x02C0)
class ABP_PersistentOverlapTrigger_Actor_C : public AVoyageObjectFilterActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Triggered;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RemainTriggered;                                   // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ABP_PersistentOverlapTrigger_Actor_C* TriggerActor)> OnTriggerActivated; // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class ABP_PersistentOverlapTrigger_Actor_C* TriggerActor)> OnTriggerCleared; // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVoyageQuestLogic*                      OnTriggerLogic;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageQuestObject*                     QuestObject;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVoyageQuestObject*                     QuestObjectTick;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<ECollisionChannel>                     DisabledChannels;                                  // 0x0318(0x0010)(Edit, BlueprintVisible)
	class UVoyageQuestLogic*                      OnTickLogic;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          TIckLogicFinished;                                 // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckOverlaps(bool* pass);
	void CheckTrigger();
	void CustomEvent();
	void DisableOverlaps(class UPrimitiveComponent* Primitive, TArray<ECollisionChannel>& Channel);
	void DisableOverlapsIfRemainTriggered();
	void ExecuteUbergraph_BP_PersistentOverlapTrigger_Actor(int32 EntryPoint);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RunBlueprintLogic();

	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PersistentOverlapTrigger_Actor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PersistentOverlapTrigger_Actor_C")
	}
	static class ABP_PersistentOverlapTrigger_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PersistentOverlapTrigger_Actor_C>();
	}
};
DUMPER7_ASSERTS_ABP_PersistentOverlapTrigger_Actor_C;

}

