#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartsBox

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_PartsBox.BP_PartsBox_C.ExecuteUbergraph_BP_PartsBox
// 0x0018 (0x0018 - 0x0000)
struct BP_PartsBox_C_ExecuteUbergraph_BP_PartsBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageItem*                            CallFunc_GetCurrentVisualizeItem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PartsBox_C_ExecuteUbergraph_BP_PartsBox;

// Function BP_PartsBox.BP_PartsBox_C.GetItemData
// 0x0148 (0x0148 - 0x0000)
struct BP_PartsBox_C_GetItemData final
{
public:
	class UVoyageItem*                            Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UVoyageItem>>     CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
	TMap<int32, struct FVoyageItemSerialize>      CallFunc_GetItemsByType_OutItems;                  // 0x0018(0x0050)()
	TSoftObjectPtr<class UVoyageItem>             CallFunc_Array_Get_Item;                           // 0x0068(0x0028)(HasGetValueTypeHash)
	TArray<struct FVoyageItemSerialize>           CallFunc_Map_Values_Values;                        // 0x0090(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageItemSerialize                   CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0090)()
	class UVoyageItem*                            K2Node_DynamicCast_AsVoyage_Item;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PartsBox_C_GetItemData;

// Function BP_PartsBox.BP_PartsBox_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PartsBox_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PartsBox_C_ReceiveTick;

// Function BP_PartsBox.BP_PartsBox_C.UpdateVisual
// 0x0008 (0x0008 - 0x0000)
struct BP_PartsBox_C_UpdateVisual final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PartsBox_C_UpdateVisual;

}

