#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P_Wall

#include "Basic.hpp"

#include "F_Generated_Instance_Data_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_WallType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P_Wall.BP_P_Wall_C
// 0x01D8 (0x0488 - 0x02B0)
class ABP_P_Wall_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ToolMesh;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Content;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Width;                                             // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height;                                            // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomSeedStruct;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	TArray<class UStaticMesh*>                    InteriorMiddleMeshes;                              // 0x02E0(0x0010)(Edit, BlueprintVisible)
	bool                                          OverrideColors_;                                   // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ExteriorColor;                                     // 0x02F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MIddleMeshSize;                                    // 0x0308(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    SocketMeshes;                                      // 0x0320(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> SocketHISMs;                            // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        CenterThickness;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StaticMeshVersion;                                 // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddMeshesToLevel;                                  // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomSocketMeshDeletion;                          // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x1];                                      // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SocketMeshCullDistance;                            // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SocketMeshScaleMin;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SocketMeshScaleMax;                                // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRotator>                       SocketMeshRotationOffset;                          // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SeedNumber;                                        // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSocketMeshes;                                   // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RandomSocketMeshDeletionWeight;                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_Generated_Instance_Data>     SavedInstanceData;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	ECollisionEnabled                             Collision_Main;                                    // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    CenterMiddleMeshes;                                // 0x0398(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    ExteriorMiddleMeshes;                              // 0x03A8(0x0010)(Edit, BlueprintVisible)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> InteriorMiddleHISMs;                    // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> ExteriorMiddleHISMs;                    // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> CenterMiddleHISMs;                      // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ConstructCenter;                                   // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructInterior;                                 // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructExterior;                                 // 0x03EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScaleFill;                                      // 0x03EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutomaticMode;                                     // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CenterColor;                                       // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InteriorColor;                                     // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ExteriorMaterial;                                  // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CenterMaterial;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InteriorMaterial;                                  // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> TrimMiddleHISMs;                        // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    TrimMiddleMeshes;                                  // 0x0438(0x0010)(Edit, BlueprintVisible)
	double                                        TrimThickness;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructRightTrim;                                // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructLeftTrim;                                 // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructTopTrim;                                  // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstructBottomTrim;                               // 0x0453(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    SpecialInteriorMiddleMeshes;                       // 0x0458(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    SpecialExteriorMiddleMeshes;                       // 0x0468(0x0010)(Edit, BlueprintVisible)
	class UMaterialInstance*                      TrimMaterial;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSavedInstanceData;                              // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Meshes_To_Level();
	void AutomaticModeHISMSaving();
	void CalculateWallThickness(class UStaticMesh* WallMesh, double* WallThickness);
	void ClearHISMComponents();
	void ClearInstanceData();
	void ClearInstances();
	void ConstructMain();
	void CreateHISMs(const struct FTransform& Transform, TArray<class UStaticMesh*>& StaticMeshes, TArray<class UHierarchicalInstancedStaticMeshComponent*>& HISMComponents, int32 CullingDistance, ECollisionEnabled CollisionType, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool SocketScatter, class UMaterialInstance* MaterialInstance, const struct FLinearColor& Visuals, class UStaticMesh** UsedMesh, int32* InstanceId, class UHierarchicalInstancedStaticMeshComponent** HISMComponent);
	void CreateMesh(const struct FTransform& Transform, class UStaticMesh* StaticMesh, class UMaterialInstance* MaterialInstance, bool InstanceToWorldSpace, class UHierarchicalInstancedStaticMeshComponent* HISMComp, bool SocketScattering, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHIMSs, TArray<class UStaticMesh*>& SocketScatterMeshes, const struct FLinearColor& Visuals, class UStaticMesh** UsedMesh, int32* InstanceId);
	void CreateMiddle(int32 WideAmount, int32 LongAmount, E_WallType WallType, TArray<class UStaticMesh*>& StaticMeshes, TArray<class UHierarchicalInstancedStaticMeshComponent*>& HISMComponents, double ElementOffset, double ElementThickness, bool UseScaleFill_0, bool FlipMesh, const struct FLinearColor& Visuals);
	void CreateStruct();
	void CreateTrim(int32 LongAmount, E_WallType WallType, TArray<class UStaticMesh*>& StaticMeshes, TArray<class UHierarchicalInstancedStaticMeshComponent*>& HISMComponents, double ElementOffset, double ElementThickness, const struct FLinearColor& Visuals);
	void CreateWall();
	void ExecuteUbergraph_BP_P_Wall(int32 EntryPoint);
	void HideToolMesh();
	void LoadInstanceData();
	void OverrideAppearance(class UPrimitiveComponent* Input, const struct FLinearColor& Color);
	void ReceiveBeginPlay();
	void Refresh();
	void SaveInstanceData(class UHierarchicalInstancedStaticMeshComponent* HISMComponent, E_WallType WallType);
	void SpawnFromSockets(int32 InstanceIndex, class UHierarchicalInstancedStaticMeshComponent* HISMComponent, TArray<class UHierarchicalInstancedStaticMeshComponent*>& SocketScatterHISMs, TArray<class UStaticMesh*>& SocketScatterMeshes, bool InstanceIsWorldSpace);
	void UpdateToolColor(const struct FLinearColor& ToolColor);
	void UpdateToolMesh(class UStaticMesh* ToolMesh_0, const struct FLinearColor& ToolColor, const struct FTransform& Transform);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_P_Wall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_P_Wall_C")
	}
	static class ABP_P_Wall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_P_Wall_C>();
	}
};
DUMPER7_ASSERTS_ABP_P_Wall_C;

}

