#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Comp_Sweep_Damage

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Comp_Sweep_Damage.BP_Projectile_Comp_Sweep_Damage_C
// 0x0490 (0x06E0 - 0x0250)
class UBP_Projectile_Comp_Sweep_Damage_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                PrevLocation;                                      // 0x0258(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TravelGranularity;                                 // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackID;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceTraveled;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageWeaponDataStruct                WeaponData;                                        // 0x0290(0x0420)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AController*                            InstigatorController;                              // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InnerRadius;                                       // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OuterRadius;                                       // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalTravel;                                       // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SweepDamageMultiplier;                             // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_Comp_Sweep_Damage(int32 EntryPoint);
	void OnComponentHit_Event(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnSpawn(class UProjectileAbilityComponent* ProjectileAbility, const struct FVoyageWeaponDataStruct& WeaponData_0, const struct FVoyageEquipmentAbilityActivationArgs& InArgs);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RefreshLocation(const struct FVector& Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Projectile_Comp_Sweep_Damage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Projectile_Comp_Sweep_Damage_C")
	}
	static class UBP_Projectile_Comp_Sweep_Damage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Projectile_Comp_Sweep_Damage_C>();
	}
};
DUMPER7_ASSERTS_UBP_Projectile_Comp_Sweep_Damage_C;

}

