#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PowerDoor_Hatch_A

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DoorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PowerDoor_Hatch_A.BP_PowerDoor_Hatch_A_C
// 0x0078 (0x0550 - 0x04D8)
class ABP_PowerDoor_Hatch_A_C final : public ABP_DoorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PowerDoor_Hatch_A_C;             // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   LightBP_Scifi_Caution;                             // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Door_IndicatorPanel2;                           // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                UDS_Occlusion_Portal;                              // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle2;                                           // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageAdjustGrabBoxComponent*          VoyageAdjustGrabBox1;                              // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DoorMovementComponent_Linear_C*     BP_DoorMovementComponent_Linear;                   // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BlockingCheck;                                     // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageAdjustGrabBoxComponent*          VoyageAdjustGrabBox;                               // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorMesh;                                          // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle1;                                           // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MetaSound_Door;                                    // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            InteractiveObject;                                 // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PowerDoor_Hatch_A(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PowerDoor_Hatch_A_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PowerDoor_Hatch_A_C")
	}
	static class ABP_PowerDoor_Hatch_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PowerDoor_Hatch_A_C>();
	}
};
DUMPER7_ASSERTS_ABP_PowerDoor_Hatch_A_C;

}

