#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PatternItemToolTipWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PatternItemToolTipWidget.BP_PatternItemToolTipWidget_C.ExecuteUbergraph_BP_PatternItemToolTipWidget
// 0x0040 (0x0040 - 0x0000)
struct BP_PatternItemToolTipWidget_C_ExecuteUbergraph_BP_PatternItemToolTipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageFocusableWidget*                 K2Node_Event_InWidgetContext;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_InventorySlot_PatternItem_C*        K2Node_DynamicCast_AsBP_Inventory_Slot_Pattern_Item; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFabricate_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0020(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_PatternItemToolTipWidget_C_ExecuteUbergraph_BP_PatternItemToolTipWidget;

// Function BP_PatternItemToolTipWidget.BP_PatternItemToolTipWidget_C.OnSetContent
// 0x0008 (0x0008 - 0x0000)
struct BP_PatternItemToolTipWidget_C_OnSetContent final
{
public:
	class UVoyageFocusableWidget*                 InWidgetContext;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PatternItemToolTipWidget_C_OnSetContent;

}

