#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_Comparison

#include "Basic.hpp"

#include "QuestLogicComparisonFormat_structs.hpp"
#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_Comparison.BP_QuestLogic_Comparison_C
// 0x0040 (0x00A0 - 0x0060)
class UBP_QuestLogic_Comparison_C final : public UVoyageQuestLogic
{
public:
	class UVoyageQuestLogic*                      ComparisonValueA;                                  // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageQuestLogic*                      ComparisonValueB;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Comparison_Method;                                 // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestLogicComparisonFormat                   ComparisonFormatType;                              // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModuleResourceType                           ResourceType;                                      // 0x0072(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageUnitFormattingArg               ResourceFormatting;                                // 0x0074(0x0018)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Tolerance;                                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutputFormatted;                                   // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_Comparison_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_Comparison_C")
	}
	static class UBP_QuestLogic_Comparison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_Comparison_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_Comparison_C;

}

