#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_SetIndicator

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_SetIndicator.BP_QuestLogic_SetIndicator_C
// 0x0040 (0x00A0 - 0x0060)
class UBP_QuestLogic_SetIndicator_C final : public UVoyageQuestLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyagePersistentActorReference*        TargetActor;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IndicatorWasSet;                                   // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   IndicatorText;                                     // 0x0078(0x0010)(Edit, BlueprintVisible)
	bool                                          SyncWithTaskCompletion;                            // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageWidgetComponentData*             IndicatorWidgetData;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageQuestLogic*                      IndicatorShowLogic;                                // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestLogic_SetIndicator(int32 EntryPoint);
	void OnFinish(const class UVoyageQuestObject* InQuestObject);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_SetIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_SetIndicator_C")
	}
	static class UBP_QuestLogic_SetIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_SetIndicator_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_SetIndicator_C;

}

