#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_HasSkill

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestLogic_HasSkill.BP_QuestLogic_HasSkill_C.OnRun
// 0x0078 (0x0078 - 0x0000)
struct BP_QuestLogic_HasSkill_C_OnRun final
{
public:
	const class UVoyageQuestObject*               InQuestObject;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageQuestLogicResult                ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm)
	int32                                         NumConnections;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyagePlayerController*                CallFunc_GetQuestOwner_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerSkill_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageQuestLogicResult                K2Node_MakeStruct_VoyageQuestLogicResult;          // 0x0058(0x0020)()
};
DUMPER7_ASSERTS_BP_QuestLogic_HasSkill_C_OnRun;

}

