#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_Craft

#include "Basic.hpp"

#include "Voyage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_Craft.BP_QuestLogic_Craft_C
// 0x0028 (0x0088 - 0x0060)
class UBP_QuestLogic_Craft_C final : public UVoyageQuestLogic
{
public:
	TArray<TSoftObjectPtr<class UVoyageItem>>     ItemClass;                                         // 0x0060(0x0010)(Edit, BlueprintVisible)
	int32                                         FabricateAmountRequired;                           // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalFabricated;                                   // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorReference*        TargetModule;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBound;                                           // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FabricatorProgressChanged(const struct FVoyageFabricatorQueueItem& QueueItem, float Progress, float Time);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_Craft_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_Craft_C")
	}
	static class UBP_QuestLogic_Craft_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_Craft_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_Craft_C;

}

