#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_LazarusRackState

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "BP_LazarusRackState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_LazarusRackState.BP_QuestLogic_LazarusRackState_C
// 0x0028 (0x0088 - 0x0060)
class UBP_QuestLogic_LazarusRackState_C final : public UVoyageQuestLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EBP_LazarusRackState                          State;                                             // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HumanGrown;                                        // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Repaired;                                          // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Powered;                                           // 0x006B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AVoyageLazarusRack*>             LazarusRacksInArea;                                // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          RequiresFallback;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestLogic_LazarusRackState(int32 EntryPoint);
	void OnPodEjected_Event(class AVoyageLazarusPOD* HumanPod);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);
	void OnSetup(const class UVoyageQuestObject* InQuestObject);
	void SetupLazarusEvents();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_LazarusRackState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_LazarusRackState_C")
	}
	static class UBP_QuestLogic_LazarusRackState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_LazarusRackState_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_LazarusRackState_C;

}

