#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_LaunchPecoApp

#include "Basic.hpp"

#include "Voyage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_LaunchPecoApp.BP_QuestLogic_LaunchPecoApp_C
// 0x0038 (0x0098 - 0x0060)
class UBP_QuestLogic_LaunchPecoApp_C final : public UVoyageQuestLogic
{
public:
	class UVoyageTerminalAppObject*               LaunchApp;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorReference*        TargetTerminal;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CloseAppAfterTime;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitUntilClosed;                                   // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Running;                                           // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          OverrideBackNavigation;                            // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseRunningApp();
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_LaunchPecoApp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_LaunchPecoApp_C")
	}
	static class UBP_QuestLogic_LaunchPecoApp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_LaunchPecoApp_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_LaunchPecoApp_C;

}

