#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_IsFabricating

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_IsFabricating.BP_QuestLogic_IsFabricating_C
// 0x0020 (0x0080 - 0x0060)
class UBP_QuestLogic_IsFabricating_C final : public UVoyageQuestLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyageItem*                            Item;                                              // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedsFinishCount;                                  // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinishCount;                                       // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBuilder;                                        // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedsBuilder;                                      // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedsStarted;                                      // 0x007A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Started;                                           // 0x007B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestLogic_IsFabricating(int32 EntryPoint);
	void OnFabricationFinished(class UVoyageFabricatorComponent* SourceModule, int32 QueueIndex);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_IsFabricating_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_IsFabricating_C")
	}
	static class UBP_QuestLogic_IsFabricating_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_IsFabricating_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_IsFabricating_C;

}

