#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_CreateIndicatorsForActorReferences

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_CreateIndicatorsForActorReferences.BP_QuestLogic_CreateIndicatorsForActorReferences_C
// 0x0078 (0x00D8 - 0x0060)
class UBP_QuestLogic_CreateIndicatorsForActorReferences_C final : public UVoyageQuestLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UVoyagePersistentActorReference*, TSoftObjectPtr<class UBP_Interact_Indicator_C>> CreatedIndicators; // 0x0068(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseRootMeshOnly;                                   // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RelativeTransform;                                 // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QuestLogic_CreateIndicatorsForActorReferences(int32 EntryPoint);
	void OnFinish(const class UVoyageQuestObject* InQuestObject);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);
	void UpdateIndicator(class UVoyagePersistentActorReference* Reference);
	void UpdateIndicatorText(class UBP_Interact_Indicator_C* WidgetComponent, class UVoyagePersistentActorReference* Reference);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_CreateIndicatorsForActorReferences_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_CreateIndicatorsForActorReferences_C")
	}
	static class UBP_QuestLogic_CreateIndicatorsForActorReferences_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_CreateIndicatorsForActorReferences_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_CreateIndicatorsForActorReferences_C;

}

