#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestLogic_PlayAudio

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QuestLogic_PlayAudio.BP_QuestLogic_PlayAudio_C
// 0x0048 (0x00A8 - 0x0060)
class UBP_QuestLogic_PlayAudio_C final : public UVoyageQuestLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class USoundBase>              Sound;                                             // 0x0068(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UVoyageQuestObject*                     CachedQuestObject;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioFinished;                                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Audio;                                             // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_QuestLogic_PlayAudio(int32 EntryPoint);
	void OnFinish(const class UVoyageQuestObject* InQuestObject);
	void OnLoaded_7F369B7F4EAFC560D5D8B79B8C4649F8(class UObject* Loaded);
	struct FVoyageQuestLogicResult OnRun(const class UVoyageQuestObject* InQuestObject, float DeltaSeconds);
	void PlaySoundEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QuestLogic_PlayAudio_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QuestLogic_PlayAudio_C")
	}
	static class UBP_QuestLogic_PlayAudio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_QuestLogic_PlayAudio_C>();
	}
};
DUMPER7_ASSERTS_UBP_QuestLogic_PlayAudio_C;

}

