#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rocket_Reward

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Water_structs.hpp"


namespace SDK::Params
{

// Function BP_Rocket_Reward.BP_Rocket_Reward_C.CompleteTask
// 0x0028 (0x0028 - 0x0000)
struct BP_Rocket_Reward_C_CompleteTask final
{
public:
	class UVoyageQuestSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageQuestObjective                  CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(NoDestructor)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CompleteTask_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rocket_Reward_C_CompleteTask;

// Function BP_Rocket_Reward.BP_Rocket_Reward_C.ExecuteUbergraph_BP_Rocket_Reward
// 0x0350 (0x0350 - 0x0000)
struct BP_Rocket_Reward_C_ExecuteUbergraph_BP_Rocket_Reward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSphericalPontoon& Pontoon)> K2Node_CreateDelegate_OutputDelegate;   // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSphericalPontoon                      K2Node_CustomEvent_Pontoon;                        // 0x0020(0x0310)(ConstParm, ContainsInstancedReference)
	int32                                         K2Node_Event_Version;                              // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumOccupiedSlots_ReturnValue;          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x034E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rocket_Reward_C_ExecuteUbergraph_BP_Rocket_Reward;

// Function BP_Rocket_Reward.BP_Rocket_Reward_C.OnEnteredWaterDelegate_Event
// 0x0310 (0x0310 - 0x0000)
struct BP_Rocket_Reward_C_OnEnteredWaterDelegate_Event final
{
public:
	struct FSphericalPontoon                      Pontoon;                                           // 0x0000(0x0310)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_Rocket_Reward_C_OnEnteredWaterDelegate_Event;

// Function BP_Rocket_Reward.BP_Rocket_Reward_C.OnPersistentActorPostLoad
// 0x0004 (0x0004 - 0x0000)
struct BP_Rocket_Reward_C_OnPersistentActorPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Rocket_Reward_C_OnPersistentActorPostLoad;

}

