#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RocketCollector

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RocketCollector.BP_RocketCollector_C
// 0x0118 (0x03E8 - 0x02D0)
class ABP_RocketCollector_C final : public AVoyageRocketCollectorActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CollectHeight;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 RewardContainerActor;                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageLootItemTables                  RewardLootTables;                                  // 0x02E8(0x0060)(Edit, BlueprintVisible)
	struct FVector                                RewardRadius;                                      // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RewardHeight;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardQueue;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVoyageRocketReward*>            RewardDataAssets;                                  // 0x0370(0x0010)(Edit, BlueprintVisible)
	int32                                         NumPodsSent;                                       // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerLevel;                                       // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TempActors;                                        // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSet<class AActor*>                           PodActors;                                         // 0x0398(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void CollectPod(class AVoyageLazarusPOD* PodActor, class UBP_SpawnRocketReward_C* RewardSpawner);
	void ExecuteUbergraph_BP_RocketCollector(int32 EntryPoint);
	void HasTraits(class AVoyageLazarusPOD* Pod, const TArray<class UVoyageItemMemoryTrait*>& Traits, bool* NewParam);
	void ReceiveBeginPlay();
	void SetupReward(class AActor* RocketActor, class UObject* RewardTarget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RocketCollector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RocketCollector_C")
	}
	static class ABP_RocketCollector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RocketCollector_C>();
	}
};
DUMPER7_ASSERTS_ABP_RocketCollector_C;

}

