#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rocket_Reward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Inventory_Container_Buoy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rocket_Reward.BP_Rocket_Reward_C
// 0x0098 (0x0518 - 0x0480)
class ABP_Rocket_Reward_C final : public ABP_Inventory_Container_Buoy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Rocket_Reward_C;                 // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyageQuestComponent*                  VoyageQuest;                                       // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Flag_Triangle1;                                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Flag_Triangle;                                  // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reward_Capsule_Hinge;                              // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Middle_05;               // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Middle_01;               // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_End;                     // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Middle_02;               // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Middle_03;               // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Middle_04;               // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ladder_01_SM_Ladder_01_Start_02;                // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reward_Capsule_Antenna;                            // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageLocatorComponent*                VoyageLocator;                                     // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Collapse_79303508476DCBFC253E7883C19C945F; // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_79303508476DCBFC253E7883C19C945F; // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bLanded;                                           // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FallingLinearDamping;                              // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CollapseParachuse();
	void CompleteTask();
	void ExecuteUbergraph_BP_Rocket_Reward(int32 EntryPoint);
	void InitialState();
	void OnEnteredWaterDelegate_Event(const struct FSphericalPontoon& Pontoon);
	void OnInventoryChanged_Event();
	void OnLanded();
	void OnPersistentActorPostLoad(int32 Version);
	void ReceiveBeginPlay();
	void Sink();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Rocket_Reward_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Rocket_Reward_C")
	}
	static class ABP_Rocket_Reward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rocket_Reward_C>();
	}
};
DUMPER7_ASSERTS_ABP_Rocket_Reward_C;

}

