#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rocket_Functional

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Rocket_Dummy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rocket_Functional.BP_Rocket_Functional_C
// 0x02F0 (0x0680 - 0x0390)
class ABP_Rocket_Functional_C final : public ABP_Rocket_Dummy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Rocket_Functional_C;             // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      InteriorCapsuleOverlap;                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageRocketStateComponent*            VoyageRocketState;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FairingQueryBox;                                   // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket_01;                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket_03;                       // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePhysicalSnapSocketComponent*     VoyagePhysicalSnapSocket_02;                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView2;                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView1;                           // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView0;                           // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorBox;                                           // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            IO_Door;                                           // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FuelHatchBox_02;                                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            IO_FuelHatch_02;                                   // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FuelHatchBox_03;                                   // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            IO_FuelHatch_03;                                   // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            IO_FuelHatch_01;                                   // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FuelHatchBox_01;                                   // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 VoyageModule_Oxygen;                               // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 VoyageModule_Electricity;                          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 VoyageModule_Methane;                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_HandleAlpha_EDA837FA4CEE8938D853DF8EBDCB0D4F; // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_DepthAlpha_EDA837FA4CEE8938D853DF8EBDCB0D4F; // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_VerticalAlpha_EDA837FA4CEE8938D853DF8EBDCB0D4F; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_EDA837FA4CEE8938D853DF8EBDCB0D4F; // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OpenFuelHatch_01_HatchRotation_E92240A945038C9284024AA876A59683; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OpenFuelHatch_01__Direction_E92240A945038C9284024AA876A59683; // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OpenFuelHatch_01;                               // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OpenFuelHatch_03_HatchRotation_26E6FA0A40A2CFFD88BA808A3BC5540F; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OpenFuelHatch_03__Direction_26E6FA0A40A2CFFD88BA808A3BC5540F; // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OpenFuelHatch_03;                               // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         TL_OpenFuelHatch_02_HatchRotation_6B5418DB4A6C365ED465AAA4542A5886; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_OpenFuelHatch_02__Direction_6B5418DB4A6C365ED465AAA4542A5886; // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_OpenFuelHatch_02;                               // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 DebugText;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class USoundBase*                             FuelHatchOpenSound;                                // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FuelHatchCloseSound;                               // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      FuelHatchSoundAttenuation;                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDoorOpen;                                       // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFuelHatch_01_Open;                              // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFuelHatch_02_Open;                              // 0x04B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFuelHatch_03_Open;                              // 0x04B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             DoorHatchOpenSound;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DoorHatchCloseSound;                               // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundAttenuation*                      DoorSoundAttenuation;                              // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasTop;                                           // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVoyageRocketState                            LaunchState;                                       // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumPodSlots;                                       // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxFuelHatchAngle;                                 // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DefaultDoorLocation;                               // 0x04E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorOpenOffset;                                    // 0x04F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxHandleSpin;                                     // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DoorLockedSound;                                   // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FuelHatchInterruptSound;                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TotalFlightTime;                                   // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ApproachTime;                                      // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnEntryStateChanged;                               // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFuelStateChanged;                                // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCargoChanged;                                    // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSystemsChanged;                                  // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnConnectionsChanged;                              // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<int32, bool>                             OccupiedSlots;                                     // 0x0588(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class USoundBase*>                TMinusSounds;                                      // 0x05D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         RewardDelayInSeconds;                              // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageScheduledActionLogic*            RewardActionLogic;                                 // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        RewardSpawnActivationRadius;                       // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   RocketRewardDisplayBaseName;                       // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnDoLaunchPlayback;                                // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsPlayingLandingMusic;                            // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             RocketLandingMusic;                                // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationLengthOffsetTime;                         // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CatchTime;                                         // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Rocket_Functional_SM_Top_Door_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	EInteractionConditionType CanBeInteractedBy(class AActor* InInteractor, int32 PartId, int32 InteractIndex);
	void CanInteractFuelHatch(int32 Index_0, bool* bCanClose);
	void DoLaunchPlayback();
	void ExecuteUbergraph_BP_Rocket_Functional(int32 EntryPoint);
	void GetActorsInsideRocket(TArray<class AActor*>* OutActors);
	void GetDoorInteractText(class FText* Text);
	void GetFuelHatchInteractText(int32 Index_0, class FText* Text);
	void GetFuelProgress(int32 Index_0, double* Progress);
	bool GetGrabText(class AActor* InInteractor, const class FText& InText, class FText* OutText);
	class UVoyageCrosshairWidgetData* GetInteractCrosshair(class AActor* InInteractor, int32 PartId);
	bool GetInteractIndices(class AActor* InInteractor, TArray<int32>* OutIndices);
	bool GetInteractiveProvidedActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractiveProvidedGrabActions(class APawn* MyCharacter, class USceneComponent* Component, TArray<struct FPlayerInputInterfaceAction>* OutActions);
	bool GetInteractText(class AActor* InInteractor, int32 PartId, int32 InteractIndex, class FText* OutText);
	void GetLazarusPod(class UVoyagePhysicalSnapSocketComponent* Target, class AVoyageLazarusPOD** AsVoyage_Lazarus_POD);
	void GetNumFuelHatches(int32* NumFuelHatches);
	void GetNumOccupiedPodSlots(int32* NumPods);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void GetOwningPlayerState(class AVoyagePlayerState** PlayerState);
	void GetPodSocketComponent(int32 Index_0, class UVoyagePhysicalSnapSocketComponent** Socket);
	bool GetScanText(struct FVoyageScanText* OutText, class APlayerController* InInstigator);
	void HasBeenLaunched(bool* bLaunched);
	void HasPower(bool* bHasPower);
	void InteractAction(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	bool InteractActionPartial(class APawn* MyCharacter, int32 PartId, int32 InteractIndex);
	class UVoyageBaseInventoryComponent* InteractGetInventory(class APawn* MyCharacter, int32 PartId);
	void InteractWithGrab(class APawn* MyCharacter, int32 PartId, EInteractWithGrabReturnValue* OutValue);
	void IsAllFuelHatchesClosed(bool* bAllClosed);
	void IsDoorOpen(bool* bOpen);
	void IsDoorPartId(int32 PartId, bool* bReturn);
	void IsFuelHatchCableAttached(int32 Index_0, bool* bCanClose);
	void IsFuelHatchOpen(int32 Index_0, bool* bOpen);
	void IsHatchPartId(int32 PartId, bool* bReturn);
	void IsPodAttached(int32 Index_0, bool* bAttached);
	void IsSnapSocketPlugged(class UVoyagePhysicalSnapSocketComponent* SnapSocket, bool* bPlugged);
	void MarkHumansLaunched();
	void MarkPodLaunched(int32 Index_0);
	void MoneyWorth();
	void OnAbortLaunchSequence(class UVoyageRocketStateComponent* RocketStateComponent);
	void OnAnimationFinished(bool bFinished);
	void OnCountdownSecondChanged_Event(class UVoyageRocketStateComponent* RocketStateComponent, int32 Remaining);
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnLanded_Event(class UVoyageRocketStateComponent* RocketStateComponent);
	void OnLaunched();
	void OnLaunched_Event(class UVoyageRocketStateComponent* RocketStateComponent);
	void OnModuleElectricityChanged(class UVoyageModuleComponent* Module);
	void OnModuleMethaneChanged(class UVoyageModuleComponent* Module);
	void OnModuleOxygenChanged(class UVoyageModuleComponent* Module);
	void OnModuleValueChanged();
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void OnRequestLaunch_Event(class UVoyageRocketStateComponent* RocketStateComponent);
	void OnRequestLaunchSequence(class UVoyageRocketStateComponent* RocketStateComponent);
	void OnStateCompleted(EVoyageRocketState State);
	void OnStateProgressChanged_Event(class UVoyageRocketStateComponent* RocketStateComponent, EVoyageRocketState CurrentState, const struct FVoyageRocketStateResult& Result);
	void PlayDoorLockedSound();
	void PlayDoorSound(class USoundBase* Sound);
	void PlayerInteraction(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void PlayerInteractionRelease(class APawn* MyCharacter, class UInteractiveObjectComponent* InteractiveObjectComponent);
	void PlayFuelHatchInterruptedSound(int32 Index_0);
	void PlayFuelHatchSound(int32 Index_0, class USoundBase* Sound);
	void QueueReward(class UVoyageScheduledActionLogic* CustomRewardLogic);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetDoorLocation(double Vertical, double Depth, double Handle);
	void SetDoorTimeline(double Time);
	void SetFuelHatchTime_01(double Time);
	void SetFuelHatchTime_02(double Time);
	void SetFuelHatchTime_03(double Time);
	void SetHatchRotation(int32 Index_0, double Alpha);
	void SetupInteractiveState();
	bool ShouldIgnoreVisiblityTrace(class AActor* InInteractor);
	void TickPodSocketState();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void TL_OpenFuelHatch_01__FinishedFunc();
	void TL_OpenFuelHatch_01__UpdateFunc();
	void TL_OpenFuelHatch_02__FinishedFunc();
	void TL_OpenFuelHatch_02__UpdateFunc();
	void TL_OpenFuelHatch_03__FinishedFunc();
	void TL_OpenFuelHatch_03__UpdateFunc();
	void ToggleDoor();
	void ToggleFuelHatch_01();
	void ToggleFuelHatch_02();
	void ToggleFuelHatch_03();
	void ToggleInteractions(EFVoyageInteractType Interact_Type);

	void GetFuelHatchResourceType(int32 Index_0, EModuleResourceType* NewParam) const;
	void GetFuelModuleComponent(int32 Index_0, class UVoyageModuleComponent** Component) const;
	class FName GetOverrideZoneId() const;
	void GetStateComponent(class UVoyageRocketStateComponent** StateComponent) const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Rocket_Functional_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Rocket_Functional_C")
	}
	static class ABP_Rocket_Functional_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rocket_Functional_C>();
	}
};
DUMPER7_ASSERTS_ABP_Rocket_Functional_C;

}

