#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RocketPowerCheck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_RocketPowerCheck.BP_RocketPowerCheck_C.OnExecute
// 0x0180 (0x0180 - 0x0000)
struct BP_RocketPowerCheck_C_OnExecute final
{
public:
	EVoyageRocketState                            InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UVoyageRocketStateComponent*      InRocketStateComponent;                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVoyageRocketStateResult               ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class UVoyageModuleComponent*                 CallFunc_GetMainPowerModuleComponent_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVoyageRocketStateResult               K2Node_MakeStruct_VoyageRocketStateResult;         // 0x0048(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPrimaryResourcePercentage_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedState_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageUnitFormattingArg               K2Node_MakeStruct_VoyageUnitFormattingArg;         // 0x008C(0x0018)(NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPercentageText_ReturnValue;            // 0x00A8(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x00C8(0x0010)(ReferenceParm)
	struct FVoyageRocketStateResult               K2Node_MakeStruct_VoyageRocketStateResult_1;       // 0x00D8(0x0020)()
	struct FVoyageRocketStateResult               K2Node_MakeStruct_VoyageRocketStateResult_2;       // 0x00F8(0x0020)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0138(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array_4;                          // 0x0148(0x0010)(ReferenceParm)
	struct FVoyageRocketStateResult               K2Node_MakeStruct_VoyageRocketStateResult_3;       // 0x0158(0x0020)()
	float                                         K2Node_MakeStruct_Progress_ImplicitCast;           // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPercentageText_InValue_ImplicitCast;   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RocketPowerCheck_C_OnExecute;

}

