#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RequirementInfo

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_RequirementInfo.BP_RequirementInfo_C.BndEvt__BP_RequirementInfo_RequirementMetCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_RequirementInfo_C_BndEvt__BP_RequirementInfo_RequirementMetCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_BndEvt__BP_RequirementInfo_RequirementMetCheckBox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function BP_RequirementInfo.BP_RequirementInfo_C.ExecuteUbergraph_BP_RequirementInfo
// 0x0140 (0x0140 - 0x0000)
struct BP_RequirementInfo_C_ExecuteUbergraph_BP_RequirementInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageModuleComponent*                 K2Node_CustomEvent_Module;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleRuntimeRequirements             CallFunc_Map_Find_Value;                           // 0x0018(0x00A8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleCustomRequirement               CallFunc_GetCustomRequirement_ReturnValue;         // 0x00C8(0x0070)(ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_ExecuteUbergraph_BP_RequirementInfo;

// Function BP_RequirementInfo.BP_RequirementInfo_C.OnModuleRequirementMetChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_RequirementInfo_C_OnModuleRequirementMetChanged final
{
public:
	class UVoyageModuleComponent*                 Module;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_OnModuleRequirementMetChanged;

// Function BP_RequirementInfo.BP_RequirementInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_RequirementInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_PreConstruct;

// Function BP_RequirementInfo.BP_RequirementInfo_C.SetModuleSource
// 0x0030 (0x0030 - 0x0000)
struct BP_RequirementInfo_C_SetModuleSource final
{
public:
	class UVoyageModuleComponent*                 ModuleSource;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 InRequirementKey;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVoyageModuleComponent* Module)> K2Node_CreateDelegate_OutputDelegate;      // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_SetModuleSource;

// Function BP_RequirementInfo.BP_RequirementInfo_C.UpdateText
// 0x0160 (0x0160 - 0x0000)
struct BP_RequirementInfo_C_UpdateText final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0010)()
	TMap<class FString, struct FModuleCustomRequirement> CallFunc_GetCustomRequirements_ReturnValue; // 0x0010(0x0050)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleCustomRequirement               CallFunc_GetCustomRequirement_ReturnValue;         // 0x0068(0x0070)(ContainsInstancedReference)
	struct FModuleCustomRequirement               CallFunc_Map_Find_Value;                           // 0x00D8(0x0070)(ContainsInstancedReference)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0150(0x0010)()
};
DUMPER7_ASSERTS_BP_RequirementInfo_C_UpdateText;

}

