#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SwarmSpawnerActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.GetPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_SwarmSpawnerActor_C_GetPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_GetPersistentActorComponent;

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct BP_SwarmSpawnerActor_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_OnCustomDataSave;

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_SwarmSpawnerActor_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_UserConstructionScript;

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct BP_SwarmSpawnerActor_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_HasAnyChanges;

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_SwarmSpawnerActor_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_HasCustomData;

// Function BP_SwarmSpawnerActor.BP_SwarmSpawnerActor_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct BP_SwarmSpawnerActor_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SwarmSpawnerActor_C_PersistTranform;

}

