#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SKDoor_Master_WithComponents

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SKDoor_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SKDoor_Master_WithComponents.BP_SKDoor_Master_WithComponents_C
// 0x0090 (0x04D8 - 0x0448)
class ABP_SKDoor_Master_WithComponents_C final : public ABP_SKDoor_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SKDoor_Master_WithComponents_C;  // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh_InfoPanel_B;                            // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_InfoPanel_A;                            // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView_B;                          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Keypad_B;                               // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Lever_B;                                // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Wheel_B;                                // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView_A;                          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Keypad_A;                               // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Lever_A;                                // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Wheel_A;                                // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Console_A;                              // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor_Console_B;                              // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        LastButtonTime;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsingSwitch;                                     // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageModuleGenericSwitchActor*        WheelA;                                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVoyageModuleGenericSwitchActor*        WheelB;                                            // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DisabledModuleAlsoDisablesWheels;                  // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_SKDoor_Master_WithComponents_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDisableChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, bool bDisabled);
	void BndEvt__BP_SKDoor_Master_WithComponents_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompPowerStateChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void ExecuteUbergraph_BP_SKDoor_Master_WithComponents(int32 EntryPoint);
	void OnConsoleA_Interact();
	void OnConsoleB_Interact();
	void OnDoorCloseComplete();
	void OnDoorLocked_Event();
	void OnDoorOpenComplete();
	void OnDoorUnlocked_Event();
	void OnSwitchToggleState(class AVoyageModuleGenericSwitchActor* SwitchActor, bool bUpperThreshold);
	void OnWheelASetValue(class AVoyageModuleGenericSwitchActor* SwitchActor, float OldValue, float NewValue);
	void OnWheelBSetValue(class AVoyageModuleGenericSwitchActor* SwitchActor, float OldValue, float NewValue);
	void OnWheelGrab(bool Grabbed);
	void ReceiveBeginPlay();
	void ReleaseWheels(class UPhysicsGrabComponent* PhysicsGrabber, class UPrimitiveComponent* GrabbedComponent);
	void UpdateConsoles();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SKDoor_Master_WithComponents_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SKDoor_Master_WithComponents_C")
	}
	static class ABP_SKDoor_Master_WithComponents_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SKDoor_Master_WithComponents_C>();
	}
};
DUMPER7_ASSERTS_ABP_SKDoor_Master_WithComponents_C;

}

