#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Scan_DL

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Scan_DL.BP_Scan_DL_C.ExecuteUbergraph_BP_Scan_DL
// 0x0038 (0x0038 - 0x0000)
struct BP_Scan_DL_C_ExecuteUbergraph_BP_Scan_DL final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_Source;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Scan_DL_C_ExecuteUbergraph_BP_Scan_DL;

// Function BP_Scan_DL.BP_Scan_DL_C.GetDynamicLayer
// 0x0090 (0x0090 - 0x0000)
struct BP_Scan_DL_C_GetDynamicLayer final
{
public:
	struct FVoyageInGameDynamicLayerArgs          Args;                                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
	struct FVoyageInGameDynamicLayerAlignment     Alignment;                                         // 0x0010(0x0078)(Parm, OutParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Scan_DL_C_GetDynamicLayer;

// Function BP_Scan_DL.BP_Scan_DL_C.SetDynamicLayerSource
// 0x0008 (0x0008 - 0x0000)
struct BP_Scan_DL_C_SetDynamicLayerSource final
{
public:
	class UObject*                                Source_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Scan_DL_C_SetDynamicLayerSource;

// Function BP_Scan_DL.BP_Scan_DL_C.SetDynamicLayerWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_Scan_DL_C_SetDynamicLayerWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Scan_DL_C_SetDynamicLayerWidget;

}

