#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnRocketReward

#include "Basic.hpp"

#include "Voyage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpawnRocketReward.BP_SpawnRocketReward_C
// 0x0080 (0x00B0 - 0x0030)
class UBP_SpawnRocketReward_C final : public UVoyageScheduledActionLogic
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<class UVoyageItem*, int32>               Items;                                             // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	double                                        SpawnHeight;                                       // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpawnRadius;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sweep_Radius;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentYaw;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumLevels;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddRewardLevel(class ABP_Rocket_Reward_Base_C* Reward, class UBP_DA_Rocket_Reward_Level_C* Level);
	void OnRun(class UWorld* World, const struct FVoyageScheduledAction& InAction);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SpawnRocketReward_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SpawnRocketReward_C")
	}
	static class UBP_SpawnRocketReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SpawnRocketReward_C>();
	}
};
DUMPER7_ASSERTS_UBP_SpawnRocketReward_C;

}

