#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SecurityLevelBadge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SecurityLevelBadge.BP_SecurityLevelBadge_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_SecurityLevelBadge_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_PlayerBadge_1;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene1;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AVoyagePlayerState*                     PlayerState;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_SecurityLevelBadge(int32 EntryPoint);
	void PlayerSecurityLevelChanged_Event(class AVoyagePlayerState* InPlayerState, int32 NewLevel, int32 PrevLevel);
	void ReceiveBeginPlay();
	void UpdateSecurityLevel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SecurityLevelBadge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SecurityLevelBadge_C")
	}
	static class ABP_SecurityLevelBadge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SecurityLevelBadge_C>();
	}
};
DUMPER7_ASSERTS_ABP_SecurityLevelBadge_C;

}

