#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillWidget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SkillWidget.BP_SkillWidget_C
// 0x0080 (0x0910 - 0x0890)
class UBP_SkillWidget_C final : public UVoyageSkillWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0890(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameVersionHighlight;                              // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderImage;                                       // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_rim;                                        // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Background;                                 // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           NotAvailableColor;                                 // 0x08C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BitMask;                                           // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AvailableColor;                                    // 0x08D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            GreenColor;                                        // 0x08E4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            RedColor;                                          // 0x08F8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_SkillWidget(int32 EntryPoint);
	void HasAllFlag(EVoyageSkillValidateFlag Flags_0, bool* Return);
	void HasAnyFlag(EVoyageSkillValidateFlag Flags_0, bool* Return);
	void OnSkillUpdated(class APlayerController* InPlayerController, class UVoyageSkill* InSkill);
	void ResetTooltipColors();
	void SetBrightness(float Value);
	void SetCostTooltipColor(const struct FLinearColor& Color);
	void SetLevelReqTooltipColor(const struct FLinearColor& Color);
	void SetMultiply(const struct FLinearColor& Color);
	void SetParentTooltipColor(const struct FLinearColor& Color);
	void SetSaturation(double Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SkillWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SkillWidget_C")
	}
	static class UBP_SkillWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkillWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_SkillWidget_C;

}

