#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkeletalMaterialSlotOverride

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkeletalMaterialSlotOverride.BP_SkeletalMaterialSlotOverride_C
// 0x00B0 (0x00D8 - 0x0028)
class UBP_SkeletalMaterialSlotOverride_C final : public UVoyageBaseEventLogic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EVoyageHolidayType                            Type;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UMaterialInstance*, class FName>   OverrideMaterial;                                  // 0x0038(0x0050)(Edit, BlueprintVisible)
	TMap<class UMaterialInstance*, class FName>   DefaultMaterial;                                   // 0x0088(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_SkeletalMaterialSlotOverride(int32 EntryPoint);
	void OnEventChanged(class AActor* InOwner, EVoyageHolidayType PrevType, EVoyageHolidayType NewType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SkeletalMaterialSlotOverride_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SkeletalMaterialSlotOverride_C")
	}
	static class UBP_SkeletalMaterialSlotOverride_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SkeletalMaterialSlotOverride_C>();
	}
};
DUMPER7_ASSERTS_UBP_SkeletalMaterialSlotOverride_C;

}

