#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SocketHoverVisualizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Voyage_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SocketHoverVisualizer.BP_SocketHoverVisualizer_C
// 0x00F0 (0x03A0 - 0x02B0)
class ABP_SocketHoverVisualizer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       TargetSocketComponent;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<EModuleResourceType, struct FLinearColor> ResourceColor;                                    // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EModuleResourceType, struct FTransform>  ResourceMeshTransform;                             // 0x0320(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              UVScale;                                           // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              UVPanningSpeed;                                    // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Emissive;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Panning;                                           // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SocketHoverVisualizer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetSocket(class UVoyageModuleSocketViewComponent* TargetSocketComponent_0);
	void UpdateParams();
	void UpdateSocketType(EModuleResourceType ResourceType);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SocketHoverVisualizer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SocketHoverVisualizer_C")
	}
	static class ABP_SocketHoverVisualizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SocketHoverVisualizer_C>();
	}
};
DUMPER7_ASSERTS_ABP_SocketHoverVisualizer_C;

}

