#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Show_Interact_Indicators_For_Custom_Requirements

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Show_Interact_Indicators_For_Custom_Requirements.BP_Show_Interact_Indicators_For_Custom_Requirements_C
// 0x0088 (0x0148 - 0x00C0)
class UBP_Show_Interact_Indicators_For_Custom_Requirements_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UVoyageModuleWidgetComponent*>   Widgets;                                           // 0x00C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UVoyageModuleComponent*                 Module;                                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UBP_Interact_Indicator_C*> WidgetsMap;                                 // 0x00E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          CheckPower;                                        // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Visibility_Range_Override;                     // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Visibility_Range_Override;                         // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyWidgets();
	void ExecuteUbergraph_BP_Show_Interact_Indicators_For_Custom_Requirements(int32 EntryPoint);
	void OnCustomRequirementsChanged_Event(class UVoyageModuleComponent* Module_0);
	void OnModulePowerStateChanged_Event(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Show_Interact_Indicators_For_Custom_Requirements_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Show_Interact_Indicators_For_Custom_Requirements_C")
	}
	static class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Show_Interact_Indicators_For_Custom_Requirements_C>();
	}
};
DUMPER7_ASSERTS_UBP_Show_Interact_Indicators_For_Custom_Requirements_C;

}

