#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SUModule_Battery

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.BndEvt__BP_SUModule_Battery_ModuleComponent_K2Node_ComponentBoundEvent_1_VoyageModuleCompDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SUModule_Battery_C_BndEvt__BP_SUModule_Battery_ModuleComponent_K2Node_ComponentBoundEvent_1_VoyageModuleCompDelegate__DelegateSignature final
{
public:
	class UVoyageModuleComponent*                 Module;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_BndEvt__BP_SUModule_Battery_ModuleComponent_K2Node_ComponentBoundEvent_1_VoyageModuleCompDelegate__DelegateSignature;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.DisconnectCable
// 0x0010 (0x0010 - 0x0000)
struct BP_SUModule_Battery_C_DisconnectCable final
{
public:
	class AModulesConnectCable*                   CallFunc_GetCableFromSocket_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_DisconnectCable;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.ExecuteUbergraph_BP_SUModule_Battery
// 0x0200 (0x0200 - 0x0000)
struct BP_SUModule_Battery_C_ExecuteUbergraph_BP_SUModule_Battery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_2;                          // 0x0008(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_2;                               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo_1;                          // 0x00A8(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path_1;                               // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVoyageConnectedEventInfo              K2Node_Event_EventInfo;                            // 0x0148(0x0090)(ConstParm)
	class FString                                 K2Node_Event_Path;                                 // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 K2Node_ComponentBoundEvent_Module;                 // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue;            // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentSubsystem*             CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_ExecuteUbergraph_BP_SUModule_Battery;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.OnPostApplyProperties
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SUModule_Battery_C_OnPostApplyProperties final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_OnPostApplyProperties;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.OnPostSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SUModule_Battery_C_OnPostSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_OnPostSpawnConnectedActor;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.OnPreSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SUModule_Battery_C_OnPreSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Path;                                              // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_OnPreSpawnConnectedActor;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.SpawnEffects
// 0x0040 (0x0040 - 0x0000)
struct BP_SUModule_Battery_C_SpawnEffects final
{
public:
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_SpawnEffects;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.SpawnItem
// 0x0170 (0x0170 - 0x0000)
struct BP_SUModule_Battery_C_SpawnItem final
{
public:
	struct FVoyageItemSpawnSettings               K2Node_MakeStruct_VoyageItemSpawnSettings;         // 0x0000(0x0050)(NoDestructor)
	struct FVoyageItemData                        K2Node_MakeStruct_VoyageItemData;                  // 0x0050(0x0078)()
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_GetActorWorld_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVoyageItem>             CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0138(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SpawnActorForItem_ReturnValue;            // 0x0160(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_SpawnItem;

// Function BP_SUModule_Battery.BP_SUModule_Battery_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_SUModule_Battery_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SUModule_Battery_C_UserConstructionScript;

}

