#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Terminal_System_App

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Terminal_System_App.BP_Terminal_System_App_C.Boot
// 0x05F8 (0x05F8 - 0x0000)
struct BP_Terminal_System_App_C_Boot final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageTerminalAppData                 ReturnValue;                                       // 0x0008(0x00A0)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0158(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0168(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0208(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0218(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0228(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0270(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x02B8(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x02C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0320(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0368(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x0378(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0388(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x03D0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0418(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0428(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0438(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0480(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_11;           // 0x0490(0x0010)()
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x04A0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_11;           // 0x04B0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_12;           // 0x04F8(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0508(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_13;           // 0x0518(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0528(0x0010)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0538(0x0010)()
	TArray<class UVoyageTerminalCommandData*>     K2Node_MakeArray_Array_3;                          // 0x0548(0x0010)(ReferenceParm)
	struct FVoyageTerminalAppData                 K2Node_MakeStruct_VoyageTerminalAppData;           // 0x0558(0x00A0)()
};
DUMPER7_ASSERTS_BP_Terminal_System_App_C_Boot;

// Function BP_Terminal_System_App.BP_Terminal_System_App_C.GetDynamicCommandsData
// 0x0040 (0x0040 - 0x0000)
struct BP_Terminal_System_App_C_GetDynamicCommandsData final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVoyageTerminalCommand>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	class UVoyageModuleComponent*                 CallFunc_GetModuleSource_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageModuleTerminalActor*             K2Node_DynamicCast_AsVoyage_Module_Terminal_Actor; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Terminal_System_App_C_GetDynamicCommandsData;

// Function BP_Terminal_System_App.BP_Terminal_System_App_C.Shutdown
// 0x0020 (0x0020 - 0x0000)
struct BP_Terminal_System_App_C_Shutdown final
{
public:
	TArray<class FText>                           OutLines;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_Terminal_System_App_C_Shutdown;

// Function BP_Terminal_System_App.BP_Terminal_System_App_C.TickApp
// 0x0038 (0x0038 - 0x0000)
struct BP_Terminal_System_App_C_TickApp final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageTerminalAppTickData             ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	struct FVoyageTerminalAppTickData             K2Node_MakeStruct_VoyageTerminalAppTickData;       // 0x0020(0x0018)()
};
DUMPER7_ASSERTS_BP_Terminal_System_App_C_TickApp;

}

