#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Terminal_Message_App

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Terminal_Message_App.BP_Terminal_Message_App_C.Boot
// 0x0148 (0x0148 - 0x0000)
struct BP_Terminal_Message_App_C_Boot final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageTerminalAppData                 ReturnValue;                                       // 0x0008(0x00A0)(Parm, OutParm, ReturnParm)
	struct FVoyageTerminalAppData                 K2Node_MakeStruct_VoyageTerminalAppData;           // 0x00A8(0x00A0)()
};
DUMPER7_ASSERTS_BP_Terminal_Message_App_C_Boot;

// Function BP_Terminal_Message_App.BP_Terminal_Message_App_C.CloseMessageApp
// 0x0001 (0x0001 - 0x0000)
struct BP_Terminal_Message_App_C_CloseMessageApp final
{
public:
	bool                                          CallFunc_CloseByName_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Terminal_Message_App_C_CloseMessageApp;

// Function BP_Terminal_Message_App.BP_Terminal_Message_App_C.Shutdown
// 0x0010 (0x0010 - 0x0000)
struct BP_Terminal_Message_App_C_Shutdown final
{
public:
	TArray<class FText>                           OutLines;                                          // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Terminal_Message_App_C_Shutdown;

// Function BP_Terminal_Message_App.BP_Terminal_Message_App_C.TickApp
// 0x0090 (0x0090 - 0x0000)
struct BP_Terminal_Message_App_C_TickApp final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageTerminalAppTickData             ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageTerminalAppTickData             K2Node_MakeStruct_VoyageTerminalAppTickData;       // 0x0078(0x0018)()
};
DUMPER7_ASSERTS_BP_Terminal_Message_App_C_TickApp;

}

