#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeleportDestination_Actor

#include "Basic.hpp"

#include "TeleportLocationCategory_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeleportDestination_Actor.BP_TeleportDestination_Actor_C
// 0x0030 (0x02E0 - 0x02B0)
class ABP_TeleportDestination_Actor_C final : public AActor
{
public:
	class UArrowComponent*                        ForwardArrow;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 LocationName;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ETeleportLocationCategory                     LocationCategory;                                  // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TeleportDestination_Actor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TeleportDestination_Actor_C")
	}
	static class ABP_TeleportDestination_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TeleportDestination_Actor_C>();
	}
};
DUMPER7_ASSERTS_ABP_TeleportDestination_Actor_C;

}

