#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Terminal_Quest_App

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Terminal_Quest_App.BP_Terminal_Quest_App_C.Boot
// 0x0168 (0x0168 - 0x0000)
struct BP_Terminal_Quest_App_C_Boot final
{
public:
	class UObject*                                DataObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVoyageTerminalAppData                 ReturnValue;                                       // 0x0008(0x00A0)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0010)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00B8(0x0010)()
	struct FVoyageTerminalAppData                 K2Node_MakeStruct_VoyageTerminalAppData;           // 0x00C8(0x00A0)()
};
DUMPER7_ASSERTS_BP_Terminal_Quest_App_C_Boot;

// Function BP_Terminal_Quest_App.BP_Terminal_Quest_App_C.Shutdown
// 0x0010 (0x0010 - 0x0000)
struct BP_Terminal_Quest_App_C_Shutdown final
{
public:
	TArray<class FText>                           OutLines;                                          // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_Terminal_Quest_App_C_Shutdown;

// Function BP_Terminal_Quest_App.BP_Terminal_Quest_App_C.TickApp
// 0x0058 (0x0058 - 0x0000)
struct BP_Terminal_Quest_App_C_TickApp final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageTerminalAppTickData             ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	TArray<class FText>                           RandomQuestions;                                   // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	struct FVoyageTerminalAppTickData             K2Node_MakeStruct_VoyageTerminalAppTickData;       // 0x0040(0x0018)()
};
DUMPER7_ASSERTS_BP_Terminal_Quest_App_C_TickApp;

}

