#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Uplink_Tower_V2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Uplink_Tower_V2.BP_Uplink_Tower_V2_C
// 0x01B0 (0x04C0 - 0x0310)
class ABP_Uplink_Tower_V2_C final : public AVoyageModuleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ResourceMeter;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorScreen;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Show_Interact_Indicators_For_Custom_Requirements_C* BP_Show_Interact_Indicators_For_Custom_Requirements; // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   UplinkActivationSwitch;                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleSocketViewComponent*       VoyageModuleSocketView;                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PowerCabinet;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Root;                                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         LocatorNames;                                      // 0x0358(0x0010)(Edit, BlueprintVisible)
	bool                                          UplinkCharged;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageModuleGenericSwitchActor*        Switch;                                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnUplinkActivation;                                // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Delay;                                             // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELocatorFlags>                         Active_Locator_Flag;                               // 0x0390(0x0010)(Edit, BlueprintVisible)
	class UVoyageQuest*                           PowerFullQuest;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         PowerFullTaskIndex;                                // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageQuest*                           UplinkActivatedCompleteQuest;                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         UplinkActivatedCompleteTaskIndex;                  // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRadiusDetection;                                // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     LocatorClass;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        LocatorDetectionRadius;                            // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocatorDetectionOffset;                            // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectLocatorOnReveal;                             // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EModuleResourceType, double>             Consumption;                                       // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UplinkActivated;                                   // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RepairPrefix;                                      // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RequirementColor;                                  // 0x0458(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RepairedSuffix;                                    // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVoyageModuleComponent*                 ConnectedModule;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCharging;                                        // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreviousAmount;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChargingRequiresRepair;                            // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RadarMap_Crafted_C*                 MapModuleActor;                                    // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FText                                   ChargeText;                                        // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AutoTurnOff;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AudioActivate();
	void AudioChargingFull();
	void AudioStartCharging();
	void AudioStopCharging();
	void AudioUpdateChargeLevel();
	void BndEvt__BP_Uplink_Tower_ModuleComponent_K2Node_ComponentBoundEvent_0_VoyageModuleCompDelegate__DelegateSignature(class UVoyageModuleComponent* Module);
	void BndEvt__BP_Uplink_Tower_ModuleComponent_K2Node_ComponentBoundEvent_1_VoyageModuleCompPowerStateChanged__DelegateSignature(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void BndEvt__BP_Uplink_Tower_V2_ModuleComponent_K2Node_ComponentBoundEvent_2_VoyageModuleCompStateChanged__DelegateSignature(class UVoyageModuleComponent* Module, EVoyageModuleState OldState, EVoyageModuleState NewState);
	void BndEvt__BP_Uplink_Tower_V2_VoyageModuleSocketView_K2Node_ComponentBoundEvent_2_VoyageSocketConnectionDelegate__DelegateSignature(bool bSocketConnection);
	void ChargeUp();
	void CustomEvent(class UVoyageModuleComponent* Module);
	void ExecuteUbergraph_BP_Uplink_Tower_V2(int32 EntryPoint);
	void OnActivationSwitchToggleState(class AVoyageModuleGenericSwitchActor* SwitchActor, bool bUpperThreshold);
	void OnModuleCapacityFull(class UVoyageModuleComponent* Module);
	void OnPersistentActorPostLoad(int32 Version);
	void OnUplinkCharged();
	void ReceiveBeginPlay();
	void RequiresRepairs(bool* StillNeedsRepair);
	void RevealLocatorEvent(class UVoyageLocatorComponent* LocatorComponent);
	void RevealLocatorsByName();
	void RevealLocatorsInRadius();
	void StartCharging();
	void StopCharging();
	void UpdateActivationSwitchVisual(double EmissiveMultiplier, const struct FVector& EmissiveStateMultiplier);
	void UpdateSocketConnection();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Uplink_Tower_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Uplink_Tower_V2_C")
	}
	static class ABP_Uplink_Tower_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Uplink_Tower_V2_C>();
	}
};
DUMPER7_ASSERTS_ABP_Uplink_Tower_V2_C;

}

