#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnderWaterPostProcessMesh_Voyage

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnderWaterPostProcessMesh_Voyage.BP_UnderWaterPostProcessMesh_Voyage_C
// 0x0030 (0x0330 - 0x0300)
class ABP_UnderWaterPostProcessMesh_Voyage_C final : public AVoyageUnderWaterPostProcessMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Weather_C*               UltraDynamicWeather;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FilmGrain;                                         // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EditorTick();
	void ExecuteUbergraph_BP_UnderWaterPostProcessMesh_Voyage(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UnderWaterPostProcessMesh_Voyage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UnderWaterPostProcessMesh_Voyage_C")
	}
	static class ABP_UnderWaterPostProcessMesh_Voyage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UnderWaterPostProcessMesh_Voyage_C>();
	}
};
DUMPER7_ASSERTS_ABP_UnderWaterPostProcessMesh_Voyage_C;

}

