#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageLocatorActor

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VoyageLocatorActor.BP_VoyageLocatorActor_C
// 0x0050 (0x0300 - 0x02B0)
class ABP_VoyageLocatorActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVoyageLocatorComponent*                MapLocatorComponent;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyageLocatorComponent*                LocatorComponent;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       ArrivalRadiusSphere;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       VisibilityMaxRadiusSphere;                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       VisibilityMinRadiusSphere;                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugRadius;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDiscovered;                                       // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelectedButUndiscovered;                          // 0x02FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELocatorFlags                                 ActiveLocatorFlag;                                 // 0x02FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginPlayOverlap();
	void BndEvt__BP_VoyageLocatorActor_ArrivalRadiusSphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_VoyageLocatorActor(int32 EntryPoint);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void Register();
	void Select();
	void UserConstructionScript();

	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageLocatorActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageLocatorActor_C")
	}
	static class ABP_VoyageLocatorActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VoyageLocatorActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_VoyageLocatorActor_C;

}

