#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyagePreparePlayMenu

#include "Basic.hpp"

#include "Voyage_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VoyagePreparePlayMenu.BP_VoyagePreparePlayMenu_C
// 0x0038 (0x0720 - 0x06E8)
class UBP_VoyagePreparePlayMenu_C final : public UVoyagePreparePlayMenuWidget
{
public:
	class UBP_VoyageSaveGameSlotsWidget_C*        UnknownSaveGameSlotWidget;                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageSaveGameSlotsWidget_C*        UnknownAutoSaveGameSlotWidget;                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageSaveGameSlotsWidget_C*        SaveGameSlotWidget;                                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageMenuBackground_C*             BP_VoyageMenuBackground;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CloudSaveGameNotificationWidget_C*  BP_CloudSaveGameNotificationWidget;                // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ButtonInfo_Horizontal_Container_C*  BP_ButtonInfo_Horizontal_Container;                // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageSaveGameSlotsWidget_C*        AutoSaveGameSlotWidget;                            // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyagePreparePlayMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyagePreparePlayMenu_C")
	}
	static class UBP_VoyagePreparePlayMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyagePreparePlayMenu_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyagePreparePlayMenu_C;

}

