#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageEffectSubsystem

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VoyageEffectSubsystem.BP_VoyageEffectSubsystem_C
// 0x0040 (0x07B0 - 0x0770)
class UBP_VoyageEffectSubsystem_C final : public UVoyageEffectSubsystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundSubmix*                           Mix_World_Sends;                                   // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundSubmix*                           Mix_Underwater_Sends;                              // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundSubmix*                           Mix_World;                                         // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DefaultFabricatorFactory;                          // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DefaultRecyclerFactory;                            // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DamageOverlayMaterial;                             // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool CanFabricate(class AActor* Owner, class UVoyageItem* ItemOrPattern, const struct FTransform& Transform, class UPrimitiveComponent* AttachTo, TSubclassOf<class UVoyageFabricatorFactory> FabricatorFactory);
	bool CanRecycle(class AActor* Target, class UVoyageBaseInventoryComponent* OutputInventory, class AController* Controller, TSubclassOf<class UVoyageRecyclerFactory> RecyclerFactory);
	bool CheckOpaqueOrMasked(class UPrimitiveComponent* Mesh);
	void ExecuteUbergraph_BP_VoyageEffectSubsystem(int32 EntryPoint);
	class AVoyageFabricator* Fabricate(class AActor* Owner, class UVoyageItem* ItemOrPattern, const struct FTransform& Transform, class UPrimitiveComponent* AttachTo, TSubclassOf<class UVoyageFabricatorFactory> FabricatorFactory);
	void GetFabricatorFactory(class UClass* Class_0, class UVoyageFabricatorFactory** AsVoyage_Fabricator_Factory);
	void GetRecyclerFactory(class UClass* Class_0, class UVoyageRecyclerFactory** AsVoyage_Recycler_Factory);
	void HasDamageOverlay(class UMeshComponent* NewParam, bool* Ret);
	void OnCameraEnterWater(float Velocity);
	void OnCameraExitWater(float Velocity);
	void OnDestructibleActorDestruction(class AActor* Actor);
	void OnTransferItems(class UVoyageBaseInventoryComponent* SourceInventory, class UVoyageBaseInventoryComponent* TargetInventory, class UVoyageItem* Item, int32 Count);
	class AActor* Recycle(class AActor* Target, class UVoyageBaseInventoryComponent* OutputInventory, class AController* Controller, TSubclassOf<class UVoyageRecyclerFactory> RecyclerFactory);
	bool SetActorDamageOverlayEnabled(class AActor* Actor, bool bEnable);
	void SetupDamageOverlay(class UObject* Actor, class UMeshComponent* SourceComp);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageEffectSubsystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageEffectSubsystem_C")
	}
	static class UBP_VoyageEffectSubsystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyageEffectSubsystem_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyageEffectSubsystem_C;

}

