#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageAttachmentSelector

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VoyageAttachmentSelector.BP_VoyageAttachmentSelector_C
// 0x0028 (0x08A8 - 0x0880)
class UBP_VoyageAttachmentSelector_C final : public UVoyageItemSelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InventoryFilterByAttachmentSlot_C*  FilterLogicRef;                                    // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_InventoryFilterCompatibleMagazine_C* MagazineLogicRef;                                 // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EWeaponAttachmentType                         AttachmentType;                                    // 0x0898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyagePlayerController*                PC;                                                // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_VoyageAttachmentSelector(int32 EntryPoint);
	void PreInventorySource(class AVoyagePlayerController* PC_0, class UVoyageFocusableWidget* InOwningWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageAttachmentSelector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageAttachmentSelector_C")
	}
	static class UBP_VoyageAttachmentSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyageAttachmentSelector_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyageAttachmentSelector_C;

}

