#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageEnhancerWidget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VoyageEnhancerWidget.BP_VoyageEnhancerWidget_C
// 0x0038 (0x08B8 - 0x0880)
class UBP_VoyageEnhancerWidget_C final : public UVoyageEnhancerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GameVersionHighlight;                              // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           NotAvailableColor;                                 // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BitMask;                                           // 0x08A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AvailableColor;                                    // 0x08A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VoyageEnhancerWidget(int32 EntryPoint);
	void HasAllFlag(EVoyageSkillValidateFlag Flags_0, bool* Return);
	void HasAnyFlag(EVoyageSkillValidateFlag Flags_0, bool* Return);
	void OnEnhancerUpdated(class APlayerController* InPlayerController, class UVoyageEnhancer* InEnhancer, const struct FVoyageEnhancerData& InData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageEnhancerWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageEnhancerWidget_C")
	}
	static class UBP_VoyageEnhancerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyageEnhancerWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyageEnhancerWidget_C;

}

