#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageIngameCraneHud

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VoyageIngameCraneHud.BP_VoyageIngameCraneHud_C
// 0x0048 (0x0670 - 0x0628)
class UBP_VoyageIngameCraneHud_C final : public UVoyageInGameWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CompassHUD_C*                      WBP_CompassHUD;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_HudQuestList_C*                     QuestListWidget;                                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoPowerOverlay;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_DropWidgetArea_C*                   ItemDropArea;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_VoyageTaskListWidget_C*             BP_VoyageTaskListWidget;                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SaveGameIndicator_C*                BP_SaveGameIndicator;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LocatorHudWidget_C*                 BP_LocatorHudWidget;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ButtonInfo_Vertical_Container_C*    BP_ButtonInfoContainer_Crane;                      // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BP_VoyageIngameCraneHud(int32 EntryPoint);
	void GetModuleOfClass(class AVoyageBoatPawn* Parent, class UClass* Class_0, TSoftObjectPtr<class UObject>* Output);
	void OnPowerStateChanged(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void UpdatePowerOverlay(bool HasPower);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageIngameCraneHud_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageIngameCraneHud_C")
	}
	static class UBP_VoyageIngameCraneHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyageIngameCraneHud_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyageIngameCraneHud_C;

}

