#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoyageDemoEnd

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_VoyageDemoEnd.BP_VoyageDemoEnd_C
// 0x0068 (0x0700 - 0x0698)
class UBP_VoyageDemoEnd_C final : public UVoyageDemoEndWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Video;                                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoImage;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_ButtonInfo_Horizontal_Container_C*  BP_ButtonInfo_Horizontal_Container;                // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopAnim;                                          // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MusicRef;                                          // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMediaSource>            MediaSourceSoft;                                   // 0x06C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMediaSource*                           LoadedMediaSource;                                 // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BP_VoyageDemoEnd(int32 EntryPoint);
	bool OnHandleNavigationInput(EUINavigationInputType Type);
	void OnLoaded_4A1AF8A24E5ABC168B1262B762BD84F9(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoyageDemoEnd_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoyageDemoEnd_C")
	}
	static class UBP_VoyageDemoEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoyageDemoEnd_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoyageDemoEnd_C;

}

