#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Grenade_Base

#include "Basic.hpp"

#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Grenade_Base.BP_Weapon_Grenade_Base_C.DelayItemConsume
// 0x0188 (0x0188 - 0x0000)
struct BP_Weapon_Grenade_Base_C_DelayItemConsume final
{
public:
	struct FVoyageAbilityDataStruct               InAbilityDataStruct;                               // 0x0000(0x0180)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Force;                                             // 0x0180(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_Grenade_Base_C_DelayItemConsume;

// Function BP_Weapon_Grenade_Base.BP_Weapon_Grenade_Base_C.ExecuteUbergraph_BP_Weapon_Grenade_Base
// 0x0190 (0x0190 - 0x0000)
struct BP_Weapon_Grenade_Base_C_ExecuteUbergraph_BP_Weapon_Grenade_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageAbilityDataStruct               K2Node_Event_InAbilityDataStruct;                  // 0x0008(0x0180)(ConstParm)
	bool                                          K2Node_Event_Force;                                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_Grenade_Base_C_ExecuteUbergraph_BP_Weapon_Grenade_Base;

// Function BP_Weapon_Grenade_Base.BP_Weapon_Grenade_Base_C.OnCustomDataSave
// 0x0020 (0x0020 - 0x0000)
struct BP_Weapon_Grenade_Base_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_Weapon_Grenade_Base_C_OnCustomDataSave;

// Function BP_Weapon_Grenade_Base.BP_Weapon_Grenade_Base_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_Grenade_Base_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_Grenade_Base_C_HasCustomData;

}

