#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponAbility_Melee

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponAbility_Melee.BP_WeaponAbility_Melee_C
// 0x0250 (0x0780 - 0x0530)
class alignas(0x10) UBP_WeaponAbility_Melee_C : public UWeaponAbilityMeleeComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Impulse;                                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mass;                                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVoyageImpactEffect                    Impact_Effect;                                     // 0x0548(0x0230)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UVoyagePhysicalMaterial*                DefaultPhysicalMaterial;                           // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponAbility_Melee(int32 EntryPoint);
	void GetPhysicalMaterial(const struct FHitResult& Hit, class UVoyagePhysicalMaterial** AsVoyage_Physical_Material);
	void OnPerformAttack(const struct FVoyageAttack& InAttackInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponAbility_Melee_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponAbility_Melee_C")
	}
	static class UBP_WeaponAbility_Melee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeaponAbility_Melee_C>();
	}
};
DUMPER7_ASSERTS_UBP_WeaponAbility_Melee_C;

}

