#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponAttachment_ResourceDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponAttachment_ResourceDisplay.BP_WeaponAttachment_ResourceDisplay_C.ExecuteUbergraph_BP_WeaponAttachment_ResourceDisplay
// 0x0038 (0x0038 - 0x0000)
struct BP_WeaponAttachment_ResourceDisplay_C_ExecuteUbergraph_BP_WeaponAttachment_ResourceDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeapon*                          K2Node_DynamicCast_AsVoyage_Weapon;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_WeaponWidget_C*                     K2Node_DynamicCast_AsBP_Weapon_Widget;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_WeaponAttachment_ResourceDisplay_C_ExecuteUbergraph_BP_WeaponAttachment_ResourceDisplay;

}

