#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_ContextWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.ExecuteUbergraph_BP_Weapon_ContextWidget
// 0x0368 (0x0368 - 0x0000)
struct BP_Weapon_ContextWidget_C_ExecuteUbergraph_BP_Weapon_ContextWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic, int32 CurrentAmount)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemWeaponMagazine* NewMagazine)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class AVoyageEquipmentActor*            K2Node_Event_InEquipmentActor;                     // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeapon*                          K2Node_DynamicCast_AsVoyage_Weapon;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_Controller;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractiveObjectComponent*            K2Node_Event_InteractiveObjectComponent;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTextChangedOnly;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoyagePointerActionArguments>  K2Node_Event_ActiveActions;                        // 0x0058(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, EVoyageButtonInfoState> K2Node_MakeMap_Map;                            // 0x0070(0x0050)(ConstParm)
	TArray<class UInputAction*>                   K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_AddOverrideState_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveOverrideState_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemAmmo* NewAmmo, int32 CurrentAmount, int32 MaxAmount)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAnimate;                       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AController* Controller)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageItem*                            CallFunc_GetEquipmentItem_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemHandEquipment*               K2Node_DynamicCast_AsVoyage_Item_Hand_Equipment;   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemAmmo* NewAmmo)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AVoyageWeaponBallistic* WeaponBallistic)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageWeaponBallistic*                 K2Node_DynamicCast_AsVoyage_Weapon_Ballistic;      // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageItemWeaponMagazine*              CallFunc_GetAttachedWeaponMagazine_ReturnValue;    // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageItemAmmo*                        CallFunc_GetCurrentAmmo_ReturnValue;               // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0200(0x0010)()
	class UVoyageItemWeaponMagazine*              CallFunc_GetAttachedWeaponMagazine_ReturnValue_1;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalAvailableAmmo_ReturnValue;        // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentAmmoAmount_ReturnValue;         // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0238(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0280(0x0048)(HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic_5;              // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02E0(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x02F0(0x0010)()
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic_4;              // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic_3;              // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemAmmo*                        K2Node_CustomEvent_NewAmmo_1;                      // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic_2;              // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemAmmo*                        K2Node_CustomEvent_NewAmmo;                        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentAmount_1;                // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxAmount;                      // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic_1;              // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentAmount;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVoyageWeaponBallistic*                 K2Node_CustomEvent_WeaponBallistic;                // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemWeaponMagazine*              K2Node_CustomEvent_NewMagazine;                    // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0350(0x0014)(NoDestructor)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_ExecuteUbergraph_BP_Weapon_ContextWidget;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnAmmoChangedDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnAmmoChangedDelegate_Event_0 final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemAmmo*                        NewAmmo;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnAmmoChangedDelegate_Event_0;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnAmmoCountChangedDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnAmmoCountChangedDelegate_Event_0 final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmount;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnAmmoCountChangedDelegate_Event_0;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnAmmoMaxCountChangedDelegate_Event
// 0x0018 (0x0018 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnAmmoMaxCountChangedDelegate_Event final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemAmmo*                        NewAmmo;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmount;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAmount;                                         // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnAmmoMaxCountChangedDelegate_Event;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnEquipmentPostActivation_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnEquipmentPostActivation_Event final
{
public:
	class AController*                            Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnEquipmentPostActivation_Event;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnMagazineChangedDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnMagazineChangedDelegate_Event_0 final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageItemWeaponMagazine*              NewMagazine;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnMagazineChangedDelegate_Event_0;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnPointerHoverChanged
// 0x0020 (0x0020 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnPointerHoverChanged final
{
public:
	class UInteractiveObjectComponent*            InteractiveObjectComponent;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bTextChangedOnly;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoyagePointerActionArguments>  ActiveActions;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnPointerHoverChanged;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnReloadCompletedDelegate_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnReloadCompletedDelegate_Event_0 final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnReloadCompletedDelegate_Event_0;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnReloadStartedDelegate_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnReloadStartedDelegate_Event_0 final
{
public:
	class AVoyageWeaponBallistic*                 WeaponBallistic;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnReloadStartedDelegate_Event_0;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.OnSetEquipmentActor
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_ContextWidget_C_OnSetEquipmentActor final
{
public:
	const class AVoyageEquipmentActor*            InEquipmentActor;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_OnSetEquipmentActor;

// Function BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C.UpdateAmmoAmount
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_ContextWidget_C_UpdateAmmoAmount final
{
public:
	bool                                          bAnimate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Weapon_ContextWidget_C_UpdateAmmoAmount;

}

