#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Ability_Throw

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Ability_Throw.BP_Weapon_Ability_Throw_C
// 0x00A0 (0x05C0 - 0x0520)
class alignas(0x10) UBP_Weapon_Ability_Throw_C final : public UWeaponAbilityComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsThrowing;                                       // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Charge;                                            // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxForce;                                          // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Force;                                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Predicition;                                       // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class UInputAction*>              Ability_Index_To_Input_Action;                     // 0x0550(0x0050)(Edit, BlueprintVisible)
	struct FVector                                Direction;                                         // 0x05A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TossThreshold;                                     // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbilityCompleted(const struct FVoyageInputActionInstance& InputAction, class FText* Text);
	void AbilityStarted(const struct FVoyageInputActionInstance& InputAction, class FText* Text);
	void ApplyThrowForce(class AActor* Actor, const struct FVector& Direction_0, double Charge_0, const struct FVector& Velocity);
	void CalculateForce(double Charge_0, double MassScalar, double* Force_0);
	void DrawPrediction();
	void ExecuteUbergraph_BP_Weapon_Ability_Throw(int32 EntryPoint);
	void GetChargeAnimation(double ChargeAmount, class UAnimMontage** NewParam);
	void GetDirection(class AController* Instigator, const struct FVoyageEquipmentAbilityActivationArgs& EquipmentAbilityArgs, struct FVector* OutDirection);
	void GetInstigatorVelocity(class AController* Instigator, struct FVector* Velocity);
	void GetOwningCharacter(class AVoyageCharacter** Character);
	void GetOwningCharacterAnimIntance(class AVoyageCharacter* Character, class UAnimInstance** AnimInstance);
	TArray<struct FPlayerInputInterfaceAction> GetProvidedActionsBP();
	void GetRootComponent(class USceneComponent** Component);
	void GetThrowAnimation(class UAnimMontage** NewParam);
	void OnAbilityActivated(const struct FVoyageEquipmentAbilityActivationArgs& InArgs);
	void OnAbilityCompleted();
	void OnAbilityStarted();
	void OnPlayActivationSFX();
	void PlayCharacterMontage(class UAnimMontage* MontageToPlay);
	void SpawnThrownActor(class AController* InstigatorController, class AActor* InstigatorActor, class AActor** Actor);
	void UpdatePrediction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_Ability_Throw_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_Ability_Throw_C")
	}
	static class UBP_Weapon_Ability_Throw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Weapon_Ability_Throw_C>();
	}
};
DUMPER7_ASSERTS_UBP_Weapon_Ability_Throw_C;

}

