#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WidgetFocusCamera

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WidgetFocusCamera.BP_WidgetFocusCamera_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_WidgetFocusCamera_C final : public AActor
{
public:
	class UPostProcessComponent*                  PostProcess;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetInteractionComponent*            WidgetInteraction;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WidgetFocusCamera_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WidgetFocusCamera_C")
	}
	static class ABP_WidgetFocusCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WidgetFocusCamera_C>();
	}
};
DUMPER7_ASSERTS_ABP_WidgetFocusCamera_C;

}

