#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponResourceWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_WeaponResourceWidget.BP_WeaponResourceWidget_C
// 0x0050 (0x0378 - 0x0328)
class UBP_WeaponResourceWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MainTB;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       UpdateTextAnim;                                    // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DisconnectedTintColor;                             // 0x0340(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            ConnectedTintColor;                                // 0x0354(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AVoyageWeaponResource*                  As_Voyage_Weapon;                                  // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWeaponAbilityComponent*                AbilityComponent;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponResourceWidget(int32 EntryPoint);
	void OnModuleValueChanged_Event(class UVoyageModuleComponent* Module);
	void SetEquipmentSource(class AVoyageEquipmentActor* InEquipmentActor);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponResourceWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponResourceWidget_C")
	}
	static class UBP_WeaponResourceWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeaponResourceWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_WeaponResourceWidget_C;

}

