#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherVolumeInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_WeatherVolumeInfo.BP_WeatherVolumeInfo
// 0x0050 (0x0050 - 0x0000)
struct FBP_WeatherVolumeInfo final
{
public:
	class UClass*                                 WeatherVolumeActor_2_67DFA11A43CB5801C9BA4CA8B7E90F91; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageWeatherPreset*                   WeatherPreset_23_F4330F404DE49D40C6A624BD07C3DDDE; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SpawnChance_5_D432E7D7420B6EBBF5AC18A1AD22A868;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            Radius_19_8079F2694D0E6EB7E3598E8BC67F48EA;        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            WeatherLifeTime_12_1F99446B40A3E76F3E3B95BCDFC2CD85; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            WeatherMultiplier_11_BA39A2EF47216204EE147F9311A57579; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            WeatherCurve_16_8F355AB346C93C6FD7434BAB5CB5A6DD;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_WeatherVolumeInfo;

}

