#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_ContextWidget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_Weapon_ContextWidget.BP_Weapon_ContextWidget_C
// 0x0068 (0x0658 - 0x05F0)
class UBP_Weapon_ContextWidget_C final : public UUVoyageEquipmentContextWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             WeaponNameTB;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoNameTB;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AmmoAmountTB;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightNumber;                                   // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeapon*                          As_Voyage_Weapon;                                  // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AVoyageWeaponBallistic*                 As_Voyage_Weapon_Ballistic;                        // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DefaultAmmoColor;                                  // 0x0630(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            ErrroAmmoColor;                                    // 0x0644(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_BP_Weapon_ContextWidget(int32 EntryPoint);
	void OnAmmoChangedDelegate_Event_0(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemAmmo* NewAmmo);
	void OnAmmoCountChangedDelegate_Event_0(class AVoyageWeaponBallistic* WeaponBallistic, int32 CurrentAmount);
	void OnAmmoMaxCountChangedDelegate_Event(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemAmmo* NewAmmo, int32 CurrentAmount, int32 MaxAmount);
	void OnEquipmentPostActivation_Event(class AController* Controller);
	void OnMagazineChangedDelegate_Event_0(class AVoyageWeaponBallistic* WeaponBallistic, class UVoyageItemWeaponMagazine* NewMagazine);
	void OnPointerHoverChanged(class UInteractiveObjectComponent* InteractiveObjectComponent, bool bTextChangedOnly, const TArray<struct FVoyagePointerActionArguments>& ActiveActions);
	void OnReloadCompletedDelegate_Event_0(class AVoyageWeaponBallistic* WeaponBallistic);
	void OnReloadStartedDelegate_Event_0(class AVoyageWeaponBallistic* WeaponBallistic);
	void OnSetEquipmentActor(const class AVoyageEquipmentActor* InEquipmentActor);
	void UpdateAmmo();
	void UpdateAmmoAmount(bool bAnimate);
	void UpdateVisibility();
	void UpdateWeapon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_ContextWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_ContextWidget_C")
	}
	static class UBP_Weapon_ContextWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Weapon_ContextWidget_C>();
	}
};
DUMPER7_ASSERTS_UBP_Weapon_ContextWidget_C;

}

