#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraPathKey

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CameraPostProcess_structs.hpp"


namespace SDK
{

// UserDefinedStruct CameraPathKey.CameraPathKey
// 0x0120 (0x0120 - 0x0000)
struct FCameraPathKey final
{
public:
	double                                        Time_6_C6BD535643235F638C5E38A1839045D5;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TangentScale_13_7C7A2C1444C36888E5E36EB281E812FB;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform_5_56FB5E9E4EDB919370798FB6FD9E58DD;      // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Roll_16_3A1FA7D6429634113D3C2EA4C92F6FFD;          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCameraPostProcess                     PostProcess_9_E617D14C4FB8E4B9854B70B9F6171777;    // 0x0078(0x00A0)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FCameraPathKey;

}

