#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Channel37

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Channel37_structs.hpp"


namespace SDK
{

// Class Channel37.PluginTestActor
// 0x0000 (0x02B0 - 0x02B0)
class APluginTestActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PluginTestActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PluginTestActor")
	}
	static class APluginTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APluginTestActor>();
	}
};
DUMPER7_ASSERTS_APluginTestActor;

// Class Channel37.VoyageLayeredAudioComponent
// 0x0070 (0x0130 - 0x00C0)
class UVoyageLayeredAudioComponent final : public UActorComponent
{
public:
	TArray<struct FVoyageLayerAudioDefination>    LayerDefines;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bPlayAtLocation;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      LocationAttenuation;                               // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<int32, struct FVoyageLayerAudioInstance> LayerAudioInstances;                               // 0x00E0(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void AdjustLayerVolume(int32 LayerIndex, float AdjustDuration, float Amount, EAudioFaderCurve FadeCurve);
	bool GetLayerDefine(int32 LayerIndex, struct FVoyageLayerAudioDefination* OutDefination);
	void PrintLayerDebug();
	void PushFrontLayer(int32 LayerIndex, float AdjustDuration, float PushAmount, float PullAmount, EAudioFaderCurve FadeCurve);
	void ResetLayerVolumeAll(float AdjustDuration, EAudioFaderCurve FadeCurve);
	void SetLayerVolume(int32 LayerIndex, float AdjustDuration, float TargetVolume, EAudioFaderCurve FadeCurve);
	void SetLayerVolumeAll(float AdjustDuration, EAudioFaderCurve FadeCurve);
	void SolorLayer(int32 LayerIndex, float AdjustDuration, float TargetVolume, EAudioFaderCurve FadeCurve);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoyageLayeredAudioComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoyageLayeredAudioComponent")
	}
	static class UVoyageLayeredAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoyageLayeredAudioComponent>();
	}
};
DUMPER7_ASSERTS_UVoyageLayeredAudioComponent;

}

