#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRigPhysics

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ControlRigPhysics.ERigPhysicsWorldCollisionType
// NumValues: 0x0005
enum class ERigPhysicsWorldCollisionType : uint8
{
	None                                     = 0,
	Static                                   = 1,
	Dynamic                                  = 2,
	All                                      = 3,
	ERigPhysicsWorldCollisionType_MAX        = 4,
};

// Enum ControlRigPhysics.ERigPhysicsSimulationSpace
// NumValues: 0x0004
enum class ERigPhysicsSimulationSpace : uint8
{
	World                                    = 0,
	Component                                = 1,
	SpaceBone                                = 2,
	ERigPhysicsSimulationSpace_MAX           = 3,
};

// Enum ControlRigPhysics.ERigPhysicsCombineMode
// NumValues: 0x0004
enum class ERigPhysicsCombineMode : uint8
{
	Avg                                      = 0,
	Min                                      = 1,
	Multiply                                 = 2,
	Max                                      = 3,
};

// ScriptStruct ControlRigPhysics.RigPhysicsBodySolverSettings
// 0x0034 (0x0034 - 0x0000)
struct FRigPhysicsBodySolverSettings final
{
public:
	struct FRigComponentKey                       PhysicsSolverComponentKey;                         // 0x0000(0x0014)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAutomaticSolver;                               // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         SourceBone;                                        // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigElementKey                         TargetBone;                                        // 0x0024(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeInChecksForReset;                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsBodySolverSettings;

// ScriptStruct ControlRigPhysics.RigPhysicsDynamics
// 0x0068 (0x0068 - 0x0000)
struct FRigPhysicsDynamics final
{
public:
	float                                         Density;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MassOverride;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCentreOfMass;                             // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CentreOfMassOverride;                              // 0x0010(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CentreOfMassNudge;                                 // 0x0028(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMomentsOfInertia;                         // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MomentsOfInertiaOverride;                          // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDamping;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDamping;                                    // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsDynamics;

// ScriptStruct ControlRigPhysics.RigPhysicsCollisionShape
// 0x0010 (0x0010 - 0x0000)
struct FRigPhysicsCollisionShape
{
public:
	float                                         RestOffset;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bContributeToMass;                                 // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsCollisionShape;

// ScriptStruct ControlRigPhysics.RigPhysicsCollisionBox
// 0x0080 (0x0090 - 0x0010)
struct FRigPhysicsCollisionBox final : public FRigPhysicsCollisionShape
{
public:
	struct FTransform                             TM;                                                // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extents;                                           // 0x0070(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsCollisionBox;

// ScriptStruct ControlRigPhysics.RigPhysicsCollisionSphere
// 0x0070 (0x0080 - 0x0010)
struct FRigPhysicsCollisionSphere final : public FRigPhysicsCollisionShape
{
public:
	struct FTransform                             TM;                                                // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsCollisionSphere;

// ScriptStruct ControlRigPhysics.RigPhysicsCollisionCapsule
// 0x0070 (0x0080 - 0x0010)
struct FRigPhysicsCollisionCapsule final : public FRigPhysicsCollisionShape
{
public:
	struct FTransform                             TM;                                                // 0x0010(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsCollisionCapsule;

// ScriptStruct ControlRigPhysics.RigPhysicsMaterial
// 0x000C (0x000C - 0x0000)
struct FRigPhysicsMaterial final
{
public:
	float                                         Friction;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Restitution;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigPhysicsCombineMode                        FrictionCombineMode;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigPhysicsCombineMode                        RestitutionCombineMode;                            // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsMaterial;

// ScriptStruct ControlRigPhysics.RigPhysicsCollision
// 0x0040 (0x0040 - 0x0000)
struct FRigPhysicsCollision final
{
public:
	TArray<struct FRigPhysicsCollisionBox>        Boxes;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRigPhysicsCollisionSphere>     Spheres;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRigPhysicsCollisionCapsule>    Capsules;                                          // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRigPhysicsMaterial                    Material;                                          // 0x0030(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigPhysicsCollision;

// ScriptStruct ControlRigPhysics.RigPhysicsBodyComponent
// 0x0160 (0x01B0 - 0x0050)
struct FRigPhysicsBodyComponent final : public FRigBaseComponent
{
public:
	struct FRigPhysicsBodySolverSettings          BodySolverSettings;                                // 0x0050(0x0034)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPhysicsDynamics                    Dynamics;                                          // 0x0088(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigPhysicsCollision                   Collision;                                         // 0x00F0(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyData;                                          // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             KinematicTarget;                                   // 0x0140(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRigComponentKey>               NoCollisionBodies;                                 // 0x01A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsBodyComponent;

// ScriptStruct ControlRigPhysics.RigUnit_PhysicsBaseMutable
// 0x0000 (0x0010 - 0x0010)
struct FRigUnit_PhysicsBaseMutable : public FRigUnitMutable
{
};
DUMPER7_ASSERTS_FRigUnit_PhysicsBaseMutable;

// ScriptStruct ControlRigPhysics.RigUnit_AddPhysicsBody
// 0x0110 (0x0120 - 0x0010)
struct FRigUnit_AddPhysicsBody final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigElementKey                         Owner;                                             // 0x0010(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x001C(0x0014)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigPhysicsBodySolverSettings          Solver;                                            // 0x0030(0x0034)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPhysicsDynamics                    Dynamics;                                          // 0x0068(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigPhysicsCollision                   Collision;                                         // 0x00D0(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierData            BodyData;                                          // 0x0110(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_AddPhysicsBody;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchyAutoCalculateCollision
// 0x0020 (0x0030 - 0x0010)
struct FRigUnit_HierarchyAutoCalculateCollision final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAspectRatio;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSize;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchyAutoCalculateCollision;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetDynamics
// 0x0080 (0x0090 - 0x0010)
struct FRigUnit_HierarchySetDynamics final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPhysicsDynamics                    Dynamics;                                          // 0x0028(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetDynamics;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetCollision
// 0x0058 (0x0068 - 0x0010)
struct FRigUnit_HierarchySetCollision final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigPhysicsCollision                   Collision;                                         // 0x0028(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetCollision;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchyDisableCollisionBetween
// 0x0028 (0x0038 - 0x0010)
struct FRigUnit_HierarchyDisableCollisionBetween final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey1;                          // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigComponentKey                       PhysicsBodyComponentKey2;                          // 0x0024(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchyDisableCollisionBetween;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodySourceBone
// 0x0020 (0x0030 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodySourceBone final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigElementKey                         SourceBone;                                        // 0x0024(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodySourceBone;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyTargetBone
// 0x0020 (0x0030 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyTargetBone final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigElementKey                         TargetBone;                                        // 0x0024(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyTargetBone;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodySparseData
// 0x0028 (0x0038 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodySparseData final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPhysicsControlModifierSparseData      Data;                                              // 0x0024(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodySparseData;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyKinematicTarget
// 0x0080 (0x0090 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyKinematicTarget final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             KinematicTarget;                                   // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyKinematicTarget;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyKinematicTargetSpace
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyKinematicTargetSpace final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsControlKinematicTargetSpace           KinematicTargetSpace;                              // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyKinematicTargetSpace;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyMovementType
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyMovementType final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsMovementType                          MovementType;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyMovementType;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyCollisionType
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyCollisionType final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionEnabled                             CollisionType;                                     // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyCollisionType;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyIncludeInChecksForReset
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyIncludeInChecksForReset final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInclude;                                          // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyIncludeInChecksForReset;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyMaterial
// 0x0020 (0x0030 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyMaterial final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigPhysicsMaterial                    Material;                                          // 0x0024(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyMaterial;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyGravityMultiplier
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyGravityMultiplier final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityMultiplier;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyGravityMultiplier;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyPhysicsBlendWeight
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyPhysicsBlendWeight final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlendWeight;                                // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyPhysicsBlendWeight;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyUpdateKinematicFromSimulation
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyUpdateKinematicFromSimulation final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateKinematicFromSimulation;                    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyUpdateKinematicFromSimulation;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetPhysicsBodyDamping
// 0x0020 (0x0030 - 0x0010)
struct FRigUnit_HierarchySetPhysicsBodyDamping final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsBodyComponentKey;                           // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDamping;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDamping;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetPhysicsBodyDamping;

// ScriptStruct ControlRigPhysics.RigPhysicsControlComponent
// 0x0158 (0x01A8 - 0x0050)
struct FRigPhysicsControlComponent final : public FRigBaseComponent
{
public:
	struct FRigComponentKey                       ParentBodyComponentKey;                            // 0x0050(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseParentBodyAsDefault;                           // 0x0064(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigComponentKey                       ChildBodyComponentKey;                             // 0x0068(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0080(0x0050)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlMultiplier              ControlMultiplier;                                 // 0x00D0(0x0070)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlTarget                  ControlTarget;                                     // 0x0140(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsControlComponent;

// ScriptStruct ControlRigPhysics.RigUnit_AddPhysicsControl
// 0x0178 (0x0188 - 0x0010)
struct FRigUnit_AddPhysicsControl final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigElementKey                         Owner;                                             // 0x0010(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigComponentKey                       ControlComponentKey;                               // 0x001C(0x0014)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigComponentKey                       ParentBodyComponentKey;                            // 0x0030(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseParentBodyAsDefault;                           // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigComponentKey                       ChildBodyComponentKey;                             // 0x0048(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0060(0x0050)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlMultiplier              ControlMultiplier;                                 // 0x00B0(0x0070)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlTarget                  ControlTarget;                                     // 0x0120(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_AddPhysicsControl;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlEnabled
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetControlEnabled final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlEnabled;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlCustomControlPoint
// 0x0038 (0x0048 - 0x0010)
struct FRigUnit_HierarchySetControlCustomControlPoint final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CustomControlPoint;                                // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomControlPoint;                            // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlCustomControlPoint;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlData
// 0x0068 (0x0078 - 0x0010)
struct FRigUnit_HierarchySetControlData final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0028(0x0050)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlData;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlLinearStrength
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetControlLinearStrength final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlLinearStrength;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlLinearDampingRatio
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetControlLinearDampingRatio final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRatio;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlLinearDampingRatio;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlAngularStrength
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetControlAngularStrength final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlAngularStrength;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlAngularDampingRatio
// 0x0018 (0x0028 - 0x0010)
struct FRigUnit_HierarchySetControlAngularDampingRatio final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRatio;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlAngularDampingRatio;

// ScriptStruct ControlRigPhysics.RigUnit_PhysicsBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_PhysicsBase : public FRigUnit
{
};
DUMPER7_ASSERTS_FRigUnit_PhysicsBase;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchyGetControlData
// 0x0068 (0x0070 - 0x0008)
struct FRigUnit_HierarchyGetControlData final : public FRigUnit_PhysicsBase
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0008(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0020(0x0050)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchyGetControlData;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlMultiplier
// 0x0088 (0x0098 - 0x0010)
struct FRigUnit_HierarchySetControlMultiplier final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlMultiplier              ControlMultiplier;                                 // 0x0028(0x0070)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlMultiplier;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlDataAndMultiplier
// 0x00D8 (0x00E8 - 0x0010)
struct FRigUnit_HierarchySetControlDataAndMultiplier final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlData                    ControlData;                                       // 0x0028(0x0050)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlMultiplier              ControlMultiplier;                                 // 0x0078(0x0070)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlDataAndMultiplier;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchySetControlTarget
// 0x0080 (0x0090 - 0x0010)
struct FRigUnit_HierarchySetControlTarget final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlTarget                  ControlTarget;                                     // 0x0028(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_HierarchySetControlTarget;

// ScriptStruct ControlRigPhysics.RigUnit_HierarchyUpdateControlTarget
// 0x0050 (0x0060 - 0x0010)
struct FRigUnit_HierarchyUpdateControlTarget final : public FRigUnit_PhysicsBaseMutable
{
public:
	struct FRigComponentKey                       PhysicsControlComponentKey;                        // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetOrientation;                                 // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_HierarchyUpdateControlTarget;

// ScriptStruct ControlRigPhysics.RigPhysicsVisualizationSettings
// 0x0018 (0x0018 - 0x0000)
struct FRigPhysicsVisualizationSettings final
{
public:
	bool                                          bEnableVisualization;                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineThickness;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShapeSize;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShapeDetail;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBodies;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCentreOfMass;                                 // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowJoints;                                       // 0x0012(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowControls;                                     // 0x0013(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWorldObjects;                                 // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWorldOverlapBox;                              // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActiveContacts;                               // 0x0016(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInactiveContacts;                             // 0x0017(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsVisualizationSettings;

// ScriptStruct ControlRigPhysics.RigPhysicsSimulationSpaceSettings
// 0x00A0 (0x00A0 - 0x0000)
struct FRigPhysicsSimulationSpaceSettings final
{
public:
	float                                         SpaceMovementAmount;                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityScaleZ;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampLinearVelocity;                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxLinearVelocity;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampAngularVelocity;                             // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAngularVelocity;                                // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampLinearAcceleration;                          // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxLinearAcceleration;                             // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampAngularAcceleration;                         // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAngularAcceleration;                            // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearAccelerationThresholdForTeleport;            // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularAccelerationThresholdForTeleport;           // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionChangeThresholdForTeleport;                // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationChangeThresholdForTeleport;             // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinearDragMultiplier;                              // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDragMultiplier;                             // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalLinearDrag;                                // 0x0040(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalLinearVelocity;                            // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalAngularVelocity;                           // 0x0070(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalTurbulenceVelocity;                        // 0x0088(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsSimulationSpaceSettings;

// ScriptStruct ControlRigPhysics.RigPhysicsSolverSettings
// 0x00B0 (0x00B0 - 0x0000)
struct FRigPhysicsSolverSettings final
{
public:
	bool                                          bAutomaticallyAddPhysicsComponents;                // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigPhysicsSimulationSpace                    SimulationSpace;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigPhysicsSimulationSpace                    CollisionSpace;                                    // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         SpaceBone;                                         // 0x0004(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigPhysicsCollision                   Collision;                                         // 0x0010(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x0050(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigPhysicsWorldCollisionType                 WorldCollisionType;                                // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WorldCollisionExpiryFrames;                        // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldCollisionBoundsExpansion;                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PositionIterations;                                // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VelocityIterations;                                // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProjectionIterations;                              // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumRollingAverageStepTimes;                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionBoundsExpansion;                          // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundsVelocityMultiplier;                          // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVelocityBoundsExpansion;                        // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDepenetrationVelocity;                          // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FixedTimeStep;                                     // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTimeSteps;                                      // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDeltaTime;                                      // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLinearJointSolver;                             // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolveJointPositionsLast;                          // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseManifolds;                                     // 0x00A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PositionThresholdForReset;                         // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KinematicSpeedThresholdForReset;                   // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KinematicAccelerationThresholdForReset;            // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsSolverSettings;

// ScriptStruct ControlRigPhysics.RigPhysicsDriveData
// 0x00D8 (0x00D8 - 0x0000)
struct FRigPhysicsDriveData final
{
public:
	struct FLinearDriveConstraint                 LinearDriveConstraint;                             // 0x0000(0x0068)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAngularDriveConstraint                AngularDriveConstraint;                            // 0x0068(0x0068)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSkeletalAnimation;                             // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkeletalAnimationVelocityMultiplier;               // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigPhysicsDriveData;

// ScriptStruct ControlRigPhysics.RigPhysicsJointData
// 0x0150 (0x0150 - 0x0000)
struct FRigPhysicsJointData final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoCalculateParentOffset;                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
