#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_Mannequin_TwoHanded

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_Mannequin_TwoHanded.CR_Mannequin_TwoHanded_C
// 0x0290 (0x0E50 - 0x0BC0)
class UCR_Mannequin_TwoHanded_C final : public UControlRig
{
public:
	struct FTransform                             Recoil;                                            // 0x0BC0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duck;                                              // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C28[0x8];                                      // 0x0C28(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spring;                                            // 0x0C30(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Control;                                           // 0x0C90(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseControlRotation;                                // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0xF];                                      // 0x0CF1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OriginalHandR;                                     // 0x0D00(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             OriginalHandL;                                     // 0x0D60(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LHandIKMultiplier;                                 // 0x0DC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC8[0x8];                                      // 0x0DC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             IKOffset;                                          // 0x0DD0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EquipmentOffset;                                   // 0x0E30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Influence;                                         // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_Mannequin_TwoHanded_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_Mannequin_TwoHanded_C")
	}
	static class UCR_Mannequin_TwoHanded_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Mannequin_TwoHanded_C>();
	}
};
DUMPER7_ASSERTS_UCR_Mannequin_TwoHanded_C;

}

