#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_Mannequin_Possessed_Vehicle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_Mannequin_Possessed_Vehicle.CR_Mannequin_Possessed_Vehicle_C
// 0x00E0 (0x0CA0 - 0x0BC0)
class UCR_Mannequin_Possessed_Vehicle_C final : public UControlRig
{
public:
	struct FTransform                             LeftHand;                                          // 0x0BC0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RightHand;                                         // 0x0C20(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigComponentKey                       Solver;                                            // 0x0C80(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         HierarchySetJointDriveData_DriveData_AngularDriveConstraint_SlerpDrive_bEnablePositionDrive; // 0x0C94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HierarchySetJointDriveData_DriveData_AngularDriveConstraint_SlerpDrive_bEnablePositionDrive_0; // 0x0C98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_Mannequin_Possessed_Vehicle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_Mannequin_Possessed_Vehicle_C")
	}
	static class UCR_Mannequin_Possessed_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Mannequin_Possessed_Vehicle_C>();
	}
};
DUMPER7_ASSERTS_UCR_Mannequin_Possessed_Vehicle_C;

}

