#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageFXModule

#include "Basic.hpp"

#include "Struct_ConnectorsPS_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_DurabilityIndicatorComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DamageFXModule.DamageFXModule_C
// 0x0098 (0x02D0 - 0x0238)
class UDamageFXModule_C final : public UBP_DurabilityIndicatorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DamageFXModule_C;                   // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UNiagaraComponent*>              PS_Connectors;                                     // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        Damage;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FX_Damage_Curve;                                   // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           RingMeshes;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UPointLightComponent*>           Damage_Lights;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FStruct_ConnectorsPS>           ConnectorsPS;                                      // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AVoyageModuleActor*                     ParentModule;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 MasterComponent;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DamageIndicatorMesh;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColor*                      DamageColorCurve;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasDamageIndicator;                                // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              DamagePS;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         LastDurability;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0(class UVoyageModuleComponent* Module);
	void CustomEvent_1(class UVoyageModuleComponent* SourceModule, float Durability);
	void CustomEvent_2(class UVoyageModuleComponent* SourceModule, float Durability);
	void ExecuteUbergraph_DamageFXModule(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateDamage(double Damage_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DamageFXModule_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DamageFXModule_C")
	}
	static class UDamageFXModule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageFXModule_C>();
	}
};
DUMPER7_ASSERTS_UDamageFXModule_C;

}

