#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EggSackDataAsset

#include "Basic.hpp"

#include "Enum_SackTypes_structs.hpp"
#include "EggSackSwarmSpawnInfo_structs.hpp"
#include "Engine_classes.hpp"
#include "Voyage_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EggSackDataAsset.EggSackDataAsset_C
// 0x00B0 (0x00E0 - 0x0030)
class UEggSackDataAsset_C final : public UPrimaryDataAsset
{
public:
	class UStaticMesh*                            BaseMesh;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BaseMeshMaterial;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BurstMesh;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      BurstMeshMaterial;                                 // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ExplosionFX;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMetaSoundSource*                       MetaSound;                                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanStopExpanding;                                  // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SackTypes                                Type;                                              // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ExplosionMetasound;                                // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FEggSackSwarmSpawnInfo>         SpawnInfo;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVoyageLootItemTables                  LootItemTables;                                    // 0x0080(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EggSackDataAsset_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EggSackDataAsset_C")
	}
	static class UEggSackDataAsset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEggSackDataAsset_C>();
	}
};
DUMPER7_ASSERTS_UEggSackDataAsset_C;

}

