#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Regular_Door_Data

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_Regular_Door_Data.F_Regular_Door_Data
// 0x0050 (0x0050 - 0x0000)
struct FF_Regular_Door_Data final
{
public:
	bool                                          ConstructDoor_14_E7F7A1EF48ABC3FE1FB9C2BFD8130A65; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoorLocked_17_6709120047C0225461D1BF8582F423E1;    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DoorName_2_6E0F122343CC94EC954E81AACF58B616;       // 0x0008(0x0010)(Edit, BlueprintVisible)
	class UClass*                                 DoorActor_5_10121F1B4BF1392AA494D090486C4F7C;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DoorFrameMesh_8_885BE0CD4A04817A3A3C719A40F7CB15;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DoorColor_11_8AEF3F89446C53033DF88A85B070EE10;     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorOffset_20_46F0E0264080972C720702982764109D;    // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FF_Regular_Door_Data;

}

