#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Regular_Scatter_Data

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Regular_BuildingFace_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_Regular_Scatter_Data.F_Regular_Scatter_Data
// 0x00B8 (0x00B8 - 0x0000)
struct FF_Regular_Scatter_Data final
{
public:
	TArray<class UStaticMesh*>                    StaticMeshes_14_8FF699CB4E23529EB56DCBA0286E5F1F;  // 0x0000(0x0010)(Edit, BlueprintVisible)
	E_Regular_BuildingFace                        BuildingFace_17_84F9B9FF4DFDAB4484B4B2BA28CBCB80;  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomRotation_9_0128641643B07D490E597BACBFD05B68; // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshScale_18_25FBEF20499E173DA70465A2D8A749A7;     // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ScatterDensity_21_4A08010843EE29DBF20E049C7AA030FF; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          BBox_24_EDCEA56F48D9A8A7D6656C8BD4370D60;          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowScattering_27_BE64EFD14B62A6730C41CEBDE652EB3A; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CullingDistance_30_883AB13C40AA077F34D7CABF7AB0100D; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CollisionSetting_33_E957C57144C8C127CB98588E4B9096F1; // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset_36_923D9D0647EF06C2A6E8AEA0BD0C4690; // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotationoffset_39_F890966B42DD02F23F06ABA08AA0EFA3; // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ScaleMin_51_0FE487964E240DE089A020B39BF95968;      // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ScaleMax_50_2A33E7914DBD6120D83C6FADBE8A6255;      // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AltitudeVariation_54_3C871B3C4615726038D4E18740225944; // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FF_Regular_Scatter_Data;

}

