#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fabricator_Hologram

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Hologram_Element_Struct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Fabricator_Hologram.Fabricator_Hologram_C
// 0x0060 (0x0310 - 0x02B0)
class AFabricator_Hologram_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              NiagaraSystemComponents;                           // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           MeshComponents;                                    // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FHologram_Element_Struct>       MeshesToDisplay;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 RefActor;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Fabricator_Hologram(int32 EntryPoint);
	void Materialize();
	void ReceiveTick(float DeltaSeconds);
	void Setup(class UClass* Class_0, class UMaterialInstanceDynamic* Material_0);
	void SetupWithMesh(class UStaticMesh* Mesh, class UMaterialInstanceDynamic* Material_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Fabricator_Hologram_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Fabricator_Hologram_C")
	}
	static class AFabricator_Hologram_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFabricator_Hologram_C>();
	}
};
DUMPER7_ASSERTS_AFabricator_Hologram_C;

}

