#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatures

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GameFeatures.GameFeatureStateChangeObserver
// 0x0000 (0x0000 - 0x0000)
class IGameFeatureStateChangeObserver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureStateChangeObserver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureStateChangeObserver")
	}
	static class IGameFeatureStateChangeObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameFeatureStateChangeObserver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameFeatureStateChangeObserver;

// Class GameFeatures.GameFeatureAction
// 0x0000 (0x0028 - 0x0028)
class UGameFeatureAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction")
	}
	static class UGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction;

// Class GameFeatures.GameFeatureAction_AddActorFactory
// 0x0000 (0x0028 - 0x0028)
class UGameFeatureAction_AddActorFactory final : public UGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddActorFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddActorFactory")
	}
	static class UGameFeatureAction_AddActorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddActorFactory>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddActorFactory;

// Class GameFeatures.GameFeatureAction_AddCheats
// 0x0038 (0x0060 - 0x0028)
class UGameFeatureAction_AddCheats final : public UGameFeatureAction
{
public:
	TArray<TSoftClassPtr<class UClass>>           CheatManagers;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bLoadCheatManagersAsync;                           // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0xF];                                       // 0x0039(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UCheatManagerExtension>> SpawnedCheatManagers;                       // 0x0048(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddCheats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddCheats")
	}
	static class UGameFeatureAction_AddCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddCheats>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddCheats;

// Class GameFeatures.GameFeatureAction_AddChunkOverride
// 0x0000 (0x0028 - 0x0028)
class UGameFeatureAction_AddChunkOverride final : public UGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddChunkOverride")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddChunkOverride")
	}
	static class UGameFeatureAction_AddChunkOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddChunkOverride>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddChunkOverride;

// Class GameFeatures.GameFeatureAction_AddComponents
// 0x00C0 (0x00E8 - 0x0028)
class UGameFeatureAction_AddComponents final : public UGameFeatureAction
{
public:
	TArray<struct FGameFeatureComponentEntry>     ComponentList;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0xB0];                                      // 0x0038(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddComponents")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddComponents")
	}
	static class UGameFeatureAction_AddComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddComponents>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddComponents;

// Class GameFeatures.GameFeatureAction_AddWorldPartitionContent
// 0x0018 (0x0040 - 0x0028)
class UGameFeatureAction_AddWorldPartitionContent final : public UGameFeatureAction
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UExternalDataLayerAsset*                ExternalDataLayerAsset;                            // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddWorldPartitionContent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddWorldPartitionContent")
	}
	static class UGameFeatureAction_AddWorldPartitionContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddWorldPartitionContent>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddWorldPartitionContent;

// Class GameFeatures.GameFeatureAction_AddWPContent
// 0x0018 (0x0040 - 0x0028)
class UGameFeatureAction_AddWPContent final : public UGameFeatureAction
{
public:
	class UContentBundleDescriptor*               ContentBundleDescriptor;                           // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddWPContent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddWPContent")
	}
	static class UGameFeatureAction_AddWPContent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddWPContent>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddWPContent;

// Class GameFeatures.GameFeatureAction_AudioActionBase
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_AudioActionBase final : public UGameFeatureAction
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AudioActionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AudioActionBase")
	}
	static class UGameFeatureAction_AudioActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AudioActionBase>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AudioActionBase;

// Class GameFeatures.GameFeatureAction_DataRegistry
// 0x0018 (0x0040 - 0x0028)
class UGameFeatureAction_DataRegistry final : public UGameFeatureAction
{
public:
	TArray<TSoftObjectPtr<class UDataRegistry>>   RegistriesToAdd;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInEditor;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInCommandlets;                             // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_DataRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_DataRegistry")
	}
	static class UGameFeatureAction_DataRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistry>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_DataRegistry;

// Class GameFeatures.GameFeatureAction_DataRegistrySource
// 0x0018 (0x0040 - 0x0028)
class UGameFeatureAction_DataRegistrySource final : public UGameFeatureAction
{
public:
	TArray<struct FDataRegistrySourceToAdd>       SourcesToAdd;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bPreloadInEditor;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_DataRegistrySource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_DataRegistrySource")
	}
	static class UGameFeatureAction_DataRegistrySource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistrySource>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_DataRegistrySource;

// Class GameFeatures.GameFeatureData
// 0x0020 (0x0050 - 0x0030)
class UGameFeatureData final : public UPrimaryDataAsset
{
public:
	TArray<class UGameFeatureAction*>             Actions;                                           // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<struct FPrimaryAssetTypeInfo>          PrimaryAssetTypesToScan;                           // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static void GetPluginName(const class UGameFeatureData* GFD, class FString* PluginName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureData")
	}
	static class UGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureData>();
	}
};
DUMPER7_ASSERTS_UGameFeatureData;

// Class GameFeatures.GameFeatureOptionalContentInstaller
// 0x0278 (0x02A0 - 0x0028)
class UGameFeatureOptionalContentInstaller final : public UObject
{
public:
	uint8                                         Pad_28[0x278];                                     // 0x0028(0x0278)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureOptionalContentInstaller")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureOptionalContentInstaller")
	}
	static class UGameFeatureOptionalContentInstaller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureOptionalContentInstaller>();
	}
};
DUMPER7_ASSERTS_UGameFeatureOptionalContentInstaller;

// Class GameFeatures.GameFeaturePluginStateMachine
// 0x0218 (0x0240 - 0x0028)
class UGameFeaturePluginStateMachine final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameFeaturePluginStateMachineProperties StateProperties;                                 // 0x0030(0x00E0)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_110[0x130];                                    // 0x0110(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturePluginStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturePluginStateMachine")
	}
	static class UGameFeaturePluginStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturePluginStateMachine>();
	}
};
DUMPER7_ASSERTS_UGameFeaturePluginStateMachine;

// Class GameFeatures.GameFeaturesProjectPolicies
// 0x0000 (0x0028 - 0x0028)
class UGameFeaturesProjectPolicies : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesProjectPolicies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesProjectPolicies")
	}
	static class UGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesProjectPolicies>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesProjectPolicies;

// Class GameFeatures.DefaultGameFeaturesProjectPolicies
// 0x0000 (0x0028 - 0x0028)
class UDefaultGameFeaturesProjectPolicies final : public UGameFeaturesProjectPolicies
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultGameFeaturesProjectPolicies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultGameFeaturesProjectPolicies")
	}
	static class UDefaultGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultGameFeaturesProjectPolicies>();
	}
};
DUMPER7_ASSERTS_UDefaultGameFeaturesProjectPolicies;

// Class GameFeatures.GameFeaturesSubsystem
// 0x01A8 (0x01D8 - 0x0030)
class UGameFeaturesSubsystem final : public UEngineSubsystem
{
public:
	TMap<class FString, class UGameFeaturePluginStateMachine*> GameFeaturePluginStateMachines;       // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_80[0x70];                                      // 0x0080(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameFeaturePluginStateMachine*> TerminalGameFeaturePluginStateMachines;            // 0x00F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_100[0xA8];                                     // 0x0100(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Observers;                                         // 0x01A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	class UGameFeaturesProjectPolicies*           GameSpecificPolicies;                              // 0x01B8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_1C0[0x18];                                     // 0x01C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesSubsystem")
	}
	static class UGameFeaturesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesSubsystem;

// Class GameFeatures.GameFeaturesSubsystemSettings
// 0x0060 (0x0098 - 0x0038)
class UGameFeaturesSubsystemSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         GameFeaturesManagerClassName;                      // 0x0038(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         EnabledPlugins;                                    // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         DisabledPlugins;                                   // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalPluginMetadataKeys;                      // 0x0078(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesSubsystemSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesSubsystemSettings")
	}
	static class UGameFeaturesSubsystemSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystemSettings>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesSubsystemSettings;

// Class GameFeatures.GameFeatureVersePathMapperCommandlet
// 0x0000 (0x0080 - 0x0080)
class UGameFeatureVersePathMapperCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureVersePathMapperCommandlet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureVersePathMapperCommandlet")
	}
	static class UGameFeatureVersePathMapperCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureVersePathMapperCommandlet>();
	}
};
DUMPER7_ASSERTS_UGameFeatureVersePathMapperCommandlet;

}

