#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InitialGameOpeningSequence03

#include "Basic.hpp"


namespace SDK::Params
{

// Function InitialGameOpeningSequence03.InitialGameOpeningSequence03_DirectorBP_C.ExecuteUbergraph_InitialGameOpeningSequence03_DirectorBP
// 0x0018 (0x0018 - 0x0000)
struct InitialGameOpeningSequence03_DirectorBP_C_ExecuteUbergraph_InitialGameOpeningSequence03_DirectorBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Audio_GameStart_C*                  K2Node_CustomEvent_BP_Audio_GameStart;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Audio_GameStart_C*                  K2Node_CustomEvent_BP_Audio_GameStart_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InitialGameOpeningSequence03_DirectorBP_C_ExecuteUbergraph_InitialGameOpeningSequence03_DirectorBP;

// Function InitialGameOpeningSequence03.InitialGameOpeningSequence03_DirectorBP_C.FadeInWorldSubmix
// 0x0008 (0x0008 - 0x0000)
struct InitialGameOpeningSequence03_DirectorBP_C_FadeInWorldSubmix final
{
public:
	class ABP_Audio_GameStart_C*                  BP_Audio_GameStart;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InitialGameOpeningSequence03_DirectorBP_C_FadeInWorldSubmix;

// Function InitialGameOpeningSequence03.InitialGameOpeningSequence03_DirectorBP_C.MuteWorldSubmix
// 0x0008 (0x0008 - 0x0000)
struct InitialGameOpeningSequence03_DirectorBP_C_MuteWorldSubmix final
{
public:
	class ABP_Audio_GameStart_C*                  BP_Audio_GameStart;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_InitialGameOpeningSequence03_DirectorBP_C_MuteWorldSubmix;

}

