#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightBP_Factory_Ceiling_RectLarge_Boat_Child

#include "Basic.hpp"

#include "LightBP_Factory_Ceiling_RectLarge_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LightBP_Factory_Ceiling_RectLarge_Boat_Child.LightBP_Factory_Ceiling_RectLarge_Boat_Child_C
// 0x0028 (0x0440 - 0x0418)
class ALightBP_Factory_Ceiling_RectLarge_Boat_Child_C final : public ALightBP_Factory_Ceiling_RectLarge_C
{
public:
	class URectLightComponent*                    RectLight5;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight4;                                        // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight3;                                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight2;                                        // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight1;                                        // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LightBP_Factory_Ceiling_RectLarge_Boat_Child_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LightBP_Factory_Ceiling_RectLarge_Boat_Child_C")
	}
	static class ALightBP_Factory_Ceiling_RectLarge_Boat_Child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightBP_Factory_Ceiling_RectLarge_Boat_Child_C>();
	}
};
DUMPER7_ASSERTS_ALightBP_Factory_Ceiling_RectLarge_Boat_Child_C;

}

