#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovingPlatform_Elevator_Exterior_Large

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovingPlatform_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MovingPlatform_Elevator_Exterior_Large.MovingPlatform_Elevator_Exterior_Large_C
// 0x0080 (0x0488 - 0x0408)
class AMovingPlatform_Elevator_Exterior_Large_C final : public AMovingPlatform_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MovingPlatform_Elevator_Exterior_Large_C; // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Moving_Platform_Block_ButtonBase;               // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Moving_Platform_Gear_01;                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Moving_Platform_Exterior_Large_01_Decal;        // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Moving_Platform_Gear_02;                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing8;                                          // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing7;                                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing6;                                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing5;                                          // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing1;                                          // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Railing2;                                          // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Light1;                                            // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Light;                                             // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moving_Platform_Edge_Large5;                       // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moving_Platform_Edge_Large4;                       // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moving_Platform_Interior_B;                        // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MovingPlatform_Elevator_Exterior_Large(int32 EntryPoint);
	void MoveBackward();
	void MoveForward();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MovingPlatform_Elevator_Exterior_Large_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovingPlatform_Elevator_Exterior_Large_C")
	}
	static class AMovingPlatform_Elevator_Exterior_Large_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovingPlatform_Elevator_Exterior_Large_C>();
	}
};
DUMPER7_ASSERTS_AMovingPlatform_Elevator_Exterior_Large_C;

}

