#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PathNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PathNode.PathNode_C
// 0x0040 (0x02F0 - 0x02B0)
class APathNode_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class APathNode_C*>                    NextNode;                                          // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          DrawDebug;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UArrowComponent*>                Arrows;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void EditorTick();
	void ExecuteUbergraph_PathNode(int32 EntryPoint);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PathNode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PathNode_C")
	}
	static class APathNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APathNode_C>();
	}
};
DUMPER7_ASSERTS_APathNode_C;

}

