#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysicsControl

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysicsControl.PhysicsControlInitializerComponent
// 0x0180 (0x03D0 - 0x0250)
class UPhysicsControlInitializerComponent final : public USceneComponent
{
public:
	struct FInitialCharacterControls              InitialCharacterControls;                          // 0x0250(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FInitialPhysicsControl> InitialControls;                                // 0x0320(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, struct FInitialBodyModifier> InitialBodyModifiers;                             // 0x0370(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bCreateControlsAtBeginPlay;                        // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C1[0xF];                                      // 0x03C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateControls(class UPhysicsControlComponent* PhysicsControlComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsControlInitializerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsControlInitializerComponent")
	}
	static class UPhysicsControlInitializerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlInitializerComponent>();
	}
};
DUMPER7_ASSERTS_UPhysicsControlInitializerComponent;

// Class PhysicsControl.PhysicsControlActor
// 0x0010 (0x02C0 - 0x02B0)
class APhysicsControlActor final : public AActor
{
public:
	class UPhysicsControlComponent*               ControlComponent;                                  // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UPhysicsControlInitializerComponent*    ControlInitializerComponent;                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsControlActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsControlActor")
	}
	static class APhysicsControlActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysicsControlActor>();
	}
};
DUMPER7_ASSERTS_APhysicsControlActor;

// Class PhysicsControl.PhysicsControlAsset
// 0x01E8 (0x0210 - 0x0028)
class UPhysicsControlAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsControlCharacterSetupData      CharacterSetupData;                                // 0x0030(0x00C0)(NativeAccessSpecifierPublic)
	struct FPhysicsControlAndBodyModifierCreationDatas AdditionalControlsAndModifiers;               // 0x00F0(0x00A0)(NativeAccessSpecifierPublic)
	struct FPhysicsControlSetUpdates              AdditionalSets;                                    // 0x0190(0x0020)(NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlControlAndModifierUpdates> InitialControlAndModifierUpdates;        // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlControlAndModifierUpdates> Profiles;                     // 0x01C0(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsControlAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsControlAsset")
	}
	static class UPhysicsControlAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlAsset>();
	}
};
DUMPER7_ASSERTS_UPhysicsControlAsset;

// Class PhysicsControl.PhysicsControlBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UPhysicsControlBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddControlParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, const class FName Name_0, const struct FPhysicsControlSparseData& ControlData);
	static void AddModifierParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, const class FName Name_0, const struct FPhysicsControlModifierSparseData& ModifierData);
	static void AddMultipleControlParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, const TArray<class FName>& Names, const struct FPhysicsControlSparseData& ControlData);
	static void AddMultipleModifierParameters(struct FPhysicsControlControlAndModifierParameters& InParameters, struct FPhysicsControlControlAndModifierParameters* OutParameters, const TArray<class FName>& Names, const struct FPhysicsControlModifierSparseData& ModifierData);
	static void BlendControlParametersThroughSet(struct FPhysicsControlControlAndModifierParameters& InParameters, const struct FPhysicsControlNamedControlParameters& InStartControlParameters, const struct FPhysicsControlNamedControlParameters& InEndControlParameters, const TArray<class FName>& ControlNames, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static void BlendModifierParametersThroughSet(struct FPhysicsControlControlAndModifierParameters& InParameters, const struct FPhysicsControlNamedModifierParameters& InStartModifierParameters, const struct FPhysicsControlNamedModifierParameters& InEndModifierParameters, const TArray<class FName>& ModifierNames, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static void BlendParameters(struct FPhysicsControlControlAndModifierParameters& InParametersA, struct FPhysicsControlControlAndModifierParameters& InParametersB, const float InInterpolationWeight, struct FPhysicsControlControlAndModifierParameters* OutParameters);
	static struct FRigidBodyWithControlReference ConvertToRigidBodyWithControl(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* Result);
	static void ConvertToRigidBodyWithControlPure(const struct FAnimNodeReference& Node, struct FRigidBodyWithControlReference* RigidBodyWithControl, bool* Result);
	static TArray<class FName> GetBodyModifierNamesInSet(const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class FName SetName);
	static TArray<class FName> GetControlNamesInSet(const struct FRigidBodyWithControlReference& RigidBodyWithControl, const class FName SetName);
	static struct FRigidBodyWithControlReference SetOverridePhysicsAsset(const struct FRigidBodyWithControlReference& Node, class UPhysicsAsset* PhysicsAsset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicsControlBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicsControlBPLibrary")
	}
	static class UPhysicsControlBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicsControlBPLibrary>();
	}
};
DUMPER7_ASSERTS_UPhysicsControlBPLibrary;

// Class PhysicsControl.PhysicsControlComponent
// 0x0270 (0x04C0 - 0x0250)
class UPhysicsControlComponent final : public USceneComponent
{
public:
	TSoftObjectPtr<class UPhysicsControlAsset>    PhysicsControlAsset;                               // 0x0250(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeleportDistanceThreshold;                         // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeleportRotationThreshold;                         // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugVisualization;                           // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VisualizationSizeScale;                            // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugControlList;                             // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugControlDetailFilter;                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugBodyModifierList;                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugBodyModifierDetailFilter;                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityPredictionTime;                            // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarnAboutInvalidNames;                            // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumControlsOrModifiersPerName;                  // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttemptToRecreateDisabledControls;                // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C5[0x1FB];                                    // 0x02C5(0x01FB)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBodyModifiersToSet(struct FPhysicsControlNames* NewSet, const TArray<class FName>& BodyModifiers, const class FName Set);
	void AddBodyModifierToSet(struct FPhysicsControlNames* NewSet, const class FName BodyModifier, const class FName Set);
	void AddControlsToSet(struct FPhysicsControlNames* NewSet, const TArray<class FName>& Controls, const class FName Set);
	void AddControlToSet(struct FPhysicsControlNames* NewSet, const class FName Control, const class FName Set);
	class FName CreateBodyModifier(class UPrimitiveComponent* Component, const class FName BoneName, const class FName Set, const struct FPhysicsControlModifierData& BodyModifierData);
