#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Random_Weather_Variation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UDS_Season_structs.hpp"
#include "UDS_RandomWeatherTiming_structs.hpp"
#include "UDS_TemperatureType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Random_Weather_Variation.Random_Weather_Variation_C
// 0x0078 (0x0138 - 0x00C0)
class URandom_Weather_Variation_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AUltra_Dynamic_Weather_C*               UDW;                                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Target_Random_Weather_Type;                        // 0x00D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Lerp_Alpha;                                // 0x00D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Timer_Length;                              // 0x00E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Volume;                                            // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Last_Random_Weather_Type;                          // 0x00F0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Current_Random_Weather_State;                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Change_Timer;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Started;                                           // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Eased_Lerp_Alpha;                                  // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changing_Weather;                                  // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          For_WOV;                                           // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUDS_Weather_Settings_C*>        Weather_Forecast;                                  // 0x0120(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	bool                                          First_Type_Selected;                               // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_State(const struct FRandomWeatherVariation_State& Random_Weather_State);
	void Bind_to_UDS();
	void Change_to_Next_Random_Weather_Type();
	void Check_For_Season_Instant_Refresh();
	void Clear_and_Restart();
	void Create_Composite_Probability_Map(TMap<class UUDS_Weather_Settings_C*, double>* Out);
	void Current_Hour_Changed(int32 Hour);
	void ExecuteUbergraph_Random_Weather_Variation(int32 EntryPoint);
	void Fill_Weather_Forecast();
	void Filter_Probability_Map(const TMap<class UUDS_Weather_Settings_C*, double>& Probability_Map, class UUDS_Weather_Settings_C* Current_Random_Type, TMap<class UUDS_Weather_Settings_C*, double>* Filtered_Probability_Map);
	void Get_Climate_Temperature_Ranges(class UUDS_Climate_Preset_C* Climate_Object, EUDS_TemperatureType Scale, struct FVector2D* Summer_Range, struct FVector2D* Autumn_Range, struct FVector2D* Winter_Range, struct FVector2D* Spring_Range);
	double Get_Current_Lerp_Alpha();
	void Get_Material_State_Manager(class UUDW_Material_State_Manager_C** Material_State_Manager);
	void Get_Season_Probability_Map(int32 Season, TMap<class UUDS_Weather_Settings_C*, double>* Map);
	void Get_State_for_Saving(struct FRandomWeatherVariation_State* State);
	void Hourly(int32 Hour);
	void Increment_Change_Timer();
	void Increment_Random_Weather();
	void Instant_Material_Update();
	void Make_Climate_Probability_Map(class UUDS_Climate_Preset_C* Climate, int32 Season, TMap<class UUDS_Weather_Settings_C*, double>* Probability_Map);
	void Random_Weather_Mode(EUDS_RandomWeatherTiming* Mode);
	void Recalculate_Forecast();
	void ReceiveTick(float DeltaSeconds);
	void Reset_Timer();
	void Select_Random_Weather_Type(const TMap<class UUDS_Weather_Settings_C*, double>& Probability_Map, class UUDS_Weather_Settings_C* Previous_Weather, class UUDS_Weather_Settings_C** Out);
	void Set_New_Random_Interval_Timer();
	void Start_Up_Random_Weather_Variation(class AUltra_Dynamic_Weather_C* UDW_0, class AWeather_Override_Volume_C* Volume_0, bool Start_with_a_Random_Type, class UUDS_Weather_Settings_C* Starting_Weather_Settings);
	void State_Source_Map(TMap<class UUDS_Weather_Settings_C*, double>* Source_Map);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Random_Weather_Variation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Random_Weather_Variation_C")
	}
	static class URandom_Weather_Variation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URandom_Weather_Variation_C>();
	}
};
DUMPER7_ASSERTS_URandom_Weather_Variation_C;

}

