#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocketVisualizerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SocketVisualizerComponent.SocketVisualizerComponent_C
// 0x0028 (0x00E8 - 0x00C0)
class USocketVisualizerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_SocketHoverVisualizer_C*            SocketVisActor;                                    // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HoverComponent;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInteractiveDetectorPointerComponent*   InteractiveDetectorPointerComponent;               // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    HoverReferenceComponent;                           // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocketVisualizerComponent(int32 EntryPoint);
	void OnSocketHoverChanged(class UPrimitiveComponent* PrimitiveComponent);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SocketVisualizerComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocketVisualizerComponent_C")
	}
	static class USocketVisualizerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocketVisualizerComponent_C>();
	}
};
DUMPER7_ASSERTS_USocketVisualizerComponent_C;

}

