#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TerminalConfigurations

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct TerminalConfigurations.TerminalConfigurations
// 0x0070 (0x0070 - 0x0000)
struct FTerminalConfigurations final
{
public:
	struct FSlateColor                            Color_8_4A3D173E46AD92CFD9942AB05FB9D4C2;          // 0x0000(0x0014)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed_20_3F651AC84A8AC4794791079ED722E970;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blur_11_ED6DA066408135863EF3F79BB900CA07;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor_76_20D5A0584FCDB12FD54F7480D521194C; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VignettePower_53_34BFBB264AE038E310F434AD31ECFDB5; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VignetteSize_54_9CAEC1774DD20A0E2AB6778248C80F5F;  // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleX_59_637185A248D552F0C6A234918D68C6E9;        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleY_60_053C472748F9B4CA9A943D8C6CD28985;        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Style_68_76B0AB75452F414A858526BAC5E76103;         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Dirt_71_5C627DF04DD73881CE995C9F77F5A8A6;          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Reflection_73_01DDA965475F0456BE46108EFEDE2AAF;    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FTerminalConfigurations;

}

