#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDW_Lightning_Spawn_Manager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDW_Lightning_Spawn_Manager.UDW_Lightning_Spawn_Manager_C
// 0x0038 (0x00F8 - 0x00C0)
class UUDW_Lightning_Spawn_Manager_C final : public UActorComponent
{
public:
	class AUltra_Dynamic_Weather_C*               UDW;                                               // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Weather_Override_Volume;                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Weather_State;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Spawn_Global_Lightning;                            // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Random_Timer_Multiplier;                           // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Lightning_Timer;                                   // 0x00E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Check_Timer;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Disable_Spawning();
	void Check_For_Timer_Interrupt();
	void Timed_Lightning_Spawn();
	void Initialize(class AUltra_Dynamic_Weather_C* UDW_0, bool Spawn_Global_Lightning_0, class UUDS_Weather_Settings_C* Weather_State_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UDW_Lightning_Spawn_Manager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UDW_Lightning_Spawn_Manager_C")
	}
	static class UUDW_Lightning_Spawn_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUDW_Lightning_Spawn_Manager_C>();
	}
};
DUMPER7_ASSERTS_UUDW_Lightning_Spawn_Manager_C;

}

