#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Voyage

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Voyage_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "DonAINavigation_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Slate_structs.hpp"
#include "AIModule_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function Voyage.VoyageBaseUserWidget.FindAllChildBaseUserWidgets
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseUserWidget_FindAllChildBaseUserWidgets final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UVoyageBaseUserWidget*>          OutWidgets;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_FindAllChildBaseUserWidgets;

// Function Voyage.VoyageBaseUserWidget.FindContentScrollBox
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_FindContentScrollBox final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_FindContentScrollBox;

// Function Voyage.VoyageBaseUserWidget.GetFirstInnerBaseMenuUserWidget
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetFirstInnerBaseMenuUserWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoyageBaseMenuUserWidget*              ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetFirstInnerBaseMenuUserWidget;

// Function Voyage.VoyageBaseUserWidget.GetFirstInnerBaseUserWidget
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetFirstInnerBaseUserWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoyageBaseUserWidget*                  ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetFirstInnerBaseUserWidget;

// Function Voyage.VoyageBaseUserWidget.GetInnerBaseUserWidget
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseUserWidget_GetInnerBaseUserWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UVoyageBaseUserWidget*>          OutInnerWidgets;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetInnerBaseUserWidget;

// Function Voyage.VoyageBaseUserWidget.GetMostOuterBaseMenuUserWidget
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetMostOuterBaseMenuUserWidget final
{
public:
	const class UWidget*                          InWidget;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoyageBaseMenuUserWidget*              ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetMostOuterBaseMenuUserWidget;

// Function Voyage.VoyageBaseUserWidget.GetMostOuterBaseUserWidget
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseUserWidget_GetMostOuterBaseUserWidget final
{
public:
	const class UWidget*                          InWidget;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 InClass;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoyageBaseUserWidget*                  ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetMostOuterBaseUserWidget;

// Function Voyage.VoyageBaseUserWidget.GetMostOuterScrollBox
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetMostOuterScrollBox final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetMostOuterScrollBox;

// Function Voyage.VoyageBaseUserWidget.GetNavigationActionTexts
// 0x0020 (0x0020 - 0x0000)
struct VoyageBaseUserWidget_GetNavigationActionTexts final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputMappingContext*                   InMappingContext;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           OutTexts;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetNavigationActionTexts;

// Function Voyage.VoyageBaseUserWidget.GetNavigationContainerIndex
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetNavigationContainerIndex final
{
public:
	class UPanelWidget*                           InPanelWidget;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetNavigationContainerIndex;

// Function Voyage.VoyageBaseUserWidget.GetParentNavigationContainerIndex
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetParentNavigationContainerIndex final
{
public:
	class UVoyageFocusableWidget*                 InFocusable;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetParentNavigationContainerIndex;

// Function Voyage.VoyageBaseUserWidget.ApplyContentScroll
// 0x0004 (0x0004 - 0x0000)
struct VoyageBaseUserWidget_ApplyContentScroll final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_ApplyContentScroll;

// Function Voyage.VoyageBaseUserWidget.ApplyContentScrollStep
// 0x0001 (0x0001 - 0x0000)
struct VoyageBaseUserWidget_ApplyContentScrollStep final
{
public:
	bool                                          bForward;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_ApplyContentScrollStep;

// Function Voyage.VoyageBaseUserWidget.GetInputTargetWidget
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_GetInputTargetWidget final
{
public:
	class UVoyageBaseUserWidget*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetInputTargetWidget;

// Function Voyage.VoyageBaseUserWidget.HandleNavigationInputK2
// 0x0002 (0x0002 - 0x0000)
struct VoyageBaseUserWidget_HandleNavigationInputK2 final
{
public:
	EUINavigationInputType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_HandleNavigationInputK2;

// Function Voyage.VoyageBaseUserWidget.OnContentScrollBarVisiblityChanged
// 0x0001 (0x0001 - 0x0000)
struct VoyageBaseUserWidget_OnContentScrollBarVisiblityChanged final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnContentScrollBarVisiblityChanged;

// Function Voyage.VoyageBaseUserWidget.OnContextMenuBind
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_OnContextMenuBind final
{
public:
	class UVoyageContextMenuWidget*               InContextMenu;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnContextMenuBind;

// Function Voyage.VoyageBaseUserWidget.OnContextMenuConfirm
// 0x0048 (0x0048 - 0x0000)
struct VoyageBaseUserWidget_OnContextMenuConfirm final
{
public:
	class UVoyageBaseDialogWidget*                DialogWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageDialogResult                    DialogResult;                                      // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnContextMenuConfirm;

// Function Voyage.VoyageBaseUserWidget.OnHUDPersistentWidgetDataChanged
// 0x0020 (0x0020 - 0x0000)
struct VoyageBaseUserWidget_OnHUDPersistentWidgetDataChanged final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageWidgetPersistentData            InPersistentData;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnHUDPersistentWidgetDataChanged;

// Function Voyage.VoyageBaseUserWidget.OnInteractiveSource
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_OnInteractiveSource final
{
public:
	class UInteractiveObjectComponent*            InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InSource;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnInteractiveSource;

// Function Voyage.VoyageBaseUserWidget.OnParentMenuFocusChanged
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_OnParentMenuFocusChanged final
{
public:
	class UVoyageFocusableWidget*                 InFocus;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnParentMenuFocusChanged;

// Function Voyage.VoyageBaseUserWidget.OnParentMenuNavigationInput
// 0x0002 (0x0002 - 0x0000)
struct VoyageBaseUserWidget_OnParentMenuNavigationInput final
{
public:
	EUINavigationInputType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnParentMenuNavigationInput;

// Function Voyage.VoyageBaseUserWidget.OnSubTabChanged
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseUserWidget_OnSubTabChanged final
{
public:
	class UVoyageTabControlWidget*                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTab;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_OnSubTabChanged;

// Function Voyage.VoyageBaseUserWidget.PlayAnimationByName
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_PlayAnimationByName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_PlayAnimationByName;

// Function Voyage.VoyageBaseUserWidget.SetInteractiveSource
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_SetInteractiveSource final
{
public:
	class UInteractiveObjectComponent*            InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InSource;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_SetInteractiveSource;

// Function Voyage.VoyageBaseUserWidget.SetWidgetContextObject
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_SetWidgetContextObject final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_SetWidgetContextObject;

// Function Voyage.VoyageBaseUserWidget.CanContentScroll
// 0x0001 (0x0001 - 0x0000)
struct VoyageBaseUserWidget_CanContentScroll final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_CanContentScroll;

// Function Voyage.VoyageBaseUserWidget.GetInteractiveSource
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_GetInteractiveSource final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetInteractiveSource;

// Function Voyage.VoyageBaseUserWidget.GetInteractiveSourceObjectComponent
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_GetInteractiveSourceObjectComponent final
{
public:
	class UInteractiveObjectComponent*            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetInteractiveSourceObjectComponent;

// Function Voyage.VoyageBaseUserWidget.GetPC
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_GetPC final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetPC;

// Function Voyage.VoyageBaseUserWidget.GetPropertyBindingTargetK2
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_GetPropertyBindingTargetK2 final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetPropertyBindingTargetK2;

// Function Voyage.VoyageBaseUserWidget.GetWidgetOwnerController
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseUserWidget_GetWidgetOwnerController final
{
public:
	class AVoyagePlayerControllerBase*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_GetWidgetOwnerController;

// Function Voyage.VoyageBaseUserWidget.HasChildWidget
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseUserWidget_HasChildWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseUserWidget_HasChildWidget;

// Function Voyage.VoyageBaseMenuUserWidget.ActivateFocus
// 0x0004 (0x0004 - 0x0000)
struct VoyageBaseMenuUserWidget_ActivateFocus final
{
public:
	struct FFocusableActivateData                 InData;                                            // 0x0000(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_ActivateFocus;

// Function Voyage.VoyageBaseMenuUserWidget.FocusNavigation
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseMenuUserWidget_FocusNavigation final
{
public:
	class UVoyageFocusableWidget*                 InFocusableWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_FocusNavigation;

// Function Voyage.VoyageBaseMenuUserWidget.OnHandleNavigationInput
// 0x0002 (0x0002 - 0x0000)
struct VoyageBaseMenuUserWidget_OnHandleNavigationInput final
{
public:
	EUINavigationInputType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnHandleNavigationInput;

// Function Voyage.VoyageBaseMenuUserWidget.OnHandleTabControl
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseMenuUserWidget_OnHandleTabControl final
{
public:
	class UVoyageTabControlWidget*                TabWidget;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUINavigationInputType                        Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnHandleTabControl;

// Function Voyage.VoyageBaseMenuUserWidget.OnInputDeviceChanged
// 0x0001 (0x0001 - 0x0000)
struct VoyageBaseMenuUserWidget_OnInputDeviceChanged final
{
public:
	EInputDeviceType                              InputDevice;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnInputDeviceChanged;

// Function Voyage.VoyageBaseMenuUserWidget.OnMenuButtonActivation
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseMenuUserWidget_OnMenuButtonActivation final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocusableActivateData                 Data;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnMenuButtonActivation;

// Function Voyage.VoyageBaseMenuUserWidget.OnMenuButtonValueChanged
// 0x0008 (0x0008 - 0x0000)
struct VoyageBaseMenuUserWidget_OnMenuButtonValueChanged final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnMenuButtonValueChanged;

// Function Voyage.VoyageBaseMenuUserWidget.OnRootTabChanged
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseMenuUserWidget_OnRootTabChanged final
{
public:
	class UVoyageTabControlWidget*                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActiveTab;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_OnRootTabChanged;

// Function Voyage.VoyageBaseMenuUserWidget.SelectFocus
// 0x0001 (0x0001 - 0x0000)
struct VoyageBaseMenuUserWidget_SelectFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_SelectFocus;

// Function Voyage.VoyageBaseMenuUserWidget.GetLargestNavigationIndex
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseMenuUserWidget_GetLargestNavigationIndex final
{
public:
	class UPanelWidget*                           InPanelWidget;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_GetLargestNavigationIndex;

// Function Voyage.VoyageBaseMenuUserWidget.GetNearestFocusableWidget
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseMenuUserWidget_GetNearestFocusableWidget final
{
public:
	class UPanelWidget*                           InPanelWidget;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentIndex;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoyageFocusableWidget*                 ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_GetNearestFocusableWidget;

// Function Voyage.VoyageBaseMenuUserWidget.IsNavigationsInputType
// 0x0002 (0x0002 - 0x0000)
struct VoyageBaseMenuUserWidget_IsNavigationsInputType final
{
public:
	EUINavigationInputType                        Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseMenuUserWidget_IsNavigationsInputType;

// Function Voyage.VoyageBaseDialogWidget.ConfirmDialog
// 0x0040 (0x0040 - 0x0000)
struct VoyageBaseDialogWidget_ConfirmDialog final
{
public:
	struct FVoyageDialogResult                    DialogResult;                                      // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_ConfirmDialog;

// Function Voyage.VoyageBaseDialogWidget.OnConfirm
// 0x0040 (0x0040 - 0x0000)
struct VoyageBaseDialogWidget_OnConfirm final
{
public:
	struct FVoyageDialogResult                    DialogResult;                                      // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_OnConfirm;

// Function Voyage.VoyageBaseDialogWidget.OnConfirmButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseDialogWidget_OnConfirmButtonClicked final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocusableActivateData                 Data;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_OnConfirmButtonClicked;

// Function Voyage.VoyageBaseDialogWidget.OnFocusableBtnActivated
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseDialogWidget_OnFocusableBtnActivated final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocusableActivateData                 Data;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_OnFocusableBtnActivated;

// Function Voyage.VoyageBaseDialogWidget.SetDialogButtonText
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseDialogWidget_SetDialogButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EVoyageDialogResultType                       Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_SetDialogButtonText;

// Function Voyage.VoyageBaseDialogWidget.SetDialogButtonTexts
// 0x0050 (0x0050 - 0x0000)
struct VoyageBaseDialogWidget_SetDialogButtonTexts final
{
public:
	TMap<EVoyageDialogResultType, class FText>    InTexts;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_SetDialogButtonTexts;

// Function Voyage.VoyageBaseDialogWidget.GetDialogContext
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseDialogWidget_GetDialogContext final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_GetDialogContext;

// Function Voyage.VoyageBaseDialogWidget.GetDialogCustomData
// 0x0018 (0x0018 - 0x0000)
struct VoyageBaseDialogWidget_GetDialogCustomData final
{
public:
	struct FVoyageDialogData                      ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDialogWidget_GetDialogCustomData;

// Function Voyage.VoyageLazarusFilterDialog.OnApplyBtnClicked
// 0x0010 (0x0010 - 0x0000)
struct VoyageLazarusFilterDialog_OnApplyBtnClicked final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocusableActivateData                 Data;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageLazarusFilterDialog_OnApplyBtnClicked;

// Function Voyage.VoyageLazarusFilterDialog.OnResetBtnClicked
// 0x0010 (0x0010 - 0x0000)
struct VoyageLazarusFilterDialog_OnResetBtnClicked final
{
public:
	class UVoyageFocusableWidget*                 Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFocusableActivateData                 Data;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageLazarusFilterDialog_OnResetBtnClicked;

// Function Voyage.VoyageItemInterface.CanAreaCollect
// 0x0010 (0x0010 - 0x0000)
struct VoyageItemInterface_CanAreaCollect final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageItemInterface_CanAreaCollect;

// Function Voyage.VoyageItemInterface.CanCollect
// 0x0010 (0x0010 - 0x0000)
struct VoyageItemInterface_CanCollect final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageItemInterface_CanCollect;

// Function Voyage.VoyageItemInterface.Collect
// 0x0010 (0x0010 - 0x0000)
struct VoyageItemInterface_Collect final
{
public:
	class APawn*                                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageItemInterface_Collect;

// Function Voyage.VoyageItemInterface.OnSpawn
// 0x00D0 (0x00D0 - 0x0000)
struct VoyageItemInterface_OnSpawn final
{
public:
	class UVoyageItem*                            Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageItemData                        InData;                                            // 0x0008(0x0078)(Parm, NativeAccessSpecifierPublic)
	struct FVoyageItemSpawnSettings               Settings;                                          // 0x0080(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageItemInterface_OnSpawn;

// Function Voyage.VoyageItemInterface.UpdateActorTags
// 0x0008 (0x0008 - 0x0000)
struct VoyageItemInterface_UpdateActorTags final
{
public:
	class UVoyageItem*                            Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageItemInterface_UpdateActorTags;

// Function Voyage.VoyageItemInterface.GetItem
// 0x0008 (0x0008 - 0x0000)
struct VoyageItemInterface_GetItem final
{
public:
	class UVoyageItem*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageItemInterface_GetItem;

// Function Voyage.InteractiveObjectComponent.InteractAction_Implementation
// 0x0010 (0x0010 - 0x0000)
struct InteractiveObjectComponent_InteractAction_Implementation final
{
public:
	class APawn*                                  MyCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPartId;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InteractIndex;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractiveObjectComponent_InteractAction_Implementation;

// Function Voyage.InteractiveObjectComponent.SetInteractiveState
// 0x0001 (0x0001 - 0x0000)
struct InteractiveObjectComponent_SetInteractiveState final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractiveObjectComponent_SetInteractiveState;

// Function Voyage.VoyageModularOutpostActor.GetNumActors
// 0x0020 (0x0020 - 0x0000)
struct VoyageModularOutpostActor_GetNumActors final
{
public:
	TSubclassOf<class AActor>                     Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         actors;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageModularOutpostActor_GetNumActors;

// Function Voyage.VoyageModularOutpostActor.GetNumComponents
// 0x0020 (0x0020 - 0x0000)
struct VoyageModularOutpostActor_GetNumComponents final
{
public:
	TSubclassOf<class UActorComponent>            Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                Components;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoyageModularOutpostActor_GetNumComponents;

// Function Voyage.CharacterInteractiveComponent.MoveCargoAction_Implementation
// 0x0010 (0x0010 - 0x0000)
struct CharacterInteractiveComponent_MoveCargoAction_Implementation final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECargoType                                    Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CharacterInteractiveComponent_MoveCargoAction_Implementation;

// Function Voyage.CharacterInterface.MoveCargoAction
// 0x0010 (0x0010 - 0x0000)
struct CharacterInterface_MoveCargoAction final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECargoType                                    Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CharacterInterface_MoveCargoAction;

// Function Voyage.VoyageOverlayValidator.OnValidate
// 0x0020 (0x0020 - 0x0000)
struct VoyageOverlayValidator_OnValidate final
{
public:
	class AVoyagePlayerController*                InInstigator;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageOverlayValidatorResult          ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageOverlayValidator_OnValidate;

// Function Voyage.ConnectableInterface.RegisterSocketConnection
// 0x0008 (0x0008 - 0x0000)
struct ConnectableInterface_RegisterSocketConnection final
{
public:
	class UModuleSocketComponent*                 Socket;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConnectableInterface_RegisterSocketConnection;

// Function Voyage.ConnectedEventActorInterface.OnPostApplyProperties
// 0x00A0 (0x00A0 - 0x0000)
struct ConnectedEventActorInterface_OnPostApplyProperties final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConnectedEventActorInterface_OnPostApplyProperties;

// Function Voyage.ConnectedEventActorInterface.OnPostSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct ConnectedEventActorInterface_OnPostSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConnectedEventActorInterface_OnPostSpawnConnectedActor;

// Function Voyage.ConnectedEventActorInterface.OnPreSpawnConnectedActor
// 0x00A0 (0x00A0 - 0x0000)
struct ConnectedEventActorInterface_OnPreSpawnConnectedActor final
{
public:
	struct FVoyageConnectedEventInfo              EventInfo;                                         // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0090(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConnectedEventActorInterface_OnPreSpawnConnectedActor;

// Function Voyage.VoyageBaseDataAsset.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseDataAsset_GetDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDataAsset_GetDescription;

// Function Voyage.VoyageBaseDataAsset.GetIdentifierString
// 0x0010 (0x0010 - 0x0000)
struct VoyageBaseDataAsset_GetIdentifierString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoyageBaseDataAsset_GetIdentifierString;

// Function Voyage.EquipmentAbilityComponent.ActivateAbility
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_ActivateAbility final
{
public:
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_ActivateAbility;

// Function Voyage.EquipmentAbilityComponent.CanInteractWith
// 0x0010 (0x0010 - 0x0000)
struct EquipmentAbilityComponent_CanInteractWith final
{
public:
	class UObject*                                InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_CanInteractWith;

// Function Voyage.EquipmentAbilityComponent.GetAvailability
// 0x0001 (0x0001 - 0x0000)
struct EquipmentAbilityComponent_GetAvailability final
{
public:
	EVoyageEquipmentAvailabilityType              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_GetAvailability;

// Function Voyage.EquipmentAbilityComponent.GetProvidedActionsBP
// 0x0010 (0x0010 - 0x0000)
struct EquipmentAbilityComponent_GetProvidedActionsBP final
{
public:
	TArray<struct FPlayerInputInterfaceAction>    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_GetProvidedActionsBP;

// Function Voyage.EquipmentAbilityComponent.GetScanTargetTexts
// 0x0058 (0x0058 - 0x0000)
struct EquipmentAbilityComponent_GetScanTargetTexts final
{
public:
	class UObject*                                InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageScanText                        OutText;                                           // 0x0008(0x0048)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_GetScanTargetTexts;

// Function Voyage.EquipmentAbilityComponent.InteractAbility
// 0x0168 (0x0168 - 0x0000)
struct EquipmentAbilityComponent_InteractAbility final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0010(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0160(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_InteractAbility;

// Function Voyage.EquipmentAbilityComponent.OnAbilityActivated
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityActivated final
{
public:
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityActivated;

// Function Voyage.EquipmentAbilityComponent.OnAbilityCharged
// 0x0018 (0x0018 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityCharged final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Charge;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeldTime;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVoyageEquipmentAbilityChargeResult    ReturnValue;                                       // 0x0010(0x0002)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityCharged;

// Function Voyage.EquipmentAbilityComponent.OnAbilityChargeFull
// 0x0010 (0x0010 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityChargeFull final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeldTime;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityChargeFull;

// Function Voyage.EquipmentAbilityComponent.OnAbilityInteracted
// 0x0160 (0x0160 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityInteracted final
{
public:
	int32                                         InteractIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0008(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0158(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityInteracted;

// Function Voyage.EquipmentAbilityComponent.OnAbilityOwnerControlledChanged
// 0x0008 (0x0008 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityOwnerControlledChanged final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityOwnerControlledChanged;

// Function Voyage.EquipmentAbilityComponent.OnAbilityReleased
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_OnAbilityReleased final
{
public:
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnAbilityReleased;

// Function Voyage.EquipmentAbilityComponent.OnActivateAbility
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_OnActivateAbility final
{
public:
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnActivateAbility;

// Function Voyage.EquipmentAbilityComponent.OnReleaseAbility
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_OnReleaseAbility final
{
public:
	struct FVoyageEquipmentAbilityActivationArgs  InArgs;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnReleaseAbility;

// Function Voyage.EquipmentAbilityComponent.OnSetAbilityData
// 0x0008 (0x0008 - 0x0000)
struct EquipmentAbilityComponent_OnSetAbilityData final
{
public:
	class UVoyageAbilityData*                     InAbilityData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentAbilityComponent_OnSetAbilityData;

// Function Voyage.EquipmentAbilityComponent.ReleaseAbility
// 0x0150 (0x0150 - 0x0000)
struct EquipmentAbilityComponent_ReleaseAbility final
{
public:
