#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InteractIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_InteractIndicator.WBP_InteractIndicator_C.ExecuteUbergraph_WBP_InteractIndicator
// 0x0020 (0x0020 - 0x0000)
struct WBP_InteractIndicator_C_ExecuteUbergraph_WBP_InteractIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Progress)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Progress;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateProgress_Value_ImplicitCast;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InteractIndicator_C_ExecuteUbergraph_WBP_InteractIndicator;

// Function WBP_InteractIndicator.WBP_InteractIndicator_C.InteractProgressChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_InteractIndicator_C_InteractProgressChanged final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InteractIndicator_C_InteractProgressChanged;

// Function WBP_InteractIndicator.WBP_InteractIndicator_C.UpdateProgress
// 0x0010 (0x0010 - 0x0000)
struct WBP_InteractIndicator_C_UpdateProgress final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InteractIndicator_C_UpdateProgress;

}

