#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CheckpointScreen

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CheckpointScreen.WBP_CheckpointScreen_C.ExecuteUbergraph_WBP_CheckpointScreen
// 0x0058 (0x0058 - 0x0000)
struct WBP_CheckpointScreen_C_ExecuteUbergraph_WBP_CheckpointScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_MainText;                       // 0x0008(0x0010)()
	struct FSlateColor                            K2Node_CustomEvent_MainTextColor;                  // 0x0018(0x0014)(NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Subtext;                        // 0x0030(0x0010)()
	struct FSlateColor                            K2Node_CustomEvent_SubTextColor;                   // 0x0040(0x0014)(NoDestructor)
};
DUMPER7_ASSERTS_WBP_CheckpointScreen_C_ExecuteUbergraph_WBP_CheckpointScreen;

// Function WBP_CheckpointScreen.WBP_CheckpointScreen_C.UpdateText
// 0x0050 (0x0050 - 0x0000)
struct WBP_CheckpointScreen_C_UpdateText final
{
public:
	class FText                                   MainText_0;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            MainTextColor;                                     // 0x0010(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SubText_0;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            SubTextColor;                                      // 0x0038(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_WBP_CheckpointScreen_C_UpdateText;

// Function WBP_CheckpointScreen.WBP_CheckpointScreen_C.AllowInteract
// 0x0008 (0x0008 - 0x0000)
struct WBP_CheckpointScreen_C_AllowInteract final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CheckpointScreen_C_AllowInteract;

// Function WBP_CheckpointScreen.WBP_CheckpointScreen_C.AllowPointerKey
// 0x0020 (0x0020 - 0x0000)
struct WBP_CheckpointScreen_C_AllowPointerKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CheckpointScreen_C_AllowPointerKey;

}

