#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TerminalScreen_Layer_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TerminalConfigurations_structs.hpp"


namespace SDK::Params
{

// Function WBP_TerminalScreen_Layer_Widget.WBP_TerminalScreen_Layer_Widget_C.ExecuteUbergraph_WBP_TerminalScreen_Layer_Widget
// 0x03A0 (0x03A0 - 0x0000)
struct WBP_TerminalScreen_Layer_Widget_C_ExecuteUbergraph_WBP_TerminalScreen_Layer_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTerminalConfigurations                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0070)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_TerminalID;                     // 0x0098(0x0010)()
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        CallFunc_GetFontStyleFromTableRow_OutStyle;        // 0x00B0(0x02E0)()
	bool                                          CallFunc_GetFontStyleFromTableRow_ReturnValue;     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Layer_Widget_C_ExecuteUbergraph_WBP_TerminalScreen_Layer_Widget;

// Function WBP_TerminalScreen_Layer_Widget.WBP_TerminalScreen_Layer_Widget_C.SetStylePreset
// 0x0004 (0x0004 - 0x0000)
struct WBP_TerminalScreen_Layer_Widget_C_SetStylePreset final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Layer_Widget_C_SetStylePreset;

// Function WBP_TerminalScreen_Layer_Widget.WBP_TerminalScreen_Layer_Widget_C.UpdateTerminalVisualID
// 0x0010 (0x0010 - 0x0000)
struct WBP_TerminalScreen_Layer_Widget_C_UpdateTerminalVisualID final
{
public:
	class FText                                   TerminalID_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Layer_Widget_C_UpdateTerminalVisualID;

}

