#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LazarusRack_Info_Widget

#include "Basic.hpp"

#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LazarusRack_Info_Widget.WBP_LazarusRack_Info_Widget_C
// 0x0130 (0x0740 - 0x0610)
class UWBP_LazarusRack_Info_Widget_C final : public UVoyageModuleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LazarusRack_TraitWidget_C*         WBP_LazarusRack_TraitWidget;                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LazarusRack_Property_Widget_C*     WBP_LazarusRack_Property_Widget_265;               // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LazarusRack_Property_Widget_C*     WBP_LazarusRack_Property_Widget_161;               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LazarusRack_Property_Widget_C*     WBP_LazarusRack_Property_Widget_93;                // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LazarusRack_Property_Widget_C*     WBP_LazarusRack_Property_Widget;                   // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TraitContainer;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PropertyContainerPhysical;                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PropertyContainer;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Age;                                               // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Weight;                                            // 0x0670(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Height;                                            // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Skills;                                            // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Traits;                                            // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Likes;                                             // 0x06B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Dislikes;                                          // 0x06C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UVoyageItemMemoryTraitClass*, class UWidget*> TraitContainers;                        // 0x06D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AVoyageLazarusPOD*                      HumanPod;                                          // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        NewVar_0;                                          // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DisplaySimulationProjection;                       // 0x0738(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LazarusRack_Info_Widget(int32 EntryPoint);
	ESlateVisibility Get_ProcessBox_Visibility();
	void GetHumanPodFunction(class UVoyageModuleComponent* ModuleComponent, class AVoyageLazarusRack** AsVoyage_Lazarus_Rack, class AVoyageLazarusPOD** Output);
	bool GetHumanProperty(const class UVoyageHumanProperty* Key, double* Value);
	void OnPodAttached_Event(class AVoyageLazarusPOD* HumanPod_0);
	void OnPodChanged(class AVoyageLazarusPOD* HumanPod_0);
	void OnPodEjected_Event(class AVoyageLazarusPOD* HumanPod_0);
	void OnPropertiesChanged_Event(class AVoyageLazarusPOD* HumanPod_0);
	void OnSimulationUpdated_Event(class AVoyageLazarusPOD* HumanPod_0);
	void OnTraitsChanged_Event(class AVoyageLazarusPOD* HumanPod_0);
	void SetModuleSource(class UVoyageModuleComponent* InModuleComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_LazarusRack_Info_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_LazarusRack_Info_Widget_C")
	}
	static class UWBP_LazarusRack_Info_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LazarusRack_Info_Widget_C>();
	}
};
DUMPER7_ASSERTS_UWBP_LazarusRack_Info_Widget_C;

}

