#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InfoConsole_Wind

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InfoConsole_Wind.WBP_InfoConsole_Wind_C
// 0x0070 (0x0680 - 0x0610)
class UWBP_InfoConsole_Wind_C final : public UVoyageModuleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DirectionArrow_1;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DirectionArrow;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 MainModule;                                        // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVoyageBoatPawn*                        BoatPawn;                                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoyageWorldWind                       Wind;                                              // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVoyageWorldClimate                    Climate;                                           // 0x0658(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_InfoConsole_Wind(int32 EntryPoint);
	class FText GetText();
	void SetInfoConsoleSourceActor(class AActor* SourceActor);
	void SetModuleSource(class UVoyageModuleComponent* InModuleComponent);
	void SetWidgetVisibility(bool bIsVisible);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InfoConsole_Wind_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InfoConsole_Wind_C")
	}
	static class UWBP_InfoConsole_Wind_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InfoConsole_Wind_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InfoConsole_Wind_C;

}

