#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LazarusRack_Property_Widget

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LazarusRack_Property_Widget.WBP_LazarusRack_Property_Widget_C
// 0x0058 (0x0668 - 0x0610)
class UWBP_LazarusRack_Property_Widget_C final : public UVoyageModuleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PropertyName;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoyageHumanProperty*                   HumanProperty;                                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PropertyTextValue;                                 // 0x0638(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   PropertyTextUnit;                                  // 0x0648(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AVoyageLazarusPOD*                      TargetPod;                                         // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoUpdate;                                        // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_LazarusRack_Property_Widget(int32 EntryPoint);
	float Get_ProgressBar_Percent();
	class FText Get_PropertyText_Text();
	void GetHumanPodFunction(class AVoyageLazarusRack** AsVoyage_Lazarus_Rack, class AVoyageLazarusPOD** Output);
	void Refresh(class AVoyageLazarusPOD* HumanPod);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_LazarusRack_Property_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_LazarusRack_Property_Widget_C")
	}
	static class UWBP_LazarusRack_Property_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LazarusRack_Property_Widget_C>();
	}
};
DUMPER7_ASSERTS_UWBP_LazarusRack_Property_Widget_C;

}

