#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InfoConsole_VehicleSpeed

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InfoConsole_VehicleSpeed.WBP_InfoConsole_VehicleSpeed_C.ExecuteUbergraph_WBP_InfoConsole_VehicleSpeed
// 0x0018 (0x0018 - 0x0000)
struct WBP_InfoConsole_VehicleSpeed_C_ExecuteUbergraph_WBP_InfoConsole_VehicleSpeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SourceActor;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InfoConsole_VehicleSpeed_C_ExecuteUbergraph_WBP_InfoConsole_VehicleSpeed;

// Function WBP_InfoConsole_VehicleSpeed.WBP_InfoConsole_VehicleSpeed_C.SetInfoConsoleSourceActor
// 0x0008 (0x0008 - 0x0000)
struct WBP_InfoConsole_VehicleSpeed_C_SetInfoConsoleSourceActor final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InfoConsole_VehicleSpeed_C_SetInfoConsoleSourceActor;

// Function WBP_InfoConsole_VehicleSpeed.WBP_InfoConsole_VehicleSpeed_C.SetWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_InfoConsole_VehicleSpeed_C_SetWidgetVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InfoConsole_VehicleSpeed_C_SetWidgetVisibility;

}

