#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TerminalScreen_Quest_Widget

#include "Basic.hpp"

#include "TerminalConfigurations_structs.hpp"
#include "Voyage_structs.hpp"


namespace SDK::Params
{

// Function WBP_TerminalScreen_Quest_Widget.WBP_TerminalScreen_Quest_Widget_C.ExecuteUbergraph_WBP_TerminalScreen_Quest_Widget
// 0x0170 (0x0170 - 0x0000)
struct WBP_TerminalScreen_Quest_Widget_C_ExecuteUbergraph_WBP_TerminalScreen_Quest_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVoyageTerminalScreenWidget*            K2Node_Event_InSceenWidget;                        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageTerminalAppObject*               K2Node_Event_InAppObject;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVoyageTerminalAppData                 K2Node_Event_InAppData;                            // 0x0020(0x00A0)(ConstParm)
	class UObject*                                K2Node_Event_InModuleSource;                       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AVoyagePlayerController*                K2Node_DynamicCast_AsVoyage_Player_Controller;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00D8(0x0010)(ReferenceParm)
	int32                                         K2Node_Event_Index;                                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTerminalConfigurations                CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F8(0x0070)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Quest_Widget_C_ExecuteUbergraph_WBP_TerminalScreen_Quest_Widget;

// Function WBP_TerminalScreen_Quest_Widget.WBP_TerminalScreen_Quest_Widget_C.OnPostInit
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_TerminalScreen_Quest_Widget_C_OnPostInit final
{
public:
	class UVoyageTerminalScreenWidget*            InSceenWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVoyageTerminalAppObject*               InAppObject;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVoyageTerminalAppData                 InAppData;                                         // 0x0010(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                InModuleSource;                                    // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Quest_Widget_C_OnPostInit;

// Function WBP_TerminalScreen_Quest_Widget.WBP_TerminalScreen_Quest_Widget_C.SetStylePreset
// 0x0004 (0x0004 - 0x0000)
struct WBP_TerminalScreen_Quest_Widget_C_SetStylePreset final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TerminalScreen_Quest_Widget_C_SetStylePreset;

}

