#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Module_Status_Overlay

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Module_Status_Overlay.WBP_Module_Status_Overlay_C
// 0x0080 (0x0690 - 0x0610)
class UWBP_Module_Status_Overlay_C final : public UVoyageModuleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             StatusTextBlock;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           StatusContainer;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_120;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 In_Module_Component;                               // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            In_Color_and_Opacity;                              // 0x0640(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            MetRequirementColorOpacity;                        // 0x0654(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          HideWhenHasPower;                                  // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowMetRequirements;                               // 0x0669(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowPowerStatus;                                   // 0x066A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66B[0x5];                                      // 0x066B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewVar;                                            // 0x0670(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ErrorText;                                         // 0x0680(0x0010)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Module_Status_Overlay(int32 EntryPoint);
	ESlateVisibility Get_StatusTextBlock_Visibility();
	class FText GetStatusText();
	void OnCustomRequirementsChanged_Event(class UVoyageModuleComponent* Module);
	void OnModulePowerStateChanged_Event(class UVoyageModuleComponent* SourceModule, bool bHasPower);
	void SetModuleSource(class UVoyageModuleComponent* InModuleComponent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Module_Status_Overlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Module_Status_Overlay_C")
	}
	static class UWBP_Module_Status_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Module_Status_Overlay_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Module_Status_Overlay_C;

}

