#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TerminalScreen_Layer_Widget_Cameras

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TerminalScreen_Layer_Widget_Cameras.WBP_TerminalScreen_Layer_Widget_Cameras_C
// 0x0028 (0x0848 - 0x0820)
class UWBP_TerminalScreen_Layer_Widget_Cameras_C final : public UVoyageTerminalScreenLayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CameraImage_1;                                     // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CameraImage;                                       // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AVoyageSecurityCameraActor*             SecurityCamera;                                    // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TerminalScreen_Layer_Widget_Cameras(int32 EntryPoint);
	void SetSecurityCamera(class AVoyageSecurityCameraActor* SecurityCamera_0);
	void SetStylePreset(int32 Index_0);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TerminalScreen_Layer_Widget_Cameras_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TerminalScreen_Layer_Widget_Cameras_C")
	}
	static class UWBP_TerminalScreen_Layer_Widget_Cameras_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TerminalScreen_Layer_Widget_Cameras_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TerminalScreen_Layer_Widget_Cameras_C;

}

