#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InfoConsole_HullStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Voyage_structs.hpp"
#include "Voyage_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InfoConsole_HullStatus.WBP_InfoConsole_HullStatus_C
// 0x0090 (0x06A0 - 0x0610)
class UWBP_InfoConsole_HullStatus_C final : public UVoyageModuleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             WarningText;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HealthPercentage;                                  // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BlinkWarning;                                      // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVoyageModuleComponent*                 MainModule;                                        // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AVoyageVehiclePawn*                     BoatPawn;                                          // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVoyageWorldWind                       Wind;                                              // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVoyageWorldClimate                    Climate;                                           // 0x0660(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FWaveProperties>                Wave_Props;                                        // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        WaveHeight;                                        // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InfoConsole_HullStatus(int32 EntryPoint);
	void OnModuleDurabilityChanged_Event(class UVoyageModuleComponent* SourceModule, float Durability);
	void SetInfoConsoleSourceActor(class AActor* SourceActor);
	void SetModuleSource(class UVoyageModuleComponent* InModuleComponent);
	void SetWidgetVisibility(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InfoConsole_HullStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InfoConsole_HullStatus_C")
	}
	static class UWBP_InfoConsole_HullStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InfoConsole_HullStatus_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InfoConsole_HullStatus_C;

}

