#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeatherVolumeActor

#include "Basic.hpp"

#include "Voyage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeatherVolumeActor.WeatherVolumeActor_C
// 0x0058 (0x0318 - 0x02C0)
class AWeatherVolumeActor_C final : public AVoyageWeatherVolumeActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVoyagePersistentActorComponent*        VoyagePersistentActor;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRadius;                                        // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dynamic;                                           // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            WeatherCurve;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentTime;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurveLengthSeconds;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurveMultiplier;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AWeatherVolumeActor_C* WeatherVolume)> OnCurveFinished;      // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WeatherVolumeActor(int32 EntryPoint);
	void ForceUpdate();
	double GetFloatInRange(const struct FFloatRange& FloatRange);
	class UVoyagePersistentActorComponent* GetOwnedPersistentActorComponent();
	void MoveVolume(float B);
	void OnCustomDataLoad(const TArray<uint8>& InData, int32 Version);
	void OnCustomDataSave(TArray<uint8>* OutData);
	void OnPersistentActorPostLoad(int32 Version);
	void OnPersistentActorPrepareSave();
	void OnPersistentActorPreSave();
	void OnPersistentSubsystemPostLoad(int32 Version);
	void OnPersistentSubsystemPreSave();
	void OnPersistentTranformReset(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateDisabled();
	void UpdateMultiplier();
	void UpdateMultiplierAtTime(float InTime);
	void UserConstructionScript();

	class FName GetOverrideZoneId() const;
	bool HasAnyChanges() const;
	bool HasCustomData() const;
	bool PersistTranform() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeatherVolumeActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeatherVolumeActor_C")
	}
	static class AWeatherVolumeActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeatherVolumeActor_C>();
	}
};
DUMPER7_ASSERTS_AWeatherVolumeActor_C;

}

