#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeatherVolumeActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WeatherVolumeActor.WeatherVolumeActor_C.ExecuteUbergraph_WeatherVolumeActor
// 0x0070 (0x0070 - 0x0000)
struct WeatherVolumeActor_C_ExecuteUbergraph_WeatherVolumeActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 K2Node_Event_InData;                               // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_Version_2;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Version_1;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NewLocation;                          // 0x0020(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_NewRotation;                          // 0x0038(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Version;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_ExecuteUbergraph_WeatherVolumeActor;

// Function WeatherVolumeActor.WeatherVolumeActor_C.GetFloatInRange
// 0x0030 (0x0030 - 0x0000)
struct WeatherVolumeActor_C_GetFloatInRange final
{
public:
	struct FFloatRange                            FloatRange;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_GetFloatInRange;

// Function WeatherVolumeActor.WeatherVolumeActor_C.GetOwnedPersistentActorComponent
// 0x0008 (0x0008 - 0x0000)
struct WeatherVolumeActor_C_GetOwnedPersistentActorComponent final
{
public:
	class UVoyagePersistentActorComponent*        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_GetOwnedPersistentActorComponent;

// Function WeatherVolumeActor.WeatherVolumeActor_C.MoveVolume
// 0x0210 (0x0210 - 0x0000)
struct WeatherVolumeActor_C_MoveVolume final
{
public:
	float                                         B;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldOffset_SweepHitResult;         // 0x0100(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_MoveVolume;

// Function WeatherVolumeActor.WeatherVolumeActor_C.OnCustomDataLoad
// 0x0018 (0x0018 - 0x0000)
struct WeatherVolumeActor_C_OnCustomDataLoad final
{
public:
	TArray<uint8>                                 InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Version;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_OnCustomDataLoad;

// Function WeatherVolumeActor.WeatherVolumeActor_C.OnCustomDataSave
// 0x0010 (0x0010 - 0x0000)
struct WeatherVolumeActor_C_OnCustomDataSave final
{
public:
	TArray<uint8>                                 OutData;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_OnCustomDataSave;

// Function WeatherVolumeActor.WeatherVolumeActor_C.OnPersistentActorPostLoad
// 0x0004 (0x0004 - 0x0000)
struct WeatherVolumeActor_C_OnPersistentActorPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_OnPersistentActorPostLoad;

// Function WeatherVolumeActor.WeatherVolumeActor_C.OnPersistentSubsystemPostLoad
// 0x0004 (0x0004 - 0x0000)
struct WeatherVolumeActor_C_OnPersistentSubsystemPostLoad final
{
public:
	int32                                         Version;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_OnPersistentSubsystemPostLoad;

// Function WeatherVolumeActor.WeatherVolumeActor_C.OnPersistentTranformReset
// 0x0030 (0x0030 - 0x0000)
struct WeatherVolumeActor_C_OnPersistentTranformReset final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewRotation;                                       // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_OnPersistentTranformReset;

// Function WeatherVolumeActor.WeatherVolumeActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WeatherVolumeActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_ReceiveTick;

// Function WeatherVolumeActor.WeatherVolumeActor_C.UpdateDisabled
// 0x0010 (0x0010 - 0x0000)
struct WeatherVolumeActor_C_UpdateDisabled final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_UpdateDisabled;

// Function WeatherVolumeActor.WeatherVolumeActor_C.UpdateMultiplier
// 0x0018 (0x0018 - 0x0000)
struct WeatherVolumeActor_C_UpdateMultiplier final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateMultiplierAtTime_InTime_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_UpdateMultiplier;

// Function WeatherVolumeActor.WeatherVolumeActor_C.UpdateMultiplierAtTime
// 0x0030 (0x0030 - 0x0000)
struct WeatherVolumeActor_C_UpdateMultiplierAtTime final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Multiplier_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_UpdateMultiplierAtTime;

// Function WeatherVolumeActor.WeatherVolumeActor_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct WeatherVolumeActor_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsEditorBuild_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_UserConstructionScript;

// Function WeatherVolumeActor.WeatherVolumeActor_C.GetOverrideZoneId
// 0x0008 (0x0008 - 0x0000)
struct WeatherVolumeActor_C_GetOverrideZoneId final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_GetOverrideZoneId;

// Function WeatherVolumeActor.WeatherVolumeActor_C.HasAnyChanges
// 0x0001 (0x0001 - 0x0000)
struct WeatherVolumeActor_C_HasAnyChanges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_HasAnyChanges;

// Function WeatherVolumeActor.WeatherVolumeActor_C.HasCustomData
// 0x0001 (0x0001 - 0x0000)
struct WeatherVolumeActor_C_HasCustomData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_HasCustomData;

// Function WeatherVolumeActor.WeatherVolumeActor_C.PersistTranform
// 0x0001 (0x0001 - 0x0000)
struct WeatherVolumeActor_C_PersistTranform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeatherVolumeActor_C_PersistTranform;

}

